1) /var/www/src/Admin/TrackAdmin.php:18    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     protected function configureRoutes(RouteCollection $collection)
     {
-        parent::configureRoutes($collection);
+        
         $collection->remove('create');
         $collection->remove('delete');
     }

2) /var/www/src/Admin/TrackAdmin.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function configureRoutes(RouteCollection $collection)
     {
         parent::configureRoutes($collection);
-        $collection->remove('create');
+        
         $collection->remove('delete');
     }
     protected function configureShowFields(ShowMapper $showMapper)

3) /var/www/src/Admin/TrackAdmin.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         parent::configureRoutes($collection);
         $collection->remove('create');
-        $collection->remove('delete');
+        
     }
     protected function configureShowFields(ShowMapper $showMapper)
     {

4) /var/www/src/Admin/TrackAdmin.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureShowFields(ShowMapper $showMapper)
     {
-        $showMapper->add('nameEn')->add('nameBg')->add('id')->add('type');
+        
     }
     protected function configureListFields(ListMapper $listMapper)
     {

5) /var/www/src/Admin/TrackAdmin.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureListFields(ListMapper $listMapper)
     {
-        $listMapper->addIdentifier('id')->add('nameEn')->add('nameBg')->add('slug')->add('sendBy')->add('_action', 'actions', ['actions' => ['edit' => []]]);
+        
     }
     protected function configureFormFields(FormMapper $formMapper)
     {

6) /var/www/src/Admin/TrackAdmin.php:41    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureListFields(ListMapper $listMapper)
     {
-        $listMapper->addIdentifier('id')->add('nameEn')->add('nameBg')->add('slug')->add('sendBy')->add('_action', 'actions', ['actions' => ['edit' => []]]);
+        $listMapper->addIdentifier('id')->add('nameEn')->add('nameBg')->add('slug')->add('sendBy')->add('_action', 'actions', []);
     }
     protected function configureFormFields(FormMapper $formMapper)
     {

7) /var/www/src/Admin/TrackAdmin.php:42    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureListFields(ListMapper $listMapper)
     {
-        $listMapper->addIdentifier('id')->add('nameEn')->add('nameBg')->add('slug')->add('sendBy')->add('_action', 'actions', ['actions' => ['edit' => []]]);
+        $listMapper->addIdentifier('id')->add('nameEn')->add('nameBg')->add('slug')->add('sendBy')->add('_action', 'actions', ['actions' => []]);
     }
     protected function configureFormFields(FormMapper $formMapper)
     {

8) /var/www/src/Admin/TrackAdmin.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureFormFields(FormMapper $formMapper)
     {
-        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('downhills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('sendBy')->end();
+        
     }
     protected function configureDatagridFilters(DatagridMapper $datagridMapper)
     {

9) /var/www/src/Admin/TrackAdmin.php:57    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureFormFields(FormMapper $formMapper)
     {
-        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('downhills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('sendBy')->end();
+        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['multiple' => true])->add('downhills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('sendBy')->end();
     }
     protected function configureDatagridFilters(DatagridMapper $datagridMapper)
     {

10) /var/www/src/Admin/TrackAdmin.php:59    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     protected function configureFormFields(FormMapper $formMapper)
     {
-        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('downhills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('sendBy')->end();
+        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['class' => Track::class, 'multiple' => false])->add('downhills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('sendBy')->end();
     }
     protected function configureDatagridFilters(DatagridMapper $datagridMapper)
     {

11) /var/www/src/Admin/TrackAdmin.php:65    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureFormFields(FormMapper $formMapper)
     {
-        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('downhills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('sendBy')->end();
+        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('downhills', EntityType::class, ['multiple' => true])->add('sendBy')->end();
     }
     protected function configureDatagridFilters(DatagridMapper $datagridMapper)
     {

12) /var/www/src/Admin/TrackAdmin.php:67    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     protected function configureFormFields(FormMapper $formMapper)
     {
-        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('downhills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('sendBy')->end();
+        $formMapper->add('nameEn')->add('nameBg')->add('type')->add('uphills', EntityType::class, ['class' => Track::class, 'multiple' => true])->add('downhills', EntityType::class, ['class' => Track::class, 'multiple' => false])->add('sendBy')->end();
     }
     protected function configureDatagridFilters(DatagridMapper $datagridMapper)
     {

13) /var/www/src/Admin/TrackAdmin.php:76    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureDatagridFilters(DatagridMapper $datagridMapper)
     {
-        $datagridMapper->add('id')->add('nameEn')->add('nameBg')->add('slug');
+        
     }
 }

16) /var/www/src/Admin/UserAdmin.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureShowFields(ShowMapper $showMapper)
     {
-        $showMapper->add('id');
+        
     }
     protected function configureListFields(ListMapper $listMapper)
     {

17) /var/www/src/Admin/UserAdmin.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureListFields(ListMapper $listMapper)
     {
-        $listMapper->addIdentifier('id')->add('email')->add('enabled')->add('username')->add('_action', 'actions', ['actions' => ['edit' => [], 'delete' => []]]);
+        
     }
     protected function configureFormFields(FormMapper $formMapper)
     {

18) /var/www/src/Admin/UserAdmin.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureListFields(ListMapper $listMapper)
     {
-        $listMapper->addIdentifier('id')->add('email')->add('enabled')->add('username')->add('_action', 'actions', ['actions' => ['edit' => [], 'delete' => []]]);
+        $listMapper->addIdentifier('id')->add('email')->add('enabled')->add('username')->add('_action', 'actions', []);
     }
     protected function configureFormFields(FormMapper $formMapper)
     {

19) /var/www/src/Admin/UserAdmin.php:34    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureListFields(ListMapper $listMapper)
     {
-        $listMapper->addIdentifier('id')->add('email')->add('enabled')->add('username')->add('_action', 'actions', ['actions' => ['edit' => [], 'delete' => []]]);
+        $listMapper->addIdentifier('id')->add('email')->add('enabled')->add('username')->add('_action', 'actions', ['actions' => ['delete' => []]]);
     }
     protected function configureFormFields(FormMapper $formMapper)
     {

20) /var/www/src/Admin/UserAdmin.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function configureFormFields(FormMapper $formMapper)
     {
-        $formMapper->add('id')->add('email')->end();
+        
     }
 }

114) /var/www/src/Controller/Place/Image.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Contracts\Translation\TranslatorInterface;
 class Image extends AbstractController
 {
-    public function addImage(string $id, Request $request, PlaceRepository $placeRepo, TranslatorInterface $translator)
+    protected function addImage(string $id, Request $request, PlaceRepository $placeRepo, TranslatorInterface $translator)
     {
         $token = $request->request->get('token');
         if (!$this->isCsrfTokenValid('file_upload', $token)) {

115) /var/www/src/Controller/Place/Image.php:18    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function addImage(string $id, Request $request, PlaceRepository $placeRepo, TranslatorInterface $translator)
     {
         $token = $request->request->get('token');
-        if (!$this->isCsrfTokenValid('file_upload', $token)) {
+        if ($this->isCsrfTokenValid('file_upload', $token)) {
             throw $this->createAccessDeniedException('csrf check failed');
         }
         $uploader = new ImageUploader($this->getParameter('place_images_directory'), $placeRepo, $translator);

116) /var/www/src/Controller/Place/Image.php:19    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $token = $request->request->get('token');
         if (!$this->isCsrfTokenValid('file_upload', $token)) {
-            throw $this->createAccessDeniedException('csrf check failed');
+            $this->createAccessDeniedException('csrf check failed');
         }
         $uploader = new ImageUploader($this->getParameter('place_images_directory'), $placeRepo, $translator);
         $user = $this->getUser();

327) /var/www/src/Controller/Track/Image.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Contracts\Translation\TranslatorInterface;
 class Image extends AbstractController
 {
-    public function addImage(string $id, Request $request, TrackRepository $trackRepo, TranslatorInterface $translator)
+    protected function addImage(string $id, Request $request, TrackRepository $trackRepo, TranslatorInterface $translator)
     {
         $token = $request->request->get('token');
         if (!$this->isCsrfTokenValid('file_upload', $token)) {

650) /var/www/src/Security/Authorization/Voter/PlaceVoter.php:14    [M] LogicalNot

--- Original
+++ New
@@ @@
 {
     protected function supports($attribute, $subject)
     {
-        if (!$subject instanceof Place) {
+        if ($subject instanceof Place) {
             return false;
         }
         switch ($attribute) {

651) /var/www/src/Security/Authorization/Voter/PlaceVoter.php:15    [M] FalseValue

--- Original
+++ New
@@ @@
     protected function supports($attribute, $subject)
     {
         if (!$subject instanceof Place) {
-            return false;
+            return true;
         }
         switch ($attribute) {
             case 'edit':

652) /var/www/src/Security/Authorization/Voter/PlaceVoter.php:20    [M] TrueValue

--- Original
+++ New
@@ @@
         }
         switch ($attribute) {
             case 'edit':
-                return true;
+                return false;
         }
         return false;
     }

654) /var/www/src/Security/Authorization/Voter/PlaceVoter.php:32    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         /* @var $subject Place */
         $user = $token->getUser();
-        if (!$user instanceof User) {
+        if ($user instanceof User) {
             return false;
         }
         if (in_array('ROLE_ADMIN', $user->getRoles())) {

655) /var/www/src/Security/Authorization/Voter/PlaceVoter.php:33    [M] FalseValue

--- Original
+++ New
@@ @@
         /* @var $subject Place */
         $user = $token->getUser();
         if (!$user instanceof User) {
-            return false;
+            return true;
         }
         if (in_array('ROLE_ADMIN', $user->getRoles())) {
             return true;

656) /var/www/src/Security/Authorization/Voter/PlaceVoter.php:37    [M] TrueValue

--- Original
+++ New
@@ @@
             return false;
         }
         if (in_array('ROLE_ADMIN', $user->getRoles())) {
-            return true;
+            return false;
         }
         if ($subject->getSendBy() === $token->getUser()) {
             return true;

657) /var/www/src/Security/Authorization/Voter/PlaceVoter.php:40    [M] Identical

--- Original
+++ New
@@ @@
         if (in_array('ROLE_ADMIN', $user->getRoles())) {
             return true;
         }
-        if ($subject->getSendBy() === $token->getUser()) {
+        if ($subject->getSendBy() !== $token->getUser()) {
             return true;
         }
         return false;
     }

658) /var/www/src/Security/Authorization/Voter/PlaceVoter.php:41    [M] TrueValue

--- Original
+++ New
@@ @@
             return true;
         }
         if ($subject->getSendBy() === $token->getUser()) {
-            return true;
+            return false;
         }
         return false;
     }
 }

660) /var/www/src/Security/Authorization/Voter/TrackVoter.php:14    [M] LogicalNot

--- Original
+++ New
@@ @@
 {
     protected function supports($attribute, $subject)
     {
-        if (!$subject instanceof Track) {
+        if ($subject instanceof Track) {
             return false;
         }
         switch ($attribute) {

661) /var/www/src/Security/Authorization/Voter/TrackVoter.php:15    [M] FalseValue

--- Original
+++ New
@@ @@
     protected function supports($attribute, $subject)
     {
         if (!$subject instanceof Track) {
-            return false;
+            return true;
         }
         switch ($attribute) {
             case 'edit':

670) /var/www/src/Security/Core/OAuthUserProvider.php:23    [M] Throw_

--- Original
+++ New
@@ @@
          */
         $idFromThirdParty = $response->getUsername();
         if (empty($idFromThirdParty)) {
-            throw new AccountNotLinkedException(sprintf("User '%s' not found.", $idFromThirdParty));
+            new AccountNotLinkedException(sprintf("User '%s' not found.", $idFromThirdParty));
         }
         $field = $this->getProperty($response);
         $user = $this->userManager->findUserBy([$field => $idFromThirdParty]);

671) /var/www/src/Security/Core/OAuthUserProvider.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             throw new AccountNotLinkedException(sprintf("User '%s' not found.", $idFromThirdParty));
         }
         $field = $this->getProperty($response);
-        $user = $this->userManager->findUserBy([$field => $idFromThirdParty]);
+        $user = $this->userManager->findUserBy([]);
         if (!$user) {
             // if user email is changed in 3rd party system, then change our data too
             // the problem is when user have login from facebook and google and emails are different :(

672) /var/www/src/Security/Core/OAuthUserProvider.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
         $field = $this->getProperty($response);
         $user = $this->userManager->findUserBy([$field => $idFromThirdParty]);
-        if (!$user) {
+        if ($user) {
             // if user email is changed in 3rd party system, then change our data too
             // the problem is when user have login from facebook and google and emails are different :(
             if ($response->getEmail()) {

673) /var/www/src/Security/Core/OAuthUserProvider.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $user = $this->userManager->findUserByEmail($response->getEmail());
             }
             if ($user) {
-                $user->setFacebookId($idFromThirdParty);
+                
             }
         }
         if (!$user) {

674) /var/www/src/Security/Core/OAuthUserProvider.php:41    [M] LogicalNot

--- Original
+++ New
@@ @@
                 $user->setFacebookId($idFromThirdParty);
             }
         }
-        if (!$user) {
+        if ($user) {
             $user = new \App\Entity\User\User();
             $user->setFacebookId($idFromThirdParty);
             $usernameFromThirdParty = $response->getNickname();

675) /var/www/src/Security/Core/OAuthUserProvider.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         if (!$user) {
             $user = new \App\Entity\User\User();
-            $user->setFacebookId($idFromThirdParty);
+            
             $usernameFromThirdParty = $response->getNickname();
             $username = $usernameFromThirdParty;
             $usernameExists = true;

676) /var/www/src/Security/Core/OAuthUserProvider.php:47    [M] TrueValue

--- Original
+++ New
@@ @@
             $user->setFacebookId($idFromThirdParty);
             $usernameFromThirdParty = $response->getNickname();
             $username = $usernameFromThirdParty;
-            $usernameExists = true;
+            $usernameExists = false;
             $counter = 0;
             while ($usernameExists) {
                 if ($counter) {

677) /var/www/src/Security/Core/OAuthUserProvider.php:48    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $usernameFromThirdParty = $response->getNickname();
             $username = $usernameFromThirdParty;
             $usernameExists = true;
-            $counter = 0;
+            $counter = 1;
             while ($usernameExists) {
                 if ($counter) {
                     $username = $usernameFromThirdParty . $counter;

678) /var/www/src/Security/Core/OAuthUserProvider.php:48    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $usernameFromThirdParty = $response->getNickname();
             $username = $usernameFromThirdParty;
             $usernameExists = true;
-            $counter = 0;
+            $counter = -1;
             while ($usernameExists) {
                 if ($counter) {
                     $username = $usernameFromThirdParty . $counter;

679) /var/www/src/Security/Core/OAuthUserProvider.php:55    [M] LogicalNot

--- Original
+++ New
@@ @@
                     $username = $usernameFromThirdParty . $counter;
                 }
                 $existingUser = $this->userManager->findUserByUsername($username);
-                if (!$existingUser) {
+                if ($existingUser) {
                     $usernameExists = false;
                 }
                 $counter++;

680) /var/www/src/Security/Core/OAuthUserProvider.php:56    [M] FalseValue

--- Original
+++ New
@@ @@
                 }
                 $existingUser = $this->userManager->findUserByUsername($username);
                 if (!$existingUser) {
-                    $usernameExists = false;
+                    $usernameExists = true;
                 }
                 $counter++;
             }

681) /var/www/src/Security/Core/OAuthUserProvider.php:59    [M] Increment

--- Original
+++ New
@@ @@
                 if (!$existingUser) {
                     $usernameExists = false;
                 }
-                $counter++;
+                $counter--;
             }
             $user->setUsername($username);
             $user->setEmail($response->getEmail());

682) /var/www/src/Security/Core/OAuthUserProvider.php:62    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
                 $counter++;
             }
-            $user->setUsername($username);
+            
             $user->setEmail($response->getEmail());
             $user->setPassword(sha1(base64_encode(random_bytes(30))));
             $user->setEnabled(true);

683) /var/www/src/Security/Core/OAuthUserProvider.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $counter++;
             }
             $user->setUsername($username);
-            $user->setEmail($response->getEmail());
+            
             $user->setPassword(sha1(base64_encode(random_bytes(30))));
             $user->setEnabled(true);
             $this->userManager->updateUser($user);

684) /var/www/src/Security/Core/OAuthUserProvider.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $user->setUsername($username);
             $user->setEmail($response->getEmail());
-            $user->setPassword(sha1(base64_encode(random_bytes(30))));
+            
             $user->setEnabled(true);
             $this->userManager->updateUser($user);
         }

685) /var/www/src/Security/Core/OAuthUserProvider.php:66    [M] IncrementInteger

--- Original
+++ New
@@ @@
             }
             $user->setUsername($username);
             $user->setEmail($response->getEmail());
-            $user->setPassword(sha1(base64_encode(random_bytes(30))));
+            $user->setPassword(sha1(base64_encode(random_bytes(31))));
             $user->setEnabled(true);
             $this->userManager->updateUser($user);
         }

686) /var/www/src/Security/Core/OAuthUserProvider.php:66    [M] DecrementInteger

--- Original
+++ New
@@ @@
             }
             $user->setUsername($username);
             $user->setEmail($response->getEmail());
-            $user->setPassword(sha1(base64_encode(random_bytes(30))));
+            $user->setPassword(sha1(base64_encode(random_bytes(29))));
             $user->setEnabled(true);
             $this->userManager->updateUser($user);
         }

687) /var/www/src/Security/Core/OAuthUserProvider.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->setUsername($username);
             $user->setEmail($response->getEmail());
             $user->setPassword(sha1(base64_encode(random_bytes(30))));
-            $user->setEnabled(true);
+            
             $this->userManager->updateUser($user);
         }
         return $user;
     }

688) /var/www/src/Security/Core/OAuthUserProvider.php:69    [M] TrueValue

--- Original
+++ New
@@ @@
             $user->setUsername($username);
             $user->setEmail($response->getEmail());
             $user->setPassword(sha1(base64_encode(random_bytes(30))));
-            $user->setEnabled(true);
+            $user->setEnabled(false);
             $this->userManager->updateUser($user);
         }
         return $user;
     }

689) /var/www/src/Security/Core/OAuthUserProvider.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->setEmail($response->getEmail());
             $user->setPassword(sha1(base64_encode(random_bytes(30))));
             $user->setEnabled(true);
-            $this->userManager->updateUser($user);
+            
         }
         return $user;
     }
 }
