1) /var/www/src/Entity/Point/PointTrait.php:29    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function distance(PointInterface $point) : float
     {
-        $r = 6371000;
+        $r = 6371001;
         $dLan = deg2rad($point->getLat() - $this->getLat());
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());

2) /var/www/src/Entity/Point/PointTrait.php:29    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function distance(PointInterface $point) : float
     {
-        $r = 6371000;
+        $r = 6370999;
         $dLan = deg2rad($point->getLat() - $this->getLat());
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());

3) /var/www/src/Entity/Point/PointTrait.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
-        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
+        $a = sin($dLan / 1) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
         $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
         return $c * $r;
     }
 }

4) /var/www/src/Entity/Point/PointTrait.php:37    [M] Multiplication

--- Original
+++ New
@@ @@
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
-        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
+        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) / cos($lat2);
         $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
         return $c * $r;
     }
 }

5) /var/www/src/Entity/Point/PointTrait.php:37    [M] Multiplication

--- Original
+++ New
@@ @@
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
-        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
+        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 / cos($lat1) * cos($lat2);
         $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
         return $c * $r;
     }
 }

6) /var/www/src/Entity/Point/PointTrait.php:37    [M] Division

--- Original
+++ New
@@ @@
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
-        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
+        $a = sin($dLan / 2) ** 2 + sin($dLng * 2) ** 2 * cos($lat1) * cos($lat2);
         $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
         return $c * $r;
     }
 }

7) /var/www/src/Entity/Point/PointTrait.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
-        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
+        $a = sin($dLan / 2) ** 2 + sin($dLng / 1) ** 2 * cos($lat1) * cos($lat2);
         $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
         return $c * $r;
     }
 }

8) /var/www/src/Entity/Point/PointTrait.php:37    [M] Division

--- Original
+++ New
@@ @@
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
-        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
+        $a = sin($dLan * 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
         $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
         return $c * $r;
     }
 }

9) /var/www/src/Entity/Point/PointTrait.php:37    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $dLng = deg2rad($point->getLng() - $this->getLng());
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
-        $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
+        $a = sin($dLan / 3) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
         $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
         return $c * $r;
     }
 }

10) /var/www/src/Entity/Point/PointTrait.php:38    [M] Minus

--- Original
+++ New
@@ @@
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
         $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
-        $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
+        $c = 2 * atan2(sqrt($a), sqrt(1 + $a));
         return $c * $r;
     }
 }

11) /var/www/src/Entity/Point/PointTrait.php:38    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $lat1 = deg2rad($this->getLat());
         $lat2 = deg2rad($point->getLat());
         $a = sin($dLan / 2) ** 2 + sin($dLng / 2) ** 2 * cos($lat1) * cos($lat2);
-        $c = 2 * atan2(sqrt($a), sqrt(1 - $a));
+        $c = 3 * atan2(sqrt($a), sqrt(1 - $a));
         return $c * $r;
     }
 }

12) /var/www/src/Entity/Track.php:217    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function addVersion(Version $version)
     {
-        $version->setTrack($this);
+        
         $this->versions->add($version);
     }
     public function addImage(Image $image)

13) /var/www/src/Entity/Track.php:223    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function addImage(Image $image)
     {
-        $this->images->add($image);
+        
     }
     /**
      * @return ArrayCollection|Version[]

14) /var/www/src/Entity/Track.php:263    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return Track[]
      */
-    public function getUphills() : array
+    protected function getUphills() : array
     {
         return $this->uphills->toArray();
     }

15) /var/www/src/Entity/Track.php:291    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return Track[]
      */
-    public function getDownhills()
+    protected function getDownhills()
     {
         return $this->downhills->toArray();
     }

16) /var/www/src/Entity/Track.php:296    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         return $this->downhills->toArray();
     }
-    public function getDownhillVersions($useCache = false, $ignoredTracks = []) : array
+    public function getDownhillVersions($useCache = true, $ignoredTracks = []) : array
     {
         if ($useCache && $this->downhillVersionsCache !== null) {
             return $this->downhillVersionsCache;

17) /var/www/src/Entity/Track.php:298    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function getDownhillVersions($useCache = false, $ignoredTracks = []) : array
     {
-        if ($useCache && $this->downhillVersionsCache !== null) {
+        if ($useCache || $this->downhillVersionsCache !== null) {
             return $this->downhillVersionsCache;
         }
         $ignoredTracks[] = $this;

18) /var/www/src/Entity/Track.php:298    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function getDownhillVersions($useCache = false, $ignoredTracks = []) : array
     {
-        if ($useCache && $this->downhillVersionsCache !== null) {
+        if ($useCache && $this->downhillVersionsCache === null) {
             return $this->downhillVersionsCache;
         }
         $ignoredTracks[] = $this;

19) /var/www/src/Entity/Track.php:306    [M] Continue_

--- Original
+++ New
@@ @@
         $versions = [];
         foreach ($this->getDownhills() as $downhills) {
             if (array_search($downhills, $ignoredTracks) !== false) {
-                continue;
+                break;
             }
             foreach ($downhills->getVersions() as $version) {
                 $versions[] = $version;

20) /var/www/src/Entity/Track.php:321    [M] FalseValue

--- Original
+++ New
@@ @@
         }
         return $versions;
     }
-    public function getUphillVersions($useCache = false, $ignoredTracks = []) : array
+    public function getUphillVersions($useCache = true, $ignoredTracks = []) : array
     {
         if ($useCache && $this->uphillVersionsCache !== null) {
             return $this->uphillVersionsCache;

21) /var/www/src/Entity/Track.php:323    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function getUphillVersions($useCache = false, $ignoredTracks = []) : array
     {
-        if ($useCache && $this->uphillVersionsCache !== null) {
+        if ($useCache || $this->uphillVersionsCache !== null) {
             return $this->uphillVersionsCache;
         }
         $ignoredTracks[] = $this;

22) /var/www/src/Entity/Track.php:323    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function getUphillVersions($useCache = false, $ignoredTracks = []) : array
     {
-        if ($useCache && $this->uphillVersionsCache !== null) {
+        if ($useCache && $this->uphillVersionsCache === null) {
             return $this->uphillVersionsCache;
         }
         $ignoredTracks[] = $this;

23) /var/www/src/Entity/Track.php:331    [M] Continue_

--- Original
+++ New
@@ @@
         $versions = [];
         foreach ($this->getUphills() as $uphills) {
             if (array_search($uphills, $ignoredTracks) !== false) {
-                continue;
+                break;
             }
             foreach ($uphills->getVersions() as $version) {
                 $versions[] = $version;

24) /var/www/src/Entity/Track/Image.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->sendBy = $sendBy;
         $this->track = $track;
         $this->createdAt = new \DateTime();
-        $track->addImage($this);
+        
     }
     public function getId() : ?string
     {

25) /var/www/src/Entity/Track/Version.php:109    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function addPoint(Point $p)
     {
-        $p->setVersion($this);
+        
         $this->points->add($p);
     }
     public function addWayPoint(WayPoint $wp)

26) /var/www/src/Entity/Track/Version.php:110    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function addPoint(Point $p)
     {
         $p->setVersion($this);
-        $this->points->add($p);
+        
     }
     public function addWayPoint(WayPoint $wp)
     {

28) /var/www/src/EntityTraits/NameTrait.php:23    [M] NotIdentical

--- Original
+++ New
@@ @@
      */
     public function getName(string $locale) : ?string
     {
-        if ($locale === 'bg' && $this->nameBg !== null) {
+        if ($locale === 'bg' && $this->nameBg === null) {
             return $this->nameBg;
         }
         if ($this->nameEn === null) {

29) /var/www/src/Track/Processor.php:24    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     private function isPointReal(Point $pointA, Point $pointB) : bool
     {
-        foreach ($this->twoPointsCheckers as $singlePointChecker) {
+        foreach (array() as $singlePointChecker) {
             if (!$singlePointChecker->isReal($pointA, $pointB)) {
                 return false;
             }

30) /var/www/src/Track/Processor.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function process(string $source, Version $version)
     {
-        $version->getPoints()->clear();
+        
         $xml = simplexml_load_string($source);
         if ($xml === false) {
             throw new \RuntimeException("Xml load failed");

31) /var/www/src/Track/Processor.php:38    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         $version->getPoints()->clear();
         $xml = simplexml_load_string($source);
-        if ($xml === false) {
+        if ($xml === true) {
             throw new \RuntimeException("Xml load failed");
         }
         if ($xml->getName() != "gpx") {

32) /var/www/src/Track/Processor.php:47    [M] DecrementInteger

--- Original
+++ New
@@ @@
             throw new \RuntimeException("Xml invalid format");
         }
         $previousPoint = null;
-        $order = 0;
+        $order = -1;
         $positiveElevation = 0;
         $negativeElevation = 0;
         $version->getWayPoints()->clear();

33) /var/www/src/Track/Processor.php:47    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             throw new \RuntimeException("Xml invalid format");
         }
         $previousPoint = null;
-        $order = 0;
+        $order = 1;
         $positiveElevation = 0;
         $negativeElevation = 0;
         $version->getWayPoints()->clear();

34) /var/www/src/Track/Processor.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $order = 0;
         $positiveElevation = 0;
         $negativeElevation = 0;
-        $version->getWayPoints()->clear();
+        
         foreach ($xml->trk as $track) {
             foreach ($track->trkseg as $trackSegment) {
                 $previousElevation = null;

35) /var/www/src/Track/Processor.php:65    [M] Continue_

--- Original
+++ New
@@ @@
                      * Skip if one or both of them are missing.
                      */
                     if (!isset($attributes['lat']) || !isset($attributes['lon'])) {
-                        /* TODO: Throw an exception for corrupted GPX file? */
-                        continue;
+                        break;
                     }
                     $lat = (float) $attributes['lat'];
                     $lon = (float) $attributes['lon'];

36) /var/www/src/Track/Processor.php:78    [M] LessThan

--- Original
+++ New
@@ @@
                      * exception.
                      * Same applies for longtitude, but the range is -180, 180.
                      */
-                    if ($lat < -90 || $lat > 90) {
+                    if ($lat <= -90 || $lat > 90) {
                         throw new \UnexpectedValueException("Invalid latitude value " . $lat);
                     }
                     if ($lon < -180 || $lon > 180) {

37) /var/www/src/Track/Processor.php:78    [M] GreaterThan

--- Original
+++ New
@@ @@
                      * exception.
                      * Same applies for longtitude, but the range is -180, 180.
                      */
-                    if ($lat < -90 || $lat > 90) {
+                    if ($lat < -90 || $lat >= 90) {
                         throw new \UnexpectedValueException("Invalid latitude value " . $lat);
                     }
                     if ($lon < -180 || $lon > 180) {

38) /var/www/src/Track/Processor.php:82    [M] GreaterThan

--- Original
+++ New
@@ @@
                     if ($lat < -90 || $lat > 90) {
                         throw new \UnexpectedValueException("Invalid latitude value " . $lat);
                     }
-                    if ($lon < -180 || $lon > 180) {
+                    if ($lon < -180 || $lon >= 180) {
                         throw new \UnexpectedValueException("Invalid longitude value " . $lon);
                     }
                     $point = new Point($order, $lat, $lon);

39) /var/www/src/Track/Processor.php:82    [M] LessThan

--- Original
+++ New
@@ @@
                     if ($lat < -90 || $lat > 90) {
                         throw new \UnexpectedValueException("Invalid latitude value " . $lat);
                     }
-                    if ($lon < -180 || $lon > 180) {
+                    if ($lon <= -180 || $lon > 180) {
                         throw new \UnexpectedValueException("Invalid longitude value " . $lon);
                     }
                     $point = new Point($order, $lat, $lon);

40) /var/www/src/Track/Processor.php:98    [M] Plus

--- Original
+++ New
@@ @@
                     }
                     if ($previousPoint) {
                         $distance = $point->distance($previousPoint);
-                        $point->setDistance($distance + $previousPoint->getDistance());
+                        $point->setDistance($distance - $previousPoint->getDistance());
                         if ($previousElevation && $point->getElevation()) {
                             if ($point->getElevation() > $previousElevation) {
                                 $elevationChange = $point->getElevation() - $previousElevation;

41) /var/www/src/Track/Processor.php:101    [M] GreaterThan

--- Original
+++ New
@@ @@
                         $distance = $point->distance($previousPoint);
                         $point->setDistance($distance + $previousPoint->getDistance());
                         if ($previousElevation && $point->getElevation()) {
-                            if ($point->getElevation() > $previousElevation) {
+                            if ($point->getElevation() >= $previousElevation) {
                                 $elevationChange = $point->getElevation() - $previousElevation;
                                 if ($previousRealPoint === null || $this->isPointReal($previousRealPoint, $point)) {
                                     $positiveElevation += $elevationChange;

42) /var/www/src/Track/Processor.php:104    [M] Assignment

--- Original
+++ New
@@ @@
                             if ($point->getElevation() > $previousElevation) {
                                 $elevationChange = $point->getElevation() - $previousElevation;
                                 if ($previousRealPoint === null || $this->isPointReal($previousRealPoint, $point)) {
-                                    $positiveElevation += $elevationChange;
+                                    $positiveElevation = $elevationChange;
                                     $previousRealPoint = $point;
                                 } else {
                                     $point->setElevation();

43) /var/www/src/Track/Processor.php:107    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                                     $positiveElevation += $elevationChange;
                                     $previousRealPoint = $point;
                                 } else {
-                                    $point->setElevation();
+                                    
                                 }
                             } else {
                                 $elevationChange = $previousElevation - $point->getElevation();

44) /var/www/src/Track/Processor.php:111    [M] Identical

--- Original
+++ New
@@ @@
                                 }
                             } else {
                                 $elevationChange = $previousElevation - $point->getElevation();
-                                if ($previousRealPoint === null || $this->isPointReal($previousRealPoint, $point)) {
+                                if ($previousRealPoint !== null || $this->isPointReal($previousRealPoint, $point)) {
                                     $negativeElevation += $elevationChange;
                                     $previousRealPoint = $point;
                                 } else {

45) /var/www/src/Track/Processor.php:112    [M] Assignment

--- Original
+++ New
@@ @@
                             } else {
                                 $elevationChange = $previousElevation - $point->getElevation();
                                 if ($previousRealPoint === null || $this->isPointReal($previousRealPoint, $point)) {
-                                    $negativeElevation += $elevationChange;
+                                    $negativeElevation = $elevationChange;
                                     $previousRealPoint = $point;
                                 } else {
                                     $point->setElevation();

46) /var/www/src/Track/Processor.php:123    [M] Increment

--- Original
+++ New
@@ @@
                         }
                     }
                     $version->addPoint($point);
-                    $order++;
+                    $order--;
                     $previousPoint = $point;
                     if ($point->getElevation()) {
                         $previousElevation = $point->getElevation();

47) /var/www/src/Track/Processor.php:142    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $wayPointXmlAttr = $wayPointXml->attributes();
             $wayPoint = new Track\WayPoint((float) $wayPointXmlAttr['lat'], (float) $wayPointXmlAttr['lon']);
             if ($wayPointXml->ele) {
-                $wayPoint->setElevation(floatval($wayPointXml->ele));
+                
             }
             if ($wayPointXml->name) {
                 $wayPoint->setName($wayPointXml->name);

48) /var/www/src/Track/Processor.php:146    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $wayPoint->setElevation(floatval($wayPointXml->ele));
             }
             if ($wayPointXml->name) {
-                $wayPoint->setName($wayPointXml->name);
+                
             }
             $version->addWayPoint($wayPoint);
         }

49) /var/www/src/Track/TwoPointsChecker/ElevationChecker.php:22    [M] Minus

--- Original
+++ New
@@ @@
     public function isReal(Point $pointA, Point $pointB) : bool
     {
         $distance = $pointA->distance($pointB);
-        $elevation = abs($pointA->getElevation() - $pointB->getElevation());
+        $elevation = abs($pointA->getElevation() + $pointB->getElevation());
         $atan = atan2($elevation, $distance);
         $angle = rad2deg($atan);
         if ($angle > $this->maxAngle) {

50) /var/www/src/Track/TwoPointsChecker/ElevationChecker.php:26    [M] GreaterThan

--- Original
+++ New
@@ @@
         $elevation = abs($pointA->getElevation() - $pointB->getElevation());
         $atan = atan2($elevation, $distance);
         $angle = rad2deg($atan);
-        if ($angle > $this->maxAngle) {
+        if ($angle >= $this->maxAngle) {
             return false;
         }
         return true;
     }
Timed Out mutants:
==================

Not Covered mutants:
====================

21) /var/www/src/Command/ReprocessGpsData.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->em = $em;
         $this->processor = $processor;
-        parent::__construct();
+        
     }
     protected function execute(InputInterface $input, OutputInterface $output)
     {

22) /var/www/src/Command/ReprocessGpsData.php:33    [M] Foreach_

--- Original
+++ New
@@ @@
         // @TODO use query and fetch tracks 1 by 1
         $repo = $this->em->getRepository(Track::class);
         $trackCollection = $repo->findAll();
-        foreach ($trackCollection as $track) {
+        foreach (array() as $track) {
             /* @var $track Track */
             $output->writeln("Processing track {$track->getId()}", OutputInterface::VERBOSITY_VERBOSE);
             $track->prepareForRecalculation();

23) /var/www/src/Command/ReprocessGpsData.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $repo = $this->em->getRepository(Track::class);
         $trackCollection = $repo->findAll();
         foreach ($trackCollection as $track) {
-            /* @var $track Track */
-            $output->writeln("Processing track {$track->getId()}", OutputInterface::VERBOSITY_VERBOSE);
+            
             $track->prepareForRecalculation();
             $optimizedVersionIndex = 0;
             foreach ($track->getVersions() as $versionIndex => $version) {

24) /var/www/src/Command/ReprocessGpsData.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($trackCollection as $track) {
             /* @var $track Track */
             $output->writeln("Processing track {$track->getId()}", OutputInterface::VERBOSITY_VERBOSE);
-            $track->prepareForRecalculation();
+            
             $optimizedVersionIndex = 0;
             foreach ($track->getVersions() as $versionIndex => $version) {
                 $output->writeln("Processing version {$versionIndex}");

25) /var/www/src/Command/ReprocessGpsData.php:39    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             /* @var $track Track */
             $output->writeln("Processing track {$track->getId()}", OutputInterface::VERBOSITY_VERBOSE);
             $track->prepareForRecalculation();
-            $optimizedVersionIndex = 0;
+            $optimizedVersionIndex = 1;
             foreach ($track->getVersions() as $versionIndex => $version) {
                 $output->writeln("Processing version {$versionIndex}");
                 $processor->process($version->getFile()->getFileContent(), $version);

26) /var/www/src/Command/ReprocessGpsData.php:39    [M] DecrementInteger

--- Original
+++ New
@@ @@
             /* @var $track Track */
             $output->writeln("Processing track {$track->getId()}", OutputInterface::VERBOSITY_VERBOSE);
             $track->prepareForRecalculation();
-            $optimizedVersionIndex = 0;
+            $optimizedVersionIndex = -1;
             foreach ($track->getVersions() as $versionIndex => $version) {
                 $output->writeln("Processing version {$versionIndex}");
                 $processor->process($version->getFile()->getFileContent(), $version);

27) /var/www/src/Command/ReprocessGpsData.php:40    [M] Foreach_

--- Original
+++ New
@@ @@
             $output->writeln("Processing track {$track->getId()}", OutputInterface::VERBOSITY_VERBOSE);
             $track->prepareForRecalculation();
             $optimizedVersionIndex = 0;
-            foreach ($track->getVersions() as $versionIndex => $version) {
+            foreach (array() as $versionIndex => $version) {
                 $output->writeln("Processing version {$versionIndex}");
                 $processor->process($version->getFile()->getFileContent(), $version);
                 foreach ($processor->generateOptimizedPoints($version) as $optimizedPoint) {

28) /var/www/src/Command/ReprocessGpsData.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $track->prepareForRecalculation();
             $optimizedVersionIndex = 0;
             foreach ($track->getVersions() as $versionIndex => $version) {
-                $output->writeln("Processing version {$versionIndex}");
+                
                 $processor->process($version->getFile()->getFileContent(), $version);
                 foreach ($processor->generateOptimizedPoints($version) as $optimizedPoint) {
                     $optimizedPoint->setVersionIndex($optimizedVersionIndex);

29) /var/www/src/Command/ReprocessGpsData.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $optimizedVersionIndex = 0;
             foreach ($track->getVersions() as $versionIndex => $version) {
                 $output->writeln("Processing version {$versionIndex}");
-                $processor->process($version->getFile()->getFileContent(), $version);
+                
                 foreach ($processor->generateOptimizedPoints($version) as $optimizedPoint) {
                     $optimizedPoint->setVersionIndex($optimizedVersionIndex);
                     $track->addOptimizedPoint($optimizedPoint);

30) /var/www/src/Command/ReprocessGpsData.php:48    [M] Foreach_

--- Original
+++ New
@@ @@
             foreach ($track->getVersions() as $versionIndex => $version) {
                 $output->writeln("Processing version {$versionIndex}");
                 $processor->process($version->getFile()->getFileContent(), $version);
-                foreach ($processor->generateOptimizedPoints($version) as $optimizedPoint) {
+                foreach (array() as $optimizedPoint) {
                     $optimizedPoint->setVersionIndex($optimizedVersionIndex);
                     $track->addOptimizedPoint($optimizedPoint);
                 }

31) /var/www/src/Command/ReprocessGpsData.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $output->writeln("Processing version {$versionIndex}");
                 $processor->process($version->getFile()->getFileContent(), $version);
                 foreach ($processor->generateOptimizedPoints($version) as $optimizedPoint) {
-                    $optimizedPoint->setVersionIndex($optimizedVersionIndex);
+                    
                     $track->addOptimizedPoint($optimizedPoint);
                 }
                 $optimizedVersionIndex++;

32) /var/www/src/Command/ReprocessGpsData.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $processor->process($version->getFile()->getFileContent(), $version);
                 foreach ($processor->generateOptimizedPoints($version) as $optimizedPoint) {
                     $optimizedPoint->setVersionIndex($optimizedVersionIndex);
-                    $track->addOptimizedPoint($optimizedPoint);
+                    
                 }
                 $optimizedVersionIndex++;
             }

33) /var/www/src/Command/ReprocessGpsData.php:53    [M] Increment

--- Original
+++ New
@@ @@
                     $optimizedPoint->setVersionIndex($optimizedVersionIndex);
                     $track->addOptimizedPoint($optimizedPoint);
                 }
-                $optimizedVersionIndex++;
+                $optimizedVersionIndex--;
             }
             $processor->postProcess($track);
             $this->em->flush();

34) /var/www/src/Command/ReprocessGpsData.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
                 $optimizedVersionIndex++;
             }
-            $processor->postProcess($track);
+            
             $this->em->flush();
         }
     }
 }

35) /var/www/src/Command/ReprocessGpsData.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $optimizedVersionIndex++;
             }
             $processor->postProcess($track);
-            $this->em->flush();
+            
         }
     }
 }
