37) /var/www/src/Controller/Home.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->redirectToRoute('home');
     }
-    public function home(TrackRepository $repo, ImageRepository $imageRepository)
+    protected function home(TrackRepository $repo, ImageRepository $imageRepository)
     {
         $trackData = $repo->findLatestTrackTypes();
         // average picture width is 300px

38) /var/www/src/Controller/Home.php:28    [M] DecrementInteger

--- Original
+++ New
@@ @@
         // average picture width is 300px
         // 1920 / 300 = 6.4
         // 3840 / 300 = 12.8
-        $images = $imageRepository->getLatestImages(10);
+        $images = $imageRepository->getLatestImages(9);
         return $this->render('home/home.html.twig', ['latestTracks' => $trackData[Track::TYPE_CYCLING], 'latestTracksHike' => $trackData[Track::TYPE_HIKING], 'latestImages' => $images]);
     }
     public function find($neLat, $neLon, $swLat, $swLon, Request $request, TrackRepository $repo)

39) /var/www/src/Controller/Home.php:28    [M] IncrementInteger

--- Original
+++ New
@@ @@
         // average picture width is 300px
         // 1920 / 300 = 6.4
         // 3840 / 300 = 12.8
-        $images = $imageRepository->getLatestImages(10);
+        $images = $imageRepository->getLatestImages(11);
         return $this->render('home/home.html.twig', ['latestTracks' => $trackData[Track::TYPE_CYCLING], 'latestTracksHike' => $trackData[Track::TYPE_HIKING], 'latestImages' => $images]);
     }
     public function find($neLat, $neLon, $swLat, $swLon, Request $request, TrackRepository $repo)

40) /var/www/src/Controller/Home.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // 1920 / 300 = 6.4
         // 3840 / 300 = 12.8
         $images = $imageRepository->getLatestImages(10);
-        return $this->render('home/home.html.twig', ['latestTracks' => $trackData[Track::TYPE_CYCLING], 'latestTracksHike' => $trackData[Track::TYPE_HIKING], 'latestImages' => $images]);
+        return $this->render('home/home.html.twig', ['latestTracksHike' => $trackData[Track::TYPE_HIKING], 'latestImages' => $images]);
     }
     public function find($neLat, $neLon, $swLat, $swLon, Request $request, TrackRepository $repo)
     {

41) /var/www/src/Controller/Home.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $images = $imageRepository->getLatestImages(10);
         return $this->render('home/home.html.twig', ['latestTracks' => $trackData[Track::TYPE_CYCLING], 'latestTracksHike' => $trackData[Track::TYPE_HIKING], 'latestImages' => $images]);
     }
-    public function find($neLat, $neLon, $swLat, $swLon, Request $request, TrackRepository $repo)
+    protected function find($neLat, $neLon, $swLat, $swLon, Request $request, TrackRepository $repo)
     {
         $skipTracks = $request->request->get('skipTracks', '');
         $skipTracksAsArray = explode(',', $skipTracks);

42) /var/www/src/Controller/Home.php:51    [M] NewObject

--- Original
+++ New
@@ @@
         $skipTracks = $request->request->get('skipPlaces', '');
         $skipPlacesAsArray = explode(',', $skipTracks);
         $places = $this->findPlaces($neLat, $neLon, $swLat, $swLon, $skipPlacesAsArray, $request->getLocale());
-        return new Response(json_encode(['tracks' => ['status' => $tracks['status'], 'data' => $tracks['data']], 'places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
+        new Response(json_encode(['tracks' => ['status' => $tracks['status'], 'data' => $tracks['data']], 'places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
+        return null;
     }
     private function findTracks($neLat, $neLon, $swLat, $swLon, $repo, $skipTracks, $locale)
     {

43) /var/www/src/Controller/Home.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $skipTracks = $request->request->get('skipPlaces', '');
         $skipPlacesAsArray = explode(',', $skipTracks);
         $places = $this->findPlaces($neLat, $neLon, $swLat, $swLon, $skipPlacesAsArray, $request->getLocale());
-        return new Response(json_encode(['tracks' => ['status' => $tracks['status'], 'data' => $tracks['data']], 'places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
+        return new Response(json_encode(['places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
     }
     private function findTracks($neLat, $neLon, $swLat, $swLon, $repo, $skipTracks, $locale)
     {

44) /var/www/src/Controller/Home.php:53    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $skipTracks = $request->request->get('skipPlaces', '');
         $skipPlacesAsArray = explode(',', $skipTracks);
         $places = $this->findPlaces($neLat, $neLon, $swLat, $swLon, $skipPlacesAsArray, $request->getLocale());
-        return new Response(json_encode(['tracks' => ['status' => $tracks['status'], 'data' => $tracks['data']], 'places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
+        return new Response(json_encode(['tracks' => ['data' => $tracks['data']], 'places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
     }
     private function findTracks($neLat, $neLon, $swLat, $swLon, $repo, $skipTracks, $locale)
     {

45) /var/www/src/Controller/Home.php:57    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $skipTracks = $request->request->get('skipPlaces', '');
         $skipPlacesAsArray = explode(',', $skipTracks);
         $places = $this->findPlaces($neLat, $neLon, $swLat, $swLon, $skipPlacesAsArray, $request->getLocale());
-        return new Response(json_encode(['tracks' => ['status' => $tracks['status'], 'data' => $tracks['data']], 'places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
+        return new Response(json_encode(['tracks' => ['status' => $tracks['status'], 'data' => $tracks['data']], 'places' => ['data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
     }
     private function findTracks($neLat, $neLon, $swLat, $swLon, $repo, $skipTracks, $locale)
     {

46) /var/www/src/Controller/Home.php:63    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $skipTracks = $request->request->get('skipPlaces', '');
         $skipPlacesAsArray = explode(',', $skipTracks);
         $places = $this->findPlaces($neLat, $neLon, $swLat, $swLon, $skipPlacesAsArray, $request->getLocale());
-        return new Response(json_encode(['tracks' => ['status' => $tracks['status'], 'data' => $tracks['data']], 'places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, ['Content-Type' => 'text/json']);
+        return new Response(json_encode(['tracks' => ['status' => $tracks['status'], 'data' => $tracks['data']], 'places' => ['status' => $places['status'], 'data' => $places['data']]]), Response::HTTP_OK, []);
     }
     private function findTracks($neLat, $neLon, $swLat, $swLon, $repo, $skipTracks, $locale)
     {

47) /var/www/src/Controller/Home.php:73    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function findTracks($neLat, $neLon, $swLat, $swLon, $repo, $skipTracks, $locale)
     {
         $qb = $repo->createQueryBuilder('g');
-        $repo->andWhereTrackIsPublic($qb)->andWhereInCoordinates($qb, $skipTracks, $neLat, $swLat, $neLon, $swLon);
+        
         $data = $qb->select($qb->expr()->count('g.id'))->getQuery()->getSingleResult();
         $count = current($data);
         if ($count > 10) {

48) /var/www/src/Controller/Home.php:82    [M] GreaterThan

--- Original
+++ New
@@ @@
         $repo->andWhereTrackIsPublic($qb)->andWhereInCoordinates($qb, $skipTracks, $neLat, $swLat, $neLon, $swLon);
         $data = $qb->select($qb->expr()->count('g.id'))->getQuery()->getSingleResult();
         $count = current($data);
-        if ($count > 10) {
+        if ($count >= 10) {
             $status = ApiResponseInterface::STATUS_TOO_MANY_ROWS_FOUND;
         } else {
             $status = ApiResponseInterface::STATUS_OK;

49) /var/www/src/Controller/Home.php:82    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         $repo->andWhereTrackIsPublic($qb)->andWhereInCoordinates($qb, $skipTracks, $neLat, $swLat, $neLon, $swLon);
         $data = $qb->select($qb->expr()->count('g.id'))->getQuery()->getSingleResult();
         $count = current($data);
-        if ($count > 10) {
+        if ($count <= 10) {
             $status = ApiResponseInterface::STATUS_TOO_MANY_ROWS_FOUND;
         } else {
             $status = ApiResponseInterface::STATUS_OK;

51) /var/www/src/Controller/Home.php:96    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $qb = $repo->createQueryBuilder('g');
         $repo->andWhereTrackIsPublic($qb)->andWhereInCoordinates($qb, $skipTracks, $neLat, $swLat, $neLon, $swLon);
         /* @var $qResult Track[] */
-        $qResult = $qb->select('g')->setMaxResults(10)->getQuery()->getResult();
+        $qResult = $qb->select('g')->setMaxResults(11)->getQuery()->getResult();
         $responseData = [];
         foreach ($qResult as $gps) {
             $gpsArrayData = [];

52) /var/www/src/Controller/Home.php:96    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $qb = $repo->createQueryBuilder('g');
         $repo->andWhereTrackIsPublic($qb)->andWhereInCoordinates($qb, $skipTracks, $neLat, $swLat, $neLon, $swLon);
         /* @var $qResult Track[] */
-        $qResult = $qb->select('g')->setMaxResults(10)->getQuery()->getResult();
+        $qResult = $qb->select('g')->setMaxResults(9)->getQuery()->getResult();
         $responseData = [];
         foreach ($qResult as $gps) {
             $gpsArrayData = [];

53) /var/www/src/Controller/Home.php:102    [M] Foreach_

--- Original
+++ New
@@ @@
         /* @var $qResult Track[] */
         $qResult = $qb->select('g')->setMaxResults(10)->getQuery()->getResult();
         $responseData = [];
-        foreach ($qResult as $gps) {
+        foreach (array() as $gps) {
             $gpsArrayData = [];
             $gpsArrayData['id'] = $gps->getId();
             $gpsArrayData['name'] = $gps->getName($locale);

54) /var/www/src/Controller/Home.php:110    [M] Foreach_

--- Original
+++ New
@@ @@
             $gpsArrayData['slugOrId'] = $gps->getSlugOrId();
             $gpsArrayData['type'] = $gps->getType();
             /* @var $point OptimizedPoint */
-            foreach ($gps->getOptimizedPoints() as $point) {
+            foreach (array() as $point) {
                 $gpsArrayData['points'][$point->getVersionIndex()][] = ['lat' => $point->getLat(), 'lng' => $point->getLng()];
             }
             $responseData[] = $gpsArrayData;

55) /var/www/src/Controller/Home.php:111    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $gpsArrayData['type'] = $gps->getType();
             /* @var $point OptimizedPoint */
             foreach ($gps->getOptimizedPoints() as $point) {
-                $gpsArrayData['points'][$point->getVersionIndex()][] = ['lat' => $point->getLat(), 'lng' => $point->getLng()];
+                $gpsArrayData['points'][$point->getVersionIndex()][] = ['lng' => $point->getLng()];
             }
             $responseData[] = $gpsArrayData;
         }

56) /var/www/src/Controller/Home.php:112    [M] ArrayItem

--- Original
+++ New
@@ @@
             $gpsArrayData['type'] = $gps->getType();
             /* @var $point OptimizedPoint */
             foreach ($gps->getOptimizedPoints() as $point) {
-                $gpsArrayData['points'][$point->getVersionIndex()][] = ['lat' => $point->getLat(), 'lng' => $point->getLng()];
+                $gpsArrayData['points'][$point->getVersionIndex()][] = ['lat' > $point->getLat(), 'lng' => $point->getLng()];
             }
             $responseData[] = $gpsArrayData;
         }

57) /var/www/src/Controller/Home.php:113    [M] ArrayItem

--- Original
+++ New
@@ @@
             $gpsArrayData['type'] = $gps->getType();
             /* @var $point OptimizedPoint */
             foreach ($gps->getOptimizedPoints() as $point) {
-                $gpsArrayData['points'][$point->getVersionIndex()][] = ['lat' => $point->getLat(), 'lng' => $point->getLng()];
+                $gpsArrayData['points'][$point->getVersionIndex()][] = ['lat' => $point->getLat(), 'lng' > $point->getLng()];
             }
             $responseData[] = $gpsArrayData;
         }

58) /var/www/src/Controller/Home.php:120    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             $responseData[] = $gpsArrayData;
         }
-        return ['data' => $responseData, 'status' => $status];
+        return ['status' => $status];
     }
     private function findPlaces($neLat, $neLon, $swLat, $swLon, $skipTracks, $locale)
     {

59) /var/www/src/Controller/Home.php:132    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $repo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         $qb = $repo->createQueryBuilder('g');
-        $repo->andWhereInCoordinates($qb, $skipTracks, $neLat, $swLat, $neLon, $swLon);
+        
         $data = $qb->select($qb->expr()->count('g.id'))->getQuery()->getSingleResult();
         $count = current($data);
         if ($count > 10) {

63) /var/www/src/Controller/Home.php:153    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $qb = $repo->createQueryBuilder('g');
         $repo->andWhereInCoordinates($qb, $skipTracks, $neLat, $swLat, $neLon, $swLon);
         /* @var $qResult \App\Entity\Place[] */
-        $qResult = $qb->select('g')->setMaxResults(10)->getQuery()->getResult();
+        $qResult = $qb->select('g')->setMaxResults(9)->getQuery()->getResult();
         $responseData = [];
         foreach ($qResult as $gps) {
             $gpsArrayData = [];

64) /var/www/src/Controller/Home.php:153    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $qb = $repo->createQueryBuilder('g');
         $repo->andWhereInCoordinates($qb, $skipTracks, $neLat, $swLat, $neLon, $swLon);
         /* @var $qResult \App\Entity\Place[] */
-        $qResult = $qb->select('g')->setMaxResults(10)->getQuery()->getResult();
+        $qResult = $qb->select('g')->setMaxResults(11)->getQuery()->getResult();
         $responseData = [];
         foreach ($qResult as $gps) {
             $gpsArrayData = [];

67) /var/www/src/Controller/Place.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Component\HttpFoundation\Request;
 class Place extends AbstractController
 {
-    public function index(Request $request, PaginatorInterface $paginator)
+    protected function index(Request $request, PaginatorInterface $paginator)
     {
         $repo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         /** @var QueryBuilder $qb */

68) /var/www/src/Controller/Place.php:20    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $repo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         /** @var QueryBuilder $qb */
         $qb = $repo->createQueryBuilder('g')->orderBy('g.createdAt', 'DESC');
-        $places = $paginator->paginate($qb, $request->query->getInt('page', 1), 10);
+        $places = $paginator->paginate($qb, $request->query->getInt('page', 2), 10);
         return $this->render('place/index.html.twig', ['places' => $places]);
     }
     public function new(Request $request)

69) /var/www/src/Controller/Place.php:20    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $repo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         /** @var QueryBuilder $qb */
         $qb = $repo->createQueryBuilder('g')->orderBy('g.createdAt', 'DESC');
-        $places = $paginator->paginate($qb, $request->query->getInt('page', 1), 10);
+        $places = $paginator->paginate($qb, $request->query->getInt('page', 0), 10);
         return $this->render('place/index.html.twig', ['places' => $places]);
     }
     public function new(Request $request)

70) /var/www/src/Controller/Place.php:20    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $repo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         /** @var QueryBuilder $qb */
         $qb = $repo->createQueryBuilder('g')->orderBy('g.createdAt', 'DESC');
-        $places = $paginator->paginate($qb, $request->query->getInt('page', 1), 10);
+        $places = $paginator->paginate($qb, $request->query->getInt('page', 1), 9);
         return $this->render('place/index.html.twig', ['places' => $places]);
     }
     public function new(Request $request)

71) /var/www/src/Controller/Place.php:20    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $repo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         /** @var QueryBuilder $qb */
         $qb = $repo->createQueryBuilder('g')->orderBy('g.createdAt', 'DESC');
-        $places = $paginator->paginate($qb, $request->query->getInt('page', 1), 10);
+        $places = $paginator->paginate($qb, $request->query->getInt('page', 1), 11);
         return $this->render('place/index.html.twig', ['places' => $places]);
     }
     public function new(Request $request)

72) /var/www/src/Controller/Place.php:24    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         /** @var QueryBuilder $qb */
         $qb = $repo->createQueryBuilder('g')->orderBy('g.createdAt', 'DESC');
         $places = $paginator->paginate($qb, $request->query->getInt('page', 1), 10);
-        return $this->render('place/index.html.twig', ['places' => $places]);
+        return $this->render('place/index.html.twig', []);
     }
     public function new(Request $request)
     {

74) /var/www/src/Controller/Place.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function new(Request $request)
     {
         $form = $this->createForm(\App\Form\Type\Place::class);
-        $form->add('submit', SubmitType::class);
+        
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $place = new \App\Entity\Place($form->get('lat')->getData(), $form->get('lng')->getData(), $this->getUser());

75) /var/www/src/Controller/Place.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $form = $this->createForm(\App\Form\Type\Place::class);
         $form->add('submit', SubmitType::class);
-        $form->handleRequest($request);
+        
         if ($form->isSubmitted() && $form->isValid()) {
             $place = new \App\Entity\Place($form->get('lat')->getData(), $form->get('lng')->getData(), $this->getUser());
             if (!$form->get('nameEn')->isEmpty()) {

77) /var/www/src/Controller/Place.php:43    [M] LogicalNot

--- Original
+++ New
@@ @@
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $place = new \App\Entity\Place($form->get('lat')->getData(), $form->get('lng')->getData(), $this->getUser());
-            if (!$form->get('nameEn')->isEmpty()) {
+            if ($form->get('nameEn')->isEmpty()) {
                 $place->setNameEn($form->get('nameEn')->getData());
             }
             if (!$form->get('nameBg')->isEmpty()) {

78) /var/www/src/Controller/Place.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($form->isSubmitted() && $form->isValid()) {
             $place = new \App\Entity\Place($form->get('lat')->getData(), $form->get('lng')->getData(), $this->getUser());
             if (!$form->get('nameEn')->isEmpty()) {
-                $place->setNameEn($form->get('nameEn')->getData());
+                
             }
             if (!$form->get('nameBg')->isEmpty()) {
                 $place->setNameBg($form->get('nameBg')->getData());

79) /var/www/src/Controller/Place.php:47    [M] LogicalNot

--- Original
+++ New
@@ @@
             if (!$form->get('nameEn')->isEmpty()) {
                 $place->setNameEn($form->get('nameEn')->getData());
             }
-            if (!$form->get('nameBg')->isEmpty()) {
+            if ($form->get('nameBg')->isEmpty()) {
                 $place->setNameBg($form->get('nameBg')->getData());
             }
             $place->setType($form->get('type')->getData());

80) /var/www/src/Controller/Place.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $place->setNameEn($form->get('nameEn')->getData());
             }
             if (!$form->get('nameBg')->isEmpty()) {
-                $place->setNameBg($form->get('nameBg')->getData());
+                
             }
             $place->setType($form->get('type')->getData());
             $this->getDoctrine()->getManager()->persist($place);

81) /var/www/src/Controller/Place.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if (!$form->get('nameBg')->isEmpty()) {
                 $place->setNameBg($form->get('nameBg')->getData());
             }
-            $place->setType($form->get('type')->getData());
+            
             $this->getDoctrine()->getManager()->persist($place);
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);

82) /var/www/src/Controller/Place.php:53    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $place->setNameBg($form->get('nameBg')->getData());
             }
             $place->setType($form->get('type')->getData());
-            $this->getDoctrine()->getManager()->persist($place);
+            
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
         }

83) /var/www/src/Controller/Place.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $place->setType($form->get('type')->getData());
             $this->getDoctrine()->getManager()->persist($place);
-            $this->getDoctrine()->getManager()->flush();
+            
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
         }
         return $this->render('place/edit.html.twig', ['form' => $form->createView()]);

84) /var/www/src/Controller/Place.php:56    [M] ArrayItem

--- Original
+++ New
@@ @@
             $place->setType($form->get('type')->getData());
             $this->getDoctrine()->getManager()->persist($place);
             $this->getDoctrine()->getManager()->flush();
-            return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
+            return $this->redirectToRoute('app_place_view', ['id' > $place->getId()]);
         }
         return $this->render('place/edit.html.twig', ['form' => $form->createView()]);
     }

85) /var/www/src/Controller/Place.php:56    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $place->setType($form->get('type')->getData());
             $this->getDoctrine()->getManager()->persist($place);
             $this->getDoctrine()->getManager()->flush();
-            return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
+            return $this->redirectToRoute('app_place_view', []);
         }
         return $this->render('place/edit.html.twig', ['form' => $form->createView()]);
     }

86) /var/www/src/Controller/Place.php:61    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
         }
-        return $this->render('place/edit.html.twig', ['form' => $form->createView()]);
+        return $this->render('place/edit.html.twig', []);
     }
     public function edit(string $id, Request $request)
     {

87) /var/www/src/Controller/Place.php:62    [M] ArrayItem

--- Original
+++ New
@@ @@
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
         }
-        return $this->render('place/edit.html.twig', ['form' => $form->createView()]);
+        return $this->render('place/edit.html.twig', ['form' > $form->createView()]);
     }
     public function edit(string $id, Request $request)
     {

88) /var/www/src/Controller/Place.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->render('place/edit.html.twig', ['form' => $form->createView()]);
     }
-    public function edit(string $id, Request $request)
+    protected function edit(string $id, Request $request)
     {
         $placeRepo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         $place = $placeRepo->findOneBy(['id' => $id]);

89) /var/www/src/Controller/Place.php:70    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function edit(string $id, Request $request)
     {
         $placeRepo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
-        $place = $placeRepo->findOneBy(['id' => $id]);
+        $place = $placeRepo->findOneBy([]);
         $this->denyAccessUnlessGranted('edit', $place);
         $form = $this->createForm(\App\Form\Type\Place::class);
         $form->add('submit', SubmitType::class);

90) /var/www/src/Controller/Place.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $placeRepo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         $place = $placeRepo->findOneBy(['id' => $id]);
-        $this->denyAccessUnlessGranted('edit', $place);
+        
         $form = $this->createForm(\App\Form\Type\Place::class);
         $form->add('submit', SubmitType::class);
         $form->get('lat')->setData($place->getLat());

92) /var/www/src/Controller/Place.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->denyAccessUnlessGranted('edit', $place);
         $form = $this->createForm(\App\Form\Type\Place::class);
         $form->add('submit', SubmitType::class);
-        $form->get('lat')->setData($place->getLat());
+        
         $form->get('lng')->setData($place->getLng());
         $form->get('nameEn')->setData($place->getNameEn());
         $form->get('nameBg')->setData($place->getNameBg());

93) /var/www/src/Controller/Place.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form = $this->createForm(\App\Form\Type\Place::class);
         $form->add('submit', SubmitType::class);
         $form->get('lat')->setData($place->getLat());
-        $form->get('lng')->setData($place->getLng());
+        
         $form->get('nameEn')->setData($place->getNameEn());
         $form->get('nameBg')->setData($place->getNameBg());
         $form->get('type')->setData($place->getType());

94) /var/www/src/Controller/Place.php:79    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->add('submit', SubmitType::class);
         $form->get('lat')->setData($place->getLat());
         $form->get('lng')->setData($place->getLng());
-        $form->get('nameEn')->setData($place->getNameEn());
+        
         $form->get('nameBg')->setData($place->getNameBg());
         $form->get('type')->setData($place->getType());
         $form->handleRequest($request);

95) /var/www/src/Controller/Place.php:80    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->get('lat')->setData($place->getLat());
         $form->get('lng')->setData($place->getLng());
         $form->get('nameEn')->setData($place->getNameEn());
-        $form->get('nameBg')->setData($place->getNameBg());
+        
         $form->get('type')->setData($place->getType());
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {

96) /var/www/src/Controller/Place.php:81    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->get('lng')->setData($place->getLng());
         $form->get('nameEn')->setData($place->getNameEn());
         $form->get('nameBg')->setData($place->getNameBg());
-        $form->get('type')->setData($place->getType());
+        
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $place->setLat($form->get('lat')->getData());

97) /var/www/src/Controller/Place.php:83    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->get('nameEn')->setData($place->getNameEn());
         $form->get('nameBg')->setData($place->getNameBg());
         $form->get('type')->setData($place->getType());
-        $form->handleRequest($request);
+        
         if ($form->isSubmitted() && $form->isValid()) {
             $place->setLat($form->get('lat')->getData());
             $place->setLng($form->get('lng')->getData());

99) /var/www/src/Controller/Place.php:85    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->get('type')->setData($place->getType());
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
-            $place->setLat($form->get('lat')->getData());
+            
             $place->setLng($form->get('lng')->getData());
             $place->setNameEn($form->get('nameEn')->getData());
             $place->setNameBg($form->get('nameBg')->getData());
