100) /var/www/src/Controller/Place.php:86    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $place->setLat($form->get('lat')->getData());
-            $place->setLng($form->get('lng')->getData());
+            
             $place->setNameEn($form->get('nameEn')->getData());
             $place->setNameBg($form->get('nameBg')->getData());
             $place->setType($form->get('type')->getData());

101) /var/www/src/Controller/Place.php:87    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($form->isSubmitted() && $form->isValid()) {
             $place->setLat($form->get('lat')->getData());
             $place->setLng($form->get('lng')->getData());
-            $place->setNameEn($form->get('nameEn')->getData());
+            
             $place->setNameBg($form->get('nameBg')->getData());
             $place->setType($form->get('type')->getData());
             $this->getDoctrine()->getManager()->flush();

102) /var/www/src/Controller/Place.php:88    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $place->setLat($form->get('lat')->getData());
             $place->setLng($form->get('lng')->getData());
             $place->setNameEn($form->get('nameEn')->getData());
-            $place->setNameBg($form->get('nameBg')->getData());
+            
             $place->setType($form->get('type')->getData());
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);

103) /var/www/src/Controller/Place.php:89    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $place->setLng($form->get('lng')->getData());
             $place->setNameEn($form->get('nameEn')->getData());
             $place->setNameBg($form->get('nameBg')->getData());
-            $place->setType($form->get('type')->getData());
+            
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
         }

104) /var/www/src/Controller/Place.php:91    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $place->setNameEn($form->get('nameEn')->getData());
             $place->setNameBg($form->get('nameBg')->getData());
             $place->setType($form->get('type')->getData());
-            $this->getDoctrine()->getManager()->flush();
+            
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
         }
         return $this->render('place/edit.html.twig', ['form' => $form->createView(), 'place' => $place]);

107) /var/www/src/Controller/Place.php:98    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
         }
-        return $this->render('place/edit.html.twig', ['form' => $form->createView(), 'place' => $place]);
+        return $this->render('place/edit.html.twig', ['place' => $place]);
     }
     public function view(string $id, Request $request)
     {

108) /var/www/src/Controller/Place.php:99    [M] ArrayItem

--- Original
+++ New
@@ @@
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('app_place_view', ['id' => $place->getId()]);
         }
-        return $this->render('place/edit.html.twig', ['form' => $form->createView(), 'place' => $place]);
+        return $this->render('place/edit.html.twig', ['form' > $form->createView(), 'place' => $place]);
     }
     public function view(string $id, Request $request)
     {

109) /var/www/src/Controller/Place.php:105    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->render('place/edit.html.twig', ['form' => $form->createView(), 'place' => $place]);
     }
-    public function view(string $id, Request $request)
+    protected function view(string $id, Request $request)
     {
         $placeRepo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         $place = $placeRepo->findOneBy(['id' => $id]);

111) /var/www/src/Controller/Place.php:112    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $placeRepo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         $place = $placeRepo->findOneBy(['id' => $id]);
-        return $this->render('place/view.html.twig', ['place' => $place, 'app_title' => $place->getName($request->getLocale()), 'canEdit' => $this->isGranted('edit', $place)]);
+        return $this->render('place/view.html.twig', ['app_title' => $place->getName($request->getLocale()), 'canEdit' => $this->isGranted('edit', $place)]);
     }
 }

112) /var/www/src/Controller/Place.php:114    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $placeRepo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         $place = $placeRepo->findOneBy(['id' => $id]);
-        return $this->render('place/view.html.twig', ['place' => $place, 'app_title' => $place->getName($request->getLocale()), 'canEdit' => $this->isGranted('edit', $place)]);
+        return $this->render('place/view.html.twig', ['place' => $place, 'app_title' > $place->getName($request->getLocale()), 'canEdit' => $this->isGranted('edit', $place)]);
     }
 }

113) /var/www/src/Controller/Place.php:115    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $placeRepo = $this->getDoctrine()->getRepository(\App\Entity\Place::class);
         $place = $placeRepo->findOneBy(['id' => $id]);
-        return $this->render('place/view.html.twig', ['place' => $place, 'app_title' => $place->getName($request->getLocale()), 'canEdit' => $this->isGranted('edit', $place)]);
+        return $this->render('place/view.html.twig', ['place' => $place, 'app_title' => $place->getName($request->getLocale()), 'canEdit' > $this->isGranted('edit', $place)]);
     }
 }

117) /var/www/src/Controller/Place/Image.php:31    [M] NewObject

--- Original
+++ New
@@ @@
         $uploader = new ImageUploader($this->getParameter('place_images_directory'), $placeRepo, $translator);
         $user = $this->getUser();
         $entityCreator = function ($path, $parentEntity) use($user) {
-            return new \App\Entity\Place\Image($path, $user, $parentEntity);
+            new \App\Entity\Place\Image($path, $user, $parentEntity);
+            return null;
         };
         list($image, $response) = $uploader->addImage($id, $request, $entityCreator);
         if ($image) {

118) /var/www/src/Controller/Place/Image.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         };
         list($image, $response) = $uploader->addImage($id, $request, $entityCreator);
         if ($image) {
-            $this->getDoctrine()->getManager()->persist($image);
+            
             $this->getDoctrine()->getManager()->flush();
         }
         return $response;

119) /var/www/src/Controller/Place/Image.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         list($image, $response) = $uploader->addImage($id, $request, $entityCreator);
         if ($image) {
             $this->getDoctrine()->getManager()->persist($image);
-            $this->getDoctrine()->getManager()->flush();
+            
         }
         return $response;
     }

120) /var/www/src/Controller/Place/Image.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * This method is called when thumbnails doesn't exists.
      * Thumbnail will be created and saved in the "public" directory.
      */
-    public function generateThumbnail(int $year, string $placeId, string $imagePath, int $maxWidth, int $maxHeight, Request $request)
+    protected function generateThumbnail(int $year, string $placeId, string $imagePath, int $maxWidth, int $maxHeight, Request $request)
     {
         $originalImagePath = $this->getParameter('place_images_directory') . DIRECTORY_SEPARATOR;
         $originalImagePath .= $year . DIRECTORY_SEPARATOR . $placeId . DIRECTORY_SEPARATOR . $imagePath;

121) /var/www/src/Controller/Place/Image.php:51    [M] Assignment

--- Original
+++ New
@@ @@
     public function generateThumbnail(int $year, string $placeId, string $imagePath, int $maxWidth, int $maxHeight, Request $request)
     {
         $originalImagePath = $this->getParameter('place_images_directory') . DIRECTORY_SEPARATOR;
-        $originalImagePath .= $year . DIRECTORY_SEPARATOR . $placeId . DIRECTORY_SEPARATOR . $imagePath;
+        $originalImagePath = $year . DIRECTORY_SEPARATOR . $placeId . DIRECTORY_SEPARATOR . $imagePath;
         $thumbnailPathDir = $this->getParameter('place_images_thumbnails_directory');
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $maxWidth . DIRECTORY_SEPARATOR . $maxHeight;
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $placeId;

122) /var/www/src/Controller/Place/Image.php:54    [M] Assignment

--- Original
+++ New
@@ @@
         $originalImagePath = $this->getParameter('place_images_directory') . DIRECTORY_SEPARATOR;
         $originalImagePath .= $year . DIRECTORY_SEPARATOR . $placeId . DIRECTORY_SEPARATOR . $imagePath;
         $thumbnailPathDir = $this->getParameter('place_images_thumbnails_directory');
-        $thumbnailPathDir .= DIRECTORY_SEPARATOR . $maxWidth . DIRECTORY_SEPARATOR . $maxHeight;
+        $thumbnailPathDir = DIRECTORY_SEPARATOR . $maxWidth . DIRECTORY_SEPARATOR . $maxHeight;
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $placeId;
         $thumbnailPath = $thumbnailPathDir . DIRECTORY_SEPARATOR . $imagePath;
         $resizer = new ImageEdit();

123) /var/www/src/Controller/Place/Image.php:55    [M] Assignment

--- Original
+++ New
@@ @@
         $originalImagePath .= $year . DIRECTORY_SEPARATOR . $placeId . DIRECTORY_SEPARATOR . $imagePath;
         $thumbnailPathDir = $this->getParameter('place_images_thumbnails_directory');
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $maxWidth . DIRECTORY_SEPARATOR . $maxHeight;
-        $thumbnailPathDir .= DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $placeId;
+        $thumbnailPathDir = DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $placeId;
         $thumbnailPath = $thumbnailPathDir . DIRECTORY_SEPARATOR . $imagePath;
         $resizer = new ImageEdit();
         $resizer->resize($originalImagePath, $thumbnailPath, $maxWidth, $maxHeight);

124) /var/www/src/Controller/Place/Image.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $placeId;
         $thumbnailPath = $thumbnailPathDir . DIRECTORY_SEPARATOR . $imagePath;
         $resizer = new ImageEdit();
-        $resizer->resize($originalImagePath, $thumbnailPath, $maxWidth, $maxHeight);
+        
         return new Response(null, Response::HTTP_TEMPORARY_REDIRECT, ['location' => $request->getRequestUri()]);
     }
 }

125) /var/www/src/Controller/Place/Image.php:61    [M] NewObject

--- Original
+++ New
@@ @@
         $thumbnailPath = $thumbnailPathDir . DIRECTORY_SEPARATOR . $imagePath;
         $resizer = new ImageEdit();
         $resizer->resize($originalImagePath, $thumbnailPath, $maxWidth, $maxHeight);
-        return new Response(null, Response::HTTP_TEMPORARY_REDIRECT, ['location' => $request->getRequestUri()]);
+        new Response(null, Response::HTTP_TEMPORARY_REDIRECT, ['location' => $request->getRequestUri()]);
+        return null;
     }
 }

126) /var/www/src/Controller/Place/Image.php:64    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $thumbnailPath = $thumbnailPathDir . DIRECTORY_SEPARATOR . $imagePath;
         $resizer = new ImageEdit();
         $resizer->resize($originalImagePath, $thumbnailPath, $maxWidth, $maxHeight);
-        return new Response(null, Response::HTTP_TEMPORARY_REDIRECT, ['location' => $request->getRequestUri()]);
+        return new Response(null, Response::HTTP_TEMPORARY_REDIRECT, []);
     }
 }

127) /var/www/src/Controller/Place/Image.php:65    [M] ArrayItem

--- Original
+++ New
@@ @@
         $thumbnailPath = $thumbnailPathDir . DIRECTORY_SEPARATOR . $imagePath;
         $resizer = new ImageEdit();
         $resizer->resize($originalImagePath, $thumbnailPath, $maxWidth, $maxHeight);
-        return new Response(null, Response::HTTP_TEMPORARY_REDIRECT, ['location' => $request->getRequestUri()]);
+        return new Response(null, Response::HTTP_TEMPORARY_REDIRECT, ['location' > $request->getRequestUri()]);
     }
 }

128) /var/www/src/Controller/SimpleContent.php:9    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Bundle\FrameworkBundle\Controller\AbstractController;
 class SimpleContent extends AbstractController
 {
-    public function privacyPolicy()
+    protected function privacyPolicy()
     {
         return $this->render('simple-content/privacyPolicy.twig');
     }

129) /var/www/src/Controller/SimpleContent.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->render('simple-content/privacyPolicy.twig');
     }
-    public function legalBases()
+    protected function legalBases()
     {
         return $this->render('simple-content/legalBases.html.twig');
     }

130) /var/www/src/Controller/SimpleContent.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->render('simple-content/legalBases.html.twig');
     }
-    public function cookiePolicy()
+    protected function cookiePolicy()
     {
         return $this->render('simple-content/cookiePolicy.html.twig');
     }

131) /var/www/src/Controller/SimpleContent.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->render('simple-content/cookiePolicy.html.twig');
     }
-    public function termsOfService()
+    protected function termsOfService()
     {
         return $this->render('simple-content/termsOfService.html.twig');
     }
 }

132) /var/www/src/Controller/Track.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Tekstove\UrlVideoParser\Youtube\YoutubeParser;
 class Track extends AbstractController
 {
-    public function new(Request $request, LoggerInterface $logger, SlugRepository $slugRepo, Processor $processor)
+    protected function new(Request $request, LoggerInterface $logger, SlugRepository $slugRepo, Processor $processor)
     {
         $form = $this->createForm(\App\Form\Type\Track::class);
         $form->add('submit', SubmitType::class);

133) /var/www/src/Controller/Track.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function new(Request $request, LoggerInterface $logger, SlugRepository $slugRepo, Processor $processor)
     {
         $form = $this->createForm(\App\Form\Type\Track::class);
-        $form->add('submit', SubmitType::class);
+        
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $formIsValid = true;

136) /var/www/src/Controller/Track.php:38    [M] TrueValue

--- Original
+++ New
@@ @@
         $form->add('submit', SubmitType::class);
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
-            $formIsValid = true;
+            $formIsValid = false;
             $file = $form->get('file');
             $fileData = $file->getData();
             /* @var $fileData UploadedFile */

137) /var/www/src/Controller/Track.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // we should have service for gpx processing
             $trackVersion = new Version($this->getUser());
             try {
-                $processor->process($fileContent, $trackVersion);
+                
             } catch (\Exception $e) {
                 $formIsValid = false;
                 $logger->error("Track file parsing error", ['content' => $fileContent, 'e' => $e]);

138) /var/www/src/Controller/Track.php:49    [M] FalseValue

--- Original
+++ New
@@ @@
             try {
                 $processor->process($fileContent, $trackVersion);
             } catch (\Exception $e) {
-                $formIsValid = false;
+                $formIsValid = true;
                 $logger->error("Track file parsing error", ['content' => $fileContent, 'e' => $e]);
                 $form->get('file')->addError(new FormError('cannot parse the file'));
             }

139) /var/www/src/Controller/Track.php:50    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $processor->process($fileContent, $trackVersion);
             } catch (\Exception $e) {
                 $formIsValid = false;
-                $logger->error("Track file parsing error", ['content' => $fileContent, 'e' => $e]);
+                $logger->error("Track file parsing error", ['e' => $e]);
                 $form->get('file')->addError(new FormError('cannot parse the file'));
             }
             $optimizedPoints = $processor->generateOptimizedPoints($trackVersion);

140) /var/www/src/Controller/Track.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $processor->process($fileContent, $trackVersion);
             } catch (\Exception $e) {
                 $formIsValid = false;
-                $logger->error("Track file parsing error", ['content' => $fileContent, 'e' => $e]);
+                
                 $form->get('file')->addError(new FormError('cannot parse the file'));
             }
             $optimizedPoints = $processor->generateOptimizedPoints($trackVersion);

141) /var/www/src/Controller/Track.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (\Exception $e) {
                 $formIsValid = false;
                 $logger->error("Track file parsing error", ['content' => $fileContent, 'e' => $e]);
-                $form->get('file')->addError(new FormError('cannot parse the file'));
+                
             }
             $optimizedPoints = $processor->generateOptimizedPoints($trackVersion);
             $trackVersion->setDifficulty($form->get('difficulty')->getData());

142) /var/www/src/Controller/Track.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $form->get('file')->addError(new FormError('cannot parse the file'));
             }
             $optimizedPoints = $processor->generateOptimizedPoints($trackVersion);
-            $trackVersion->setDifficulty($form->get('difficulty')->getData());
+            
             $track->addOptimizedPoints($optimizedPoints);
             $track->addVersion($trackVersion);
             $track->setType($form->get('type')->getData());

143) /var/www/src/Controller/Track.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $optimizedPoints = $processor->generateOptimizedPoints($trackVersion);
             $trackVersion->setDifficulty($form->get('difficulty')->getData());
-            $track->addOptimizedPoints($optimizedPoints);
+            
             $track->addVersion($trackVersion);
             $track->setType($form->get('type')->getData());
             $track->setNameEn($form->get('nameEn')->getData());

144) /var/www/src/Controller/Track.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $optimizedPoints = $processor->generateOptimizedPoints($trackVersion);
             $trackVersion->setDifficulty($form->get('difficulty')->getData());
             $track->addOptimizedPoints($optimizedPoints);
-            $track->addVersion($trackVersion);
+            
             $track->setType($form->get('type')->getData());
             $track->setNameEn($form->get('nameEn')->getData());
             $track->setNameBg($form->get('nameBg')->getData());

145) /var/www/src/Controller/Track.php:62    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $trackVersion->setDifficulty($form->get('difficulty')->getData());
             $track->addOptimizedPoints($optimizedPoints);
             $track->addVersion($trackVersion);
-            $track->setType($form->get('type')->getData());
+            
             $track->setNameEn($form->get('nameEn')->getData());
             $track->setNameBg($form->get('nameBg')->getData());
             $track->setVisibility($form->get('visibility')->getData());

146) /var/www/src/Controller/Track.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $track->addOptimizedPoints($optimizedPoints);
             $track->addVersion($trackVersion);
             $track->setType($form->get('type')->getData());
-            $track->setNameEn($form->get('nameEn')->getData());
+            
             $track->setNameBg($form->get('nameBg')->getData());
             $track->setVisibility($form->get('visibility')->getData());
             $videoParser = new YoutubeParser();

147) /var/www/src/Controller/Track.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $track->addVersion($trackVersion);
             $track->setType($form->get('type')->getData());
             $track->setNameEn($form->get('nameEn')->getData());
-            $track->setNameBg($form->get('nameBg')->getData());
+            
             $track->setVisibility($form->get('visibility')->getData());
             $videoParser = new YoutubeParser();
             $youtubeVideos = [];

148) /var/www/src/Controller/Track.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $track->setType($form->get('type')->getData());
             $track->setNameEn($form->get('nameEn')->getData());
             $track->setNameBg($form->get('nameBg')->getData());
-            $track->setVisibility($form->get('visibility')->getData());
+            
             $videoParser = new YoutubeParser();
             $youtubeVideos = [];
             foreach ($form->get('videosYoutube')->getData() as $youtubeLink) {

149) /var/www/src/Controller/Track.php:69    [M] Foreach_

--- Original
+++ New
@@ @@
             $track->setVisibility($form->get('visibility')->getData());
             $videoParser = new YoutubeParser();
             $youtubeVideos = [];
-            foreach ($form->get('videosYoutube')->getData() as $youtubeLink) {
+            foreach (array() as $youtubeLink) {
                 if (empty($youtubeLink['link'])) {
                     continue;
                 }

150) /var/www/src/Controller/Track.php:71    [M] Continue_

--- Original
+++ New
@@ @@
             $youtubeVideos = [];
             foreach ($form->get('videosYoutube')->getData() as $youtubeLink) {
                 if (empty($youtubeLink['link'])) {
-                    continue;
+                    break;
                 }
                 try {
                     $videoId = $videoParser->getId($youtubeLink['link']);

151) /var/www/src/Controller/Track.php:78    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                     $videoId = $videoParser->getId($youtubeLink['link']);
                     $youtubeVideos[] = new Youtube($videoId);
                 } catch (ParseException $e) {
-                    $logger->error("Video parsing failed", [$e->getMessage()]);
+                    $logger->error("Video parsing failed", []);
                 }
             }
             $track->setvideosYoutube($youtubeVideos);

152) /var/www/src/Controller/Track.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     $videoId = $videoParser->getId($youtubeLink['link']);
                     $youtubeVideos[] = new Youtube($videoId);
                 } catch (ParseException $e) {
-                    $logger->error("Video parsing failed", [$e->getMessage()]);
+                    
                 }
             }
             $track->setvideosYoutube($youtubeVideos);

153) /var/www/src/Controller/Track.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     $logger->error("Video parsing failed", [$e->getMessage()]);
                 }
             }
-            $track->setvideosYoutube($youtubeVideos);
+            
             if (!$form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();
                 $track->setSlug($slug);

154) /var/www/src/Controller/Track.php:84    [M] LogicalNot

--- Original
+++ New
@@ @@
                 }
             }
             $track->setvideosYoutube($youtubeVideos);
-            if (!$form->get('slug')->isEmpty()) {
+            if ($form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();
                 $track->setSlug($slug);
                 $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);

155) /var/www/src/Controller/Track.php:86    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $track->setvideosYoutube($youtubeVideos);
             if (!$form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();
-                $track->setSlug($slug);
+                
                 $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);
                 if ($existingSlug) {
                     $form->get('slug')->addError(new FormError('Slug is already taken'));

156) /var/www/src/Controller/Track.php:87    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             if (!$form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();
                 $track->setSlug($slug);
-                $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);
+                $existingSlug = $slugRepo->findOneBy([]);
                 if ($existingSlug) {
                     $form->get('slug')->addError(new FormError('Slug is already taken'));
                 }

157) /var/www/src/Controller/Track.php:89    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $track->setSlug($slug);
                 $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);
                 if ($existingSlug) {
-                    $form->get('slug')->addError(new FormError('Slug is already taken'));
+                    
                 }
                 $slugEntity = new Slug($track, $slug);
                 $this->getDoctrine()->getManager()->persist($slugEntity);

158) /var/www/src/Controller/Track.php:95    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     $form->get('slug')->addError(new FormError('Slug is already taken'));
                 }
                 $slugEntity = new Slug($track, $slug);
-                $this->getDoctrine()->getManager()->persist($slugEntity);
+                
             }
             $processor->postProcess($track);
             if ($track->getOptimizedPoints()->isEmpty()) {

160) /var/www/src/Controller/Track.php:102    [M] FalseValue

--- Original
+++ New
@@ @@
             }
             $processor->postProcess($track);
             if ($track->getOptimizedPoints()->isEmpty()) {
-                $formIsValid = false;
+                $formIsValid = true;
                 $form->get('file')->addError(new FormError('error'));
             }
             if ($formIsValid) {

161) /var/www/src/Controller/Track.php:103    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $processor->postProcess($track);
             if ($track->getOptimizedPoints()->isEmpty()) {
                 $formIsValid = false;
-                $form->get('file')->addError(new FormError('error'));
+                
             }
             if ($formIsValid) {
                 $trackFile = new TrackFile($trackVersion, $fileContent);

162) /var/www/src/Controller/Track.php:110    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             if ($formIsValid) {
                 $trackFile = new TrackFile($trackVersion, $fileContent);
-                $trackVersion->setFile($trackFile);
+                
                 $this->getDoctrine()->getManager()->persist($track);
                 $this->getDoctrine()->getManager()->flush();
                 return $this->redirectToRoute('gps-view', ['id' => $track->getSlugOrId()]);

163) /var/www/src/Controller/Track.php:112    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($formIsValid) {
                 $trackFile = new TrackFile($trackVersion, $fileContent);
                 $trackVersion->setFile($trackFile);
-                $this->getDoctrine()->getManager()->persist($track);
+                
                 $this->getDoctrine()->getManager()->flush();
                 return $this->redirectToRoute('gps-view', ['id' => $track->getSlugOrId()]);
             }

164) /var/www/src/Controller/Track.php:114    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $trackFile = new TrackFile($trackVersion, $fileContent);
                 $trackVersion->setFile($trackFile);
                 $this->getDoctrine()->getManager()->persist($track);
-                $this->getDoctrine()->getManager()->flush();
+                
                 return $this->redirectToRoute('gps-view', ['id' => $track->getSlugOrId()]);
             }
         }

165) /var/www/src/Controller/Track.php:117    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $trackVersion->setFile($trackFile);
                 $this->getDoctrine()->getManager()->persist($track);
                 $this->getDoctrine()->getManager()->flush();
-                return $this->redirectToRoute('gps-view', ['id' => $track->getSlugOrId()]);
+                return $this->redirectToRoute('gps-view', ['id' > $track->getSlugOrId()]);
             }
         }
         return $this->render('gps/edit.html.twig', ['form' => $form->createView()]);
