166) /var/www/src/Controller/Track.php:117    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $trackVersion->setFile($trackFile);
                 $this->getDoctrine()->getManager()->persist($track);
                 $this->getDoctrine()->getManager()->flush();
-                return $this->redirectToRoute('gps-view', ['id' => $track->getSlugOrId()]);
+                return $this->redirectToRoute('gps-view', []);
             }
         }
         return $this->render('gps/edit.html.twig', ['form' => $form->createView()]);

167) /var/www/src/Controller/Track.php:123    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 return $this->redirectToRoute('gps-view', ['id' => $track->getSlugOrId()]);
             }
         }
-        return $this->render('gps/edit.html.twig', ['form' => $form->createView()]);
+        return $this->render('gps/edit.html.twig', []);
     }
     public function edit(Request $request, $id, LoggerInterface $logger, SlugRepository $slugRepo)
     {

168) /var/www/src/Controller/Track.php:124    [M] ArrayItem

--- Original
+++ New
@@ @@
                 return $this->redirectToRoute('gps-view', ['id' => $track->getSlugOrId()]);
             }
         }
-        return $this->render('gps/edit.html.twig', ['form' => $form->createView()]);
+        return $this->render('gps/edit.html.twig', ['form' > $form->createView()]);
     }
     public function edit(Request $request, $id, LoggerInterface $logger, SlugRepository $slugRepo)
     {

169) /var/www/src/Controller/Track.php:129    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->render('gps/edit.html.twig', ['form' => $form->createView()]);
     }
-    public function edit(Request $request, $id, LoggerInterface $logger, SlugRepository $slugRepo)
+    protected function edit(Request $request, $id, LoggerInterface $logger, SlugRepository $slugRepo)
     {
         $track = $this->getDoctrine()->getRepository(\App\Entity\Track::class)->findOneBy(['id' => $id]);
         $this->denyAccessUnlessGranted('edit', $track);

170) /var/www/src/Controller/Track.php:131    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function edit(Request $request, $id, LoggerInterface $logger, SlugRepository $slugRepo)
     {
-        $track = $this->getDoctrine()->getRepository(\App\Entity\Track::class)->findOneBy(['id' => $id]);
+        $track = $this->getDoctrine()->getRepository(\App\Entity\Track::class)->findOneBy([]);
         $this->denyAccessUnlessGranted('edit', $track);
         $form = $this->createForm(\App\Form\Type\Track::class);
         $form->get('nameEn')->setData($track->getNameEn());

171) /var/www/src/Controller/Track.php:132    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function edit(Request $request, $id, LoggerInterface $logger, SlugRepository $slugRepo)
     {
         $track = $this->getDoctrine()->getRepository(\App\Entity\Track::class)->findOneBy(['id' => $id]);
-        $this->denyAccessUnlessGranted('edit', $track);
+        
         $form = $this->createForm(\App\Form\Type\Track::class);
         $form->get('nameEn')->setData($track->getNameEn());
         $form->get('nameBg')->setData($track->getNameBg());

172) /var/www/src/Controller/Track.php:135    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $track = $this->getDoctrine()->getRepository(\App\Entity\Track::class)->findOneBy(['id' => $id]);
         $this->denyAccessUnlessGranted('edit', $track);
         $form = $this->createForm(\App\Form\Type\Track::class);
-        $form->get('nameEn')->setData($track->getNameEn());
+        
         $form->get('nameBg')->setData($track->getNameBg());
         $form->get('type')->setData($track->getType());
         $form->get('visibility')->setData($track->getVisibility());

173) /var/www/src/Controller/Track.php:136    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->denyAccessUnlessGranted('edit', $track);
         $form = $this->createForm(\App\Form\Type\Track::class);
         $form->get('nameEn')->setData($track->getNameEn());
-        $form->get('nameBg')->setData($track->getNameBg());
+        
         $form->get('type')->setData($track->getType());
         $form->get('visibility')->setData($track->getVisibility());
         $form->get('slug')->setData($track->getSlug());

174) /var/www/src/Controller/Track.php:137    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form = $this->createForm(\App\Form\Type\Track::class);
         $form->get('nameEn')->setData($track->getNameEn());
         $form->get('nameBg')->setData($track->getNameBg());
-        $form->get('type')->setData($track->getType());
+        
         $form->get('visibility')->setData($track->getVisibility());
         $form->get('slug')->setData($track->getSlug());
         $youtubeFormData = [];

175) /var/www/src/Controller/Track.php:138    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->get('nameEn')->setData($track->getNameEn());
         $form->get('nameBg')->setData($track->getNameBg());
         $form->get('type')->setData($track->getType());
-        $form->get('visibility')->setData($track->getVisibility());
+        
         $form->get('slug')->setData($track->getSlug());
         $youtubeFormData = [];
         foreach ($track->getVideosYoutube() as $youtube) {

176) /var/www/src/Controller/Track.php:139    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->get('nameBg')->setData($track->getNameBg());
         $form->get('type')->setData($track->getType());
         $form->get('visibility')->setData($track->getVisibility());
-        $form->get('slug')->setData($track->getSlug());
+        
         $youtubeFormData = [];
         foreach ($track->getVideosYoutube() as $youtube) {
             $youtubeFormData[] = ['link' => $youtube->getLink()];

177) /var/www/src/Controller/Track.php:142    [M] Foreach_

--- Original
+++ New
@@ @@
         $form->get('visibility')->setData($track->getVisibility());
         $form->get('slug')->setData($track->getSlug());
         $youtubeFormData = [];
-        foreach ($track->getVideosYoutube() as $youtube) {
+        foreach (array() as $youtube) {
             $youtubeFormData[] = ['link' => $youtube->getLink()];
         }
         $form->get('videosYoutube')->setData($youtubeFormData);

178) /var/www/src/Controller/Track.php:143    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $form->get('slug')->setData($track->getSlug());
         $youtubeFormData = [];
         foreach ($track->getVideosYoutube() as $youtube) {
-            $youtubeFormData[] = ['link' => $youtube->getLink()];
+            $youtubeFormData[] = [];
         }
         $form->get('videosYoutube')->setData($youtubeFormData);
         $form->add('submit', SubmitType::class);

179) /var/www/src/Controller/Track.php:144    [M] ArrayItem

--- Original
+++ New
@@ @@
         $form->get('slug')->setData($track->getSlug());
         $youtubeFormData = [];
         foreach ($track->getVideosYoutube() as $youtube) {
-            $youtubeFormData[] = ['link' => $youtube->getLink()];
+            $youtubeFormData[] = ['link' > $youtube->getLink()];
         }
         $form->get('videosYoutube')->setData($youtubeFormData);
         $form->add('submit', SubmitType::class);

180) /var/www/src/Controller/Track.php:147    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($track->getVideosYoutube() as $youtube) {
             $youtubeFormData[] = ['link' => $youtube->getLink()];
         }
-        $form->get('videosYoutube')->setData($youtubeFormData);
+        
         $form->add('submit', SubmitType::class);
         $form->remove('file');
         $form->handleRequest($request);

181) /var/www/src/Controller/Track.php:149    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $youtubeFormData[] = ['link' => $youtube->getLink()];
         }
         $form->get('videosYoutube')->setData($youtubeFormData);
-        $form->add('submit', SubmitType::class);
+        
         $form->remove('file');
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {

182) /var/www/src/Controller/Track.php:150    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $form->get('videosYoutube')->setData($youtubeFormData);
         $form->add('submit', SubmitType::class);
-        $form->remove('file');
+        
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $formIsValid = true;

183) /var/www/src/Controller/Track.php:152    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->get('videosYoutube')->setData($youtubeFormData);
         $form->add('submit', SubmitType::class);
         $form->remove('file');
-        $form->handleRequest($request);
+        
         if ($form->isSubmitted() && $form->isValid()) {
             $formIsValid = true;
             $videoParser = new YoutubeParser();

188) /var/www/src/Controller/Track.php:170    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                     if (preg_match('~[a-zA-Z0-9\\-_]{5,}~', $youtubeLink['link'])) {
                         $youtubeVideos[] = new Youtube($youtubeLink['link']);
                     } else {
-                        $logger->error("Video parsing failed", [$e->getMessage()]);
+                        $logger->error("Video parsing failed", []);
                     }
                 }
             }

189) /var/www/src/Controller/Track.php:170    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     if (preg_match('~[a-zA-Z0-9\\-_]{5,}~', $youtubeLink['link'])) {
                         $youtubeVideos[] = new Youtube($youtubeLink['link']);
                     } else {
-                        $logger->error("Video parsing failed", [$e->getMessage()]);
+                        
                     }
                 }
             }

191) /var/www/src/Controller/Track.php:176    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
             }
             $track->setvideosYoutube($youtubeVideos);
-            $track->setNameEn($form->get('nameEn')->getData());
+            
             $track->setNameBg($form->get('nameBg')->getData());
             $track->setType($form->get('type')->getData());
             $track->setVisibility($form->get('visibility')->getData());

193) /var/www/src/Controller/Track.php:178    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $track->setvideosYoutube($youtubeVideos);
             $track->setNameEn($form->get('nameEn')->getData());
             $track->setNameBg($form->get('nameBg')->getData());
-            $track->setType($form->get('type')->getData());
+            
             $track->setVisibility($form->get('visibility')->getData());
             if (!$form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();

194) /var/www/src/Controller/Track.php:179    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $track->setNameEn($form->get('nameEn')->getData());
             $track->setNameBg($form->get('nameBg')->getData());
             $track->setType($form->get('type')->getData());
-            $track->setVisibility($form->get('visibility')->getData());
+            
             if (!$form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();
                 $addNewSlug = false;

195) /var/www/src/Controller/Track.php:181    [M] LogicalNot

--- Original
+++ New
@@ @@
             $track->setNameBg($form->get('nameBg')->getData());
             $track->setType($form->get('type')->getData());
             $track->setVisibility($form->get('visibility')->getData());
-            if (!$form->get('slug')->isEmpty()) {
+            if ($form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();
                 $addNewSlug = false;
                 if ($track->getSlug() !== $slug) {

196) /var/www/src/Controller/Track.php:184    [M] FalseValue

--- Original
+++ New
@@ @@
             $track->setVisibility($form->get('visibility')->getData());
             if (!$form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();
-                $addNewSlug = false;
+                $addNewSlug = true;
                 if ($track->getSlug() !== $slug) {
                     $track->setSlug($slug);
                     $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);

197) /var/www/src/Controller/Track.php:185    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (!$form->get('slug')->isEmpty()) {
                 $slug = $form->get('slug')->getData();
                 $addNewSlug = false;
-                if ($track->getSlug() !== $slug) {
+                if ($track->getSlug() === $slug) {
                     $track->setSlug($slug);
                     $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);
                     if ($existingSlug) {

198) /var/www/src/Controller/Track.php:186    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $slug = $form->get('slug')->getData();
                 $addNewSlug = false;
                 if ($track->getSlug() !== $slug) {
-                    $track->setSlug($slug);
+                    
                     $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);
                     if ($existingSlug) {
                         if ($existingSlug->getTrack() !== $track) {

200) /var/www/src/Controller/Track.php:189    [M] NotIdentical

--- Original
+++ New
@@ @@
                     $track->setSlug($slug);
                     $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);
                     if ($existingSlug) {
-                        if ($existingSlug->getTrack() !== $track) {
+                        if ($existingSlug->getTrack() === $track) {
                             $formIsValid = false;
                             $form->get('slug')->addError(new FormError('Slug is already taken'));
                         }

201) /var/www/src/Controller/Track.php:190    [M] FalseValue

--- Original
+++ New
@@ @@
                     $existingSlug = $slugRepo->findOneBy(['slug' => $slug]);
                     if ($existingSlug) {
                         if ($existingSlug->getTrack() !== $track) {
-                            $formIsValid = false;
+                            $formIsValid = true;
                             $form->get('slug')->addError(new FormError('Slug is already taken'));
                         }
                     } else {

202) /var/www/src/Controller/Track.php:191    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     if ($existingSlug) {
                         if ($existingSlug->getTrack() !== $track) {
                             $formIsValid = false;
-                            $form->get('slug')->addError(new FormError('Slug is already taken'));
+                            
                         }
                     } else {
                         $addNewSlug = true;

203) /var/www/src/Controller/Track.php:196    [M] TrueValue

--- Original
+++ New
@@ @@
                             $form->get('slug')->addError(new FormError('Slug is already taken'));
                         }
                     } else {
-                        $addNewSlug = true;
+                        $addNewSlug = false;
                     }
                 }
                 if ($addNewSlug) {

205) /var/www/src/Controller/Track.php:208    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
             }
             if ($formIsValid) {
-                $this->getDoctrine()->getManager()->flush();
+                
                 return $this->redirectToRoute('gps-view', ['id' => $track->getSlugOrId()]);
             }
         }

210) /var/www/src/Controller/Track.php:223    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->render('gps/edit.html.twig', ['form' => $form->createView()]);
     }
-    public function newVersion(Request $request, Processor $processor, string $id)
+    protected function newVersion(Request $request, Processor $processor, string $id)
     {
         $track = $this->getDoctrine()->getRepository(\App\Entity\Track::class)->findOneBy(['id' => $id]);
         $this->denyAccessUnlessGranted('edit', $track);

213) /var/www/src/Controller/Track.php:229    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $track = $this->getDoctrine()->getRepository(\App\Entity\Track::class)->findOneBy(['id' => $id]);
         $this->denyAccessUnlessGranted('edit', $track);
         $form = $this->createForm(TrackVersion::class);
-        $form->add('submit', SubmitType::class);
+        
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $file = $form->get('file');

216) /var/www/src/Controller/Track.php:245    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 */
             // we should have service for gpx processing
             $trackVersion = new Version($this->getUser());
-            $processor->process($fileContent, $trackVersion);
+            
             $trackFile = new TrackFile($trackVersion, $fileContent);
             $trackVersion->setFile($trackFile);
             $trackVersion->setDifficulty($form->get('difficulty')->getData());

218) /var/www/src/Controller/Track.php:249    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $processor->process($fileContent, $trackVersion);
             $trackFile = new TrackFile($trackVersion, $fileContent);
             $trackVersion->setFile($trackFile);
-            $trackVersion->setDifficulty($form->get('difficulty')->getData());
+            
             $track->addVersion($trackVersion);
             if ($trackVersion->getPoints()->isEmpty()) {
                 $form->get('file')->addError(new FormError('error'));

219) /var/www/src/Controller/Track.php:251    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $trackFile = new TrackFile($trackVersion, $fileContent);
             $trackVersion->setFile($trackFile);
             $trackVersion->setDifficulty($form->get('difficulty')->getData());
-            $track->addVersion($trackVersion);
+            
             if ($trackVersion->getPoints()->isEmpty()) {
                 $form->get('file')->addError(new FormError('error'));
             } else {

220) /var/www/src/Controller/Track.php:254    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $trackVersion->setDifficulty($form->get('difficulty')->getData());
             $track->addVersion($trackVersion);
             if ($trackVersion->getPoints()->isEmpty()) {
-                $form->get('file')->addError(new FormError('error'));
+                
             } else {
                 $this->getDoctrine()->getManager()->persist($track);
                 $this->getDoctrine()->getManager()->flush();

221) /var/www/src/Controller/Track.php:258    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($trackVersion->getPoints()->isEmpty()) {
                 $form->get('file')->addError(new FormError('error'));
             } else {
-                $this->getDoctrine()->getManager()->persist($track);
+                
                 $this->getDoctrine()->getManager()->flush();
                 return $this->redirectToRoute('gps-view', ['id' => $track->getId()]);
             }

223) /var/www/src/Controller/Track.php:263    [M] ArrayItem

--- Original
+++ New
@@ @@
             } else {
                 $this->getDoctrine()->getManager()->persist($track);
                 $this->getDoctrine()->getManager()->flush();
-                return $this->redirectToRoute('gps-view', ['id' => $track->getId()]);
+                return $this->redirectToRoute('gps-view', ['id' > $track->getId()]);
             }
         }
         return $this->render('gps/newVersion.html.twig', ['track' => $track, 'form' => $form->createView()]);

224) /var/www/src/Controller/Track.php:263    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             } else {
                 $this->getDoctrine()->getManager()->persist($track);
                 $this->getDoctrine()->getManager()->flush();
-                return $this->redirectToRoute('gps-view', ['id' => $track->getId()]);
+                return $this->redirectToRoute('gps-view', []);
             }
         }
         return $this->render('gps/newVersion.html.twig', ['track' => $track, 'form' => $form->createView()]);

225) /var/www/src/Controller/Track.php:269    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 return $this->redirectToRoute('gps-view', ['id' => $track->getId()]);
             }
         }
-        return $this->render('gps/newVersion.html.twig', ['track' => $track, 'form' => $form->createView()]);
+        return $this->render('gps/newVersion.html.twig', ['form' => $form->createView()]);
     }
     public function rate(Request $request, $id)
     {

226) /var/www/src/Controller/Track.php:271    [M] ArrayItem

--- Original
+++ New
@@ @@
                 return $this->redirectToRoute('gps-view', ['id' => $track->getId()]);
             }
         }
-        return $this->render('gps/newVersion.html.twig', ['track' => $track, 'form' => $form->createView()]);
+        return $this->render('gps/newVersion.html.twig', ['track' => $track, 'form' > $form->createView()]);
     }
     public function rate(Request $request, $id)
     {

227) /var/www/src/Controller/Track.php:276    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->render('gps/newVersion.html.twig', ['track' => $track, 'form' => $form->createView()]);
     }
-    public function rate(Request $request, $id)
+    protected function rate(Request $request, $id)
     {
         if (!$request->isXmlHttpRequest()) {
             throw new AccessDeniedHttpException();

228) /var/www/src/Controller/Track.php:278    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public function rate(Request $request, $id)
     {
-        if (!$request->isXmlHttpRequest()) {
+        if ($request->isXmlHttpRequest()) {
             throw new AccessDeniedHttpException();
         }
         $em = $this->getDoctrine()->getManager();

229) /var/www/src/Controller/Track.php:279    [M] Throw_

--- Original
+++ New
@@ @@
     public function rate(Request $request, $id)
     {
         if (!$request->isXmlHttpRequest()) {
-            throw new AccessDeniedHttpException();
+            new AccessDeniedHttpException();
         }
         $em = $this->getDoctrine()->getManager();
         /**

230) /var/www/src/Controller/Track.php:294    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         /**
          * @var $version Version
          */
-        $version = $em->getRepository(\App\Entity\Track\Version::class)->findOneBy(['id' => $id]);
+        $version = $em->getRepository(\App\Entity\Track\Version::class)->findOneBy([]);
         if (is_null($version)) {
             return new JsonResponse(['message' => "Invalid track version"], Response::HTTP_BAD_REQUEST);
         }

231) /var/www/src/Controller/Track.php:296    [M] NewObject

--- Original
+++ New
@@ @@
          */
         $version = $em->getRepository(\App\Entity\Track\Version::class)->findOneBy(['id' => $id]);
         if (is_null($version)) {
-            return new JsonResponse(['message' => "Invalid track version"], Response::HTTP_BAD_REQUEST);
+            new JsonResponse(['message' => "Invalid track version"], Response::HTTP_BAD_REQUEST);
+            return null;
         }
         if ($request->getRealMethod() === 'POST') {
             $ratingRepo = $em->getRepository(VersionRating::class);

232) /var/www/src/Controller/Track.php:297    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
          */
         $version = $em->getRepository(\App\Entity\Track\Version::class)->findOneBy(['id' => $id]);
         if (is_null($version)) {
-            return new JsonResponse(['message' => "Invalid track version"], Response::HTTP_BAD_REQUEST);
+            return new JsonResponse([], Response::HTTP_BAD_REQUEST);
         }
         if ($request->getRealMethod() === 'POST') {
             $ratingRepo = $em->getRepository(VersionRating::class);

233) /var/www/src/Controller/Track.php:304    [M] Identical

--- Original
+++ New
@@ @@
         if (is_null($version)) {
             return new JsonResponse(['message' => "Invalid track version"], Response::HTTP_BAD_REQUEST);
         }
-        if ($request->getRealMethod() === 'POST') {
+        if ($request->getRealMethod() !== 'POST') {
             $ratingRepo = $em->getRepository(VersionRating::class);
             /*
              * Check if user has already submitted rating

234) /var/www/src/Controller/Track.php:309    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             /*
              * Check if user has already submitted rating
              */
-            $rating = $ratingRepo->findOneBy(['version' => $id, 'user' => $user]);
+            $rating = $ratingRepo->findOneBy(['user' => $user]);
             /*
              * If $rating is null, create new row
              */

235) /var/www/src/Controller/Track.php:319    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
              */
             if (is_null($rating)) {
                 $rating = new VersionRating();
-                $rating->setUser($user);
+                
                 $rating->setVersion($version);
             }
             /**

236) /var/www/src/Controller/Track.php:320    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if (is_null($rating)) {
                 $rating = new VersionRating();
                 $rating->setUser($user);
-                $rating->setVersion($version);
+                
             }
             /**
              * Check if rating is within range of 1 to 5

237) /var/www/src/Controller/Track.php:327    [M] LogicalOr

--- Original
+++ New
@@ @@
              * Check if rating is within range of 1 to 5
              */
             $newRating = $request->request->get('rating');
-            if ($newRating < 1 || $newRating > 5) {
+            if ($newRating < 1 && $newRating > 5) {
                 return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
             }
             $rating->setRating($newRating);

238) /var/www/src/Controller/Track.php:327    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
              * Check if rating is within range of 1 to 5
              */
             $newRating = $request->request->get('rating');
-            if ($newRating < 1 || $newRating > 5) {
+            if ($newRating < 1 || $newRating <= 5) {
                 return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
             }
             $rating->setRating($newRating);

239) /var/www/src/Controller/Track.php:327    [M] GreaterThan

--- Original
+++ New
@@ @@
              * Check if rating is within range of 1 to 5
              */
             $newRating = $request->request->get('rating');
-            if ($newRating < 1 || $newRating > 5) {
+            if ($newRating < 1 || $newRating >= 5) {
                 return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
             }
             $rating->setRating($newRating);

240) /var/www/src/Controller/Track.php:327    [M] LessThan

--- Original
+++ New
@@ @@
              * Check if rating is within range of 1 to 5
              */
             $newRating = $request->request->get('rating');
-            if ($newRating < 1 || $newRating > 5) {
+            if ($newRating <= 1 || $newRating > 5) {
                 return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
             }
             $rating->setRating($newRating);

241) /var/www/src/Controller/Track.php:327    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
              * Check if rating is within range of 1 to 5
              */
             $newRating = $request->request->get('rating');
-            if ($newRating < 1 || $newRating > 5) {
+            if ($newRating >= 1 || $newRating > 5) {
                 return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
             }
             $rating->setRating($newRating);

242) /var/www/src/Controller/Track.php:328    [M] NewObject

--- Original
+++ New
@@ @@
              */
             $newRating = $request->request->get('rating');
             if ($newRating < 1 || $newRating > 5) {
-                return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
+                new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
+                return null;
             }
             $rating->setRating($newRating);
             $em->persist($rating);

243) /var/www/src/Controller/Track.php:329    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
              */
             $newRating = $request->request->get('rating');
             if ($newRating < 1 || $newRating > 5) {
-                return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
+                return new JsonResponse([], Response::HTTP_BAD_REQUEST);
             }
             $rating->setRating($newRating);
             $em->persist($rating);
