244) /var/www/src/Controller/Track.php:336    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($newRating < 1 || $newRating > 5) {
                 return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
             }
-            $rating->setRating($newRating);
+            
             $em->persist($rating);
             $em->flush();
         }

245) /var/www/src/Controller/Track.php:337    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 return new JsonResponse(['message' => 'Invalid rating: ' . $newRating], Response::HTTP_BAD_REQUEST);
             }
             $rating->setRating($newRating);
-            $em->persist($rating);
+            
             $em->flush();
         }
         $average = 0;

246) /var/www/src/Controller/Track.php:338    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $rating->setRating($newRating);
             $em->persist($rating);
-            $em->flush();
+            
         }
         $average = 0;
         /**

247) /var/www/src/Controller/Track.php:341    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $em->persist($rating);
             $em->flush();
         }
-        $average = 0;
+        $average = 1;
         /**
          * @var $r VersionRating
          */

248) /var/www/src/Controller/Track.php:341    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $em->persist($rating);
             $em->flush();
         }
-        $average = 0;
+        $average = -1;
         /**
          * @var $r VersionRating
          */

249) /var/www/src/Controller/Track.php:345    [M] Foreach_

--- Original
+++ New
@@ @@
         /**
          * @var $r VersionRating
          */
-        foreach ($version->getRatings() as $r) {
+        foreach (array() as $r) {
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();

250) /var/www/src/Controller/Track.php:346    [M] PlusEqual

--- Original
+++ New
@@ @@
          * @var $r VersionRating
          */
         foreach ($version->getRatings() as $r) {
-            $average += $r->getRating();
+            $average -= $r->getRating();
         }
         $average = $average / $version->getVotes();
         return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);

251) /var/www/src/Controller/Track.php:346    [M] Assignment

--- Original
+++ New
@@ @@
          * @var $r VersionRating
          */
         foreach ($version->getRatings() as $r) {
-            $average += $r->getRating();
+            $average = $r->getRating();
         }
         $average = $average / $version->getVotes();
         return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);

252) /var/www/src/Controller/Track.php:348    [M] Division

--- Original
+++ New
@@ @@
         foreach ($version->getRatings() as $r) {
             $average += $r->getRating();
         }
-        $average = $average / $version->getVotes();
+        $average = $average * $version->getVotes();
         return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)

253) /var/www/src/Controller/Track.php:350    [M] NewObject

--- Original
+++ New
@@ @@
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();
-        return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        return null;
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {

254) /var/www/src/Controller/Track.php:350    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();
-        return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        return new JsonResponse(['votes' => $version->getVotes()]);
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {

255) /var/www/src/Controller/Track.php:351    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();
-        return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        return new JsonResponse(['rating' => round($average, 1), 'votes' => $version->getVotes()]);
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {

256) /var/www/src/Controller/Track.php:351    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();
-        return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        return new JsonResponse(['rating' => round($average, 3), 'votes' => $version->getVotes()]);
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {

257) /var/www/src/Controller/Track.php:351    [M] RoundingFamily

--- Original
+++ New
@@ @@
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();
-        return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        return new JsonResponse(['rating' => floor($average), 'votes' => $version->getVotes()]);
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {

258) /var/www/src/Controller/Track.php:351    [M] RoundingFamily

--- Original
+++ New
@@ @@
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();
-        return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        return new JsonResponse(['rating' => ceil($average), 'votes' => $version->getVotes()]);
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {

259) /var/www/src/Controller/Track.php:351    [M] ArrayItem

--- Original
+++ New
@@ @@
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();
-        return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        return new JsonResponse(['rating' > round($average, 2), 'votes' => $version->getVotes()]);
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {

260) /var/www/src/Controller/Track.php:352    [M] ArrayItem

--- Original
+++ New
@@ @@
             $average += $r->getRating();
         }
         $average = $average / $version->getVotes();
-        return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
+        return new JsonResponse(['rating' => round($average, 2), 'votes' > $version->getVotes()]);
     }
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {

261) /var/www/src/Controller/Track.php:356    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $average = $average / $version->getVotes();
         return new JsonResponse(['rating' => round($average, 2), 'votes' => $version->getVotes()]);
     }
-    public function view($id, TrackRepository $repo, Request $request, Processor $processor)
+    protected function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {
         $gps = $repo->findByIdOrSlug($id);
         if (!$gps) {

262) /var/www/src/Controller/Track.php:360    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function view($id, TrackRepository $repo, Request $request, Processor $processor)
     {
         $gps = $repo->findByIdOrSlug($id);
-        if (!$gps) {
+        if ($gps) {
             throw new NotFoundHttpException("Track not found");
         }
         $canonicalUrl = null;

263) /var/www/src/Controller/Track.php:361    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $gps = $repo->findByIdOrSlug($id);
         if (!$gps) {
-            throw new NotFoundHttpException("Track not found");
+            new NotFoundHttpException("Track not found");
         }
         $canonicalUrl = null;
         if ($gps->getSlug()) {

264) /var/www/src/Controller/Track.php:368    [M] ArrayItem

--- Original
+++ New
@@ @@
         }
         $canonicalUrl = null;
         if ($gps->getSlug()) {
-            $canonicalUrl = $this->generateUrl('gps-view', ['id' => $gps->getSlug()]);
+            $canonicalUrl = $this->generateUrl('gps-view', ['id' > $gps->getSlug()]);
         }
         $pointsCollection = [];
         foreach ($gps->getVersions() as $loopIndex => $version) {

265) /var/www/src/Controller/Track.php:368    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $canonicalUrl = null;
         if ($gps->getSlug()) {
-            $canonicalUrl = $this->generateUrl('gps-view', ['id' => $gps->getSlug()]);
+            $canonicalUrl = $this->generateUrl('gps-view', []);
         }
         $pointsCollection = [];
         foreach ($gps->getVersions() as $loopIndex => $version) {

266) /var/www/src/Controller/Track.php:374    [M] Foreach_

--- Original
+++ New
@@ @@
             $canonicalUrl = $this->generateUrl('gps-view', ['id' => $gps->getSlug()]);
         }
         $pointsCollection = [];
-        foreach ($gps->getVersions() as $loopIndex => $version) {
+        foreach (array() as $loopIndex => $version) {
             $pointsCollection[] = $version->getPoints()->toArray();
         }
         foreach ($gps->getDownhillVersions() as $loopIndex => $item) {

267) /var/www/src/Controller/Track.php:378    [M] Foreach_

--- Original
+++ New
@@ @@
         foreach ($gps->getVersions() as $loopIndex => $version) {
             $pointsCollection[] = $version->getPoints()->toArray();
         }
-        foreach ($gps->getDownhillVersions() as $loopIndex => $item) {
+        foreach (array() as $loopIndex => $item) {
             $pointsCollection[] = $item->getPoints()->toArray();
         }
         foreach ($gps->getUphillVersions() as $loopIndex => $item) {

268) /var/www/src/Controller/Track.php:382    [M] Foreach_

--- Original
+++ New
@@ @@
         foreach ($gps->getDownhillVersions() as $loopIndex => $item) {
             $pointsCollection[] = $item->getPoints()->toArray();
         }
-        foreach ($gps->getUphillVersions() as $loopIndex => $item) {
+        foreach (array() as $loopIndex => $item) {
             $pointsCollection[] = $item->getPoints()->toArray();
         }
         $labels = $processor->generateElevationLables($pointsCollection, 150);

269) /var/www/src/Controller/Track.php:386    [M] DecrementInteger

--- Original
+++ New
@@ @@
         foreach ($gps->getUphillVersions() as $loopIndex => $item) {
             $pointsCollection[] = $item->getPoints()->toArray();
         }
-        $labels = $processor->generateElevationLables($pointsCollection, 150);
+        $labels = $processor->generateElevationLables($pointsCollection, 149);
         $values = $processor->generateElevationData($pointsCollection, $labels);
         foreach ($labels as &$label) {
             $label = number_format($label, 0, '', ' ') . ' m';

270) /var/www/src/Controller/Track.php:386    [M] IncrementInteger

--- Original
+++ New
@@ @@
         foreach ($gps->getUphillVersions() as $loopIndex => $item) {
             $pointsCollection[] = $item->getPoints()->toArray();
         }
-        $labels = $processor->generateElevationLables($pointsCollection, 150);
+        $labels = $processor->generateElevationLables($pointsCollection, 151);
         $values = $processor->generateElevationData($pointsCollection, $labels);
         foreach ($labels as &$label) {
             $label = number_format($label, 0, '', ' ') . ' m';

271) /var/www/src/Controller/Track.php:390    [M] Foreach_

--- Original
+++ New
@@ @@
         }
         $labels = $processor->generateElevationLables($pointsCollection, 150);
         $values = $processor->generateElevationData($pointsCollection, $labels);
-        foreach ($labels as &$label) {
+        foreach (array() as &$label) {
             $label = number_format($label, 0, '', ' ') . ' m';
         }
         unset($label);

272) /var/www/src/Controller/Track.php:391    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $labels = $processor->generateElevationLables($pointsCollection, 150);
         $values = $processor->generateElevationData($pointsCollection, $labels);
         foreach ($labels as &$label) {
-            $label = number_format($label, 0, '', ' ') . ' m';
+            $label = number_format($label, -1, '', ' ') . ' m';
         }
         unset($label);
         $dataSets = [];

273) /var/www/src/Controller/Track.php:391    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $labels = $processor->generateElevationLables($pointsCollection, 150);
         $values = $processor->generateElevationData($pointsCollection, $labels);
         foreach ($labels as &$label) {
-            $label = number_format($label, 0, '', ' ') . ' m';
+            $label = number_format($label, 1, '', ' ') . ' m';
         }
         unset($label);
         $dataSets = [];

274) /var/www/src/Controller/Track.php:396    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         }
         unset($label);
         $dataSets = [];
-        reset($values);
+        
         for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {

275) /var/www/src/Controller/Track.php:397    [M] LessThan

--- Original
+++ New
@@ @@
         unset($label);
         $dataSets = [];
         reset($values);
-        for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
+        for ($q = 0; $q <= $gps->getVersions()->count(); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

276) /var/www/src/Controller/Track.php:397    [M] Increment

--- Original
+++ New
@@ @@
         unset($label);
         $dataSets = [];
         reset($values);
-        for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
+        for ($q = 0; $q < $gps->getVersions()->count(); $q--) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

277) /var/www/src/Controller/Track.php:397    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
         unset($label);
         $dataSets = [];
         reset($values);
-        for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
+        for ($q = 0; $q >= $gps->getVersions()->count(); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

278) /var/www/src/Controller/Track.php:397    [M] For_

--- Original
+++ New
@@ @@
         unset($label);
         $dataSets = [];
         reset($values);
-        for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
+        for ($q = 0; false; $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

279) /var/www/src/Controller/Track.php:397    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         unset($label);
         $dataSets = [];
         reset($values);
-        for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
+        for ($q = 1; $q < $gps->getVersions()->count(); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

280) /var/www/src/Controller/Track.php:397    [M] DecrementInteger

--- Original
+++ New
@@ @@
         unset($label);
         $dataSets = [];
         reset($values);
-        for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
+        for ($q = -1; $q < $gps->getVersions()->count(); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

281) /var/www/src/Controller/Track.php:399    [M] Foreach_

--- Original
+++ New
@@ @@
         reset($values);
         for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
             $currentValues = current($values);
-            foreach ($currentValues as &$value) {
+            foreach (array() as &$value) {
                 $value = (int) $value;
             }
             unset($value);

282) /var/www/src/Controller/Track.php:400    [M] CastInt

--- Original
+++ New
@@ @@
         for ($q = 0; $q < $gps->getVersions()->count(); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
-                $value = (int) $value;
+                $value = $value;
             }
             unset($value);
             $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];

283) /var/www/src/Controller/Track.php:404    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
+            $dataSets[] = ['label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
             next($values);
         }
         for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {

284) /var/www/src/Controller/Track.php:406    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 2), 'borderColor' => 'red'];
             next($values);
         }
         for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {

285) /var/www/src/Controller/Track.php:406    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 0), 'borderColor' => 'red'];
             next($values);
         }
         for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {

286) /var/www/src/Controller/Track.php:406    [M] Plus

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q - 1), 'borderColor' => 'red'];
             next($values);
         }
         for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {

287) /var/www/src/Controller/Track.php:410    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             }
             unset($value);
             $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
-            next($values);
+            
         }
         for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {
             $currentValues = current($values);

288) /var/www/src/Controller/Track.php:413    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {
+        for ($q = 0; $q >= count($gps->getDownhillVersions()); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

289) /var/www/src/Controller/Track.php:413    [M] Increment

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {
+        for ($q = 0; $q < count($gps->getDownhillVersions()); $q--) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

290) /var/www/src/Controller/Track.php:413    [M] For_

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {
+        for ($q = 0; false; $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

291) /var/www/src/Controller/Track.php:413    [M] LessThan

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {
+        for ($q = 0; $q <= count($gps->getDownhillVersions()); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

292) /var/www/src/Controller/Track.php:413    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {
+        for ($q = 1; $q < count($gps->getDownhillVersions()); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

293) /var/www/src/Controller/Track.php:413    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'main track #' . ($q + 1), 'borderColor' => 'red'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getDownhillVersions()); $q++) {
+        for ($q = -1; $q < count($gps->getDownhillVersions()); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

296) /var/www/src/Controller/Track.php:420    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
+            $dataSets[] = ['label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
             next($values);
         }
         for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {

297) /var/www/src/Controller/Track.php:422    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 0), 'borderColor' => 'orange'];
             next($values);
         }
         for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {

298) /var/www/src/Controller/Track.php:422    [M] Plus

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q - 1), 'borderColor' => 'orange'];
             next($values);
         }
         for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {

299) /var/www/src/Controller/Track.php:422    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 2), 'borderColor' => 'orange'];
             next($values);
         }
         for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {

300) /var/www/src/Controller/Track.php:426    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             }
             unset($value);
             $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
-            next($values);
+            
         }
         for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {
             $currentValues = current($values);

301) /var/www/src/Controller/Track.php:429    [M] For_

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {
+        for ($q = 0; false; $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

302) /var/www/src/Controller/Track.php:429    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {
+        for ($q = -1; $q < count($gps->getUphillVersions()); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

303) /var/www/src/Controller/Track.php:429    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {
+        for ($q = 1; $q < count($gps->getUphillVersions()); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

304) /var/www/src/Controller/Track.php:429    [M] LessThan

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {
+        for ($q = 0; $q <= count($gps->getUphillVersions()); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

305) /var/www/src/Controller/Track.php:429    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {
+        for ($q = 0; $q >= count($gps->getUphillVersions()); $q++) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

306) /var/www/src/Controller/Track.php:429    [M] Increment

--- Original
+++ New
@@ @@
             $dataSets[] = ['data' => $currentValues, 'label' => 'downhill version #' . ($q + 1), 'borderColor' => 'orange'];
             next($values);
         }
-        for ($q = 0; $q < count($gps->getUphillVersions()); $q++) {
+        for ($q = 0; $q < count($gps->getUphillVersions()); $q--) {
             $currentValues = current($values);
             foreach ($currentValues as &$value) {
                 $value = (int) $value;

309) /var/www/src/Controller/Track.php:436    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'uphill version #' . ($q + 1), 'borderColor' => 'green'];
+            $dataSets[] = ['label' => 'uphill version #' . ($q + 1), 'borderColor' => 'green'];
             next($values);
         }
         $appTitle = $gps->getName($request->getLocale());

310) /var/www/src/Controller/Track.php:438    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'uphill version #' . ($q + 1), 'borderColor' => 'green'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'uphill version #' . ($q + 0), 'borderColor' => 'green'];
             next($values);
         }
         $appTitle = $gps->getName($request->getLocale());
