311) /var/www/src/Controller/Track.php:438    [M] Plus

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'uphill version #' . ($q + 1), 'borderColor' => 'green'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'uphill version #' . ($q - 1), 'borderColor' => 'green'];
             next($values);
         }
         $appTitle = $gps->getName($request->getLocale());

312) /var/www/src/Controller/Track.php:438    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $value = (int) $value;
             }
             unset($value);
-            $dataSets[] = ['data' => $currentValues, 'label' => 'uphill version #' . ($q + 1), 'borderColor' => 'green'];
+            $dataSets[] = ['data' => $currentValues, 'label' => 'uphill version #' . ($q + 2), 'borderColor' => 'green'];
             next($values);
         }
         $appTitle = $gps->getName($request->getLocale());

313) /var/www/src/Controller/Track.php:442    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             }
             unset($value);
             $dataSets[] = ['data' => $currentValues, 'label' => 'uphill version #' . ($q + 1), 'borderColor' => 'green'];
-            next($values);
+            
         }
         $appTitle = $gps->getName($request->getLocale());
         switch ($gps->getType()) {

314) /var/www/src/Controller/Track.php:448    [M] Assignment

--- Original
+++ New
@@ @@
         $appTitle = $gps->getName($request->getLocale());
         switch ($gps->getType()) {
             case \App\Entity\Track::TYPE_CYCLING:
-                $appTitle .= ' mountain bike trail';
+                $appTitle = ' mountain bike trail';
         }
         return $this->render('gps/view.html.twig', ['track' => $gps, 'elevationData' => $dataSets, 'elevationLabels' => $labels, 'app_canonical_url' => $canonicalUrl, 'app_title' => $appTitle, 'canEdit' => $this->isGranted('edit', $gps)]);
     }

315) /var/www/src/Controller/Track.php:453    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             case \App\Entity\Track::TYPE_CYCLING:
                 $appTitle .= ' mountain bike trail';
         }
-        return $this->render('gps/view.html.twig', ['track' => $gps, 'elevationData' => $dataSets, 'elevationLabels' => $labels, 'app_canonical_url' => $canonicalUrl, 'app_title' => $appTitle, 'canEdit' => $this->isGranted('edit', $gps)]);
+        return $this->render('gps/view.html.twig', ['elevationData' => $dataSets, 'elevationLabels' => $labels, 'app_canonical_url' => $canonicalUrl, 'app_title' => $appTitle, 'canEdit' => $this->isGranted('edit', $gps)]);
     }
     public function download($id, TrackRepository $repo)
     {

316) /var/www/src/Controller/Track.php:459    [M] ArrayItem

--- Original
+++ New
@@ @@
             case \App\Entity\Track::TYPE_CYCLING:
                 $appTitle .= ' mountain bike trail';
         }
-        return $this->render('gps/view.html.twig', ['track' => $gps, 'elevationData' => $dataSets, 'elevationLabels' => $labels, 'app_canonical_url' => $canonicalUrl, 'app_title' => $appTitle, 'canEdit' => $this->isGranted('edit', $gps)]);
+        return $this->render('gps/view.html.twig', ['track' => $gps, 'elevationData' => $dataSets, 'elevationLabels' => $labels, 'app_canonical_url' => $canonicalUrl, 'app_title' => $appTitle, 'canEdit' > $this->isGranted('edit', $gps)]);
     }
     public function download($id, TrackRepository $repo)
     {

317) /var/www/src/Controller/Track.php:464    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->render('gps/view.html.twig', ['track' => $gps, 'elevationData' => $dataSets, 'elevationLabels' => $labels, 'app_canonical_url' => $canonicalUrl, 'app_title' => $appTitle, 'canEdit' => $this->isGranted('edit', $gps)]);
     }
-    public function download($id, TrackRepository $repo)
+    protected function download($id, TrackRepository $repo)
     {
         $track = $repo->findOneBy(['id' => $id]);
         $exporter = new Exporter();

318) /var/www/src/Controller/Track.php:466    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function download($id, TrackRepository $repo)
     {
-        $track = $repo->findOneBy(['id' => $id]);
+        $track = $repo->findOneBy([]);
         $exporter = new Exporter();
         $exported = $exporter->export($track->getVersions(), Exporter::FORMAT_GPX);
         $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);

319) /var/www/src/Controller/Track.php:473    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $track = $repo->findOneBy(['id' => $id]);
         $exporter = new Exporter();
         $exported = $exporter->export($track->getVersions(), Exporter::FORMAT_GPX);
-        $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
+        $response = new \Symfony\Component\HttpFoundation\Response($exported, 199, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
         return $response;
     }
     public function downloadBatch(Request $request)

320) /var/www/src/Controller/Track.php:473    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $track = $repo->findOneBy(['id' => $id]);
         $exporter = new Exporter();
         $exported = $exporter->export($track->getVersions(), Exporter::FORMAT_GPX);
-        $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
+        $response = new \Symfony\Component\HttpFoundation\Response($exported, 201, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
         return $response;
     }
     public function downloadBatch(Request $request)

321) /var/www/src/Controller/Track.php:474    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $track = $repo->findOneBy(['id' => $id]);
         $exporter = new Exporter();
         $exported = $exporter->export($track->getVersions(), Exporter::FORMAT_GPX);
-        $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
+        $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, []);
         return $response;
     }
     public function downloadBatch(Request $request)

322) /var/www/src/Controller/Track.php:482    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
         return $response;
     }
-    public function downloadBatch(Request $request)
+    protected function downloadBatch(Request $request)
     {
         $versions = $request->request->get('versions');
         $versionRepo = $this->getDoctrine()->getRepository(Version::class);

323) /var/www/src/Controller/Track.php:486    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $versions = $request->request->get('versions');
         $versionRepo = $this->getDoctrine()->getRepository(Version::class);
-        $versionsCollection = $versionRepo->findBy(['id' => $versions]);
+        $versionsCollection = $versionRepo->findBy([]);
         $exporter = new Exporter();
         $exported = $exporter->export($versionsCollection, Exporter::FORMAT_GPX);
         $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);

324) /var/www/src/Controller/Track.php:493    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $versionsCollection = $versionRepo->findBy(['id' => $versions]);
         $exporter = new Exporter();
         $exported = $exporter->export($versionsCollection, Exporter::FORMAT_GPX);
-        $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
+        $response = new \Symfony\Component\HttpFoundation\Response($exported, 199, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
         return $response;
     }
 }

325) /var/www/src/Controller/Track.php:493    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $versionsCollection = $versionRepo->findBy(['id' => $versions]);
         $exporter = new Exporter();
         $exported = $exporter->export($versionsCollection, Exporter::FORMAT_GPX);
-        $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
+        $response = new \Symfony\Component\HttpFoundation\Response($exported, 201, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
         return $response;
     }
 }

326) /var/www/src/Controller/Track.php:494    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $versionsCollection = $versionRepo->findBy(['id' => $versions]);
         $exporter = new Exporter();
         $exported = $exporter->export($versionsCollection, Exporter::FORMAT_GPX);
-        $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, ['Content-Disposition' => ResponseHeaderBag::DISPOSITION_ATTACHMENT . '; filename="track.gpx";']);
+        $response = new \Symfony\Component\HttpFoundation\Response($exported, 200, []);
         return $response;
     }
 }

330) /var/www/src/Controller/Track/Image.php:31    [M] NewObject

--- Original
+++ New
@@ @@
         $uploader = new ImageUploader($this->getParameter('track_images_directory'), $trackRepo, $translator);
         $user = $this->getUser();
         $entityCreator = function ($path, $parentEntity) use($user) {
-            return new \App\Entity\Track\Image($path, $user, $parentEntity);
+            new \App\Entity\Track\Image($path, $user, $parentEntity);
+            return null;
         };
         list($image, $response) = $uploader->addImage($id, $request, $entityCreator);
         if ($image) {

333) /var/www/src/Controller/Track/Image.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * This method is called when thumbnails doesn't exists.
      * Thumbnail will be created and saved in the "public" directory.
      */
-    public function generateThumbnail(int $year, string $trackId, string $imagePath, int $maxWidth, int $maxHeight, Request $request)
+    protected function generateThumbnail(int $year, string $trackId, string $imagePath, int $maxWidth, int $maxHeight, Request $request)
     {
         $originalImagePath = $this->getParameter('track_images_directory') . DIRECTORY_SEPARATOR;
         $originalImagePath .= $year . DIRECTORY_SEPARATOR . $trackId . DIRECTORY_SEPARATOR . $imagePath;

334) /var/www/src/Controller/Track/Image.php:51    [M] Assignment

--- Original
+++ New
@@ @@
     public function generateThumbnail(int $year, string $trackId, string $imagePath, int $maxWidth, int $maxHeight, Request $request)
     {
         $originalImagePath = $this->getParameter('track_images_directory') . DIRECTORY_SEPARATOR;
-        $originalImagePath .= $year . DIRECTORY_SEPARATOR . $trackId . DIRECTORY_SEPARATOR . $imagePath;
+        $originalImagePath = $year . DIRECTORY_SEPARATOR . $trackId . DIRECTORY_SEPARATOR . $imagePath;
         $thumbnailPathDir = $this->getParameter('track_images_thumbnails_directory');
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $maxWidth . DIRECTORY_SEPARATOR . $maxHeight;
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $trackId;

335) /var/www/src/Controller/Track/Image.php:54    [M] Assignment

--- Original
+++ New
@@ @@
         $originalImagePath = $this->getParameter('track_images_directory') . DIRECTORY_SEPARATOR;
         $originalImagePath .= $year . DIRECTORY_SEPARATOR . $trackId . DIRECTORY_SEPARATOR . $imagePath;
         $thumbnailPathDir = $this->getParameter('track_images_thumbnails_directory');
-        $thumbnailPathDir .= DIRECTORY_SEPARATOR . $maxWidth . DIRECTORY_SEPARATOR . $maxHeight;
+        $thumbnailPathDir = DIRECTORY_SEPARATOR . $maxWidth . DIRECTORY_SEPARATOR . $maxHeight;
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $trackId;
         $thumbnailPath = $thumbnailPathDir . DIRECTORY_SEPARATOR . $imagePath;
         $resizer = new ImageEdit();

336) /var/www/src/Controller/Track/Image.php:55    [M] Assignment

--- Original
+++ New
@@ @@
         $originalImagePath .= $year . DIRECTORY_SEPARATOR . $trackId . DIRECTORY_SEPARATOR . $imagePath;
         $thumbnailPathDir = $this->getParameter('track_images_thumbnails_directory');
         $thumbnailPathDir .= DIRECTORY_SEPARATOR . $maxWidth . DIRECTORY_SEPARATOR . $maxHeight;
-        $thumbnailPathDir .= DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $trackId;
+        $thumbnailPathDir = DIRECTORY_SEPARATOR . $year . DIRECTORY_SEPARATOR . $trackId;
         $thumbnailPath = $thumbnailPathDir . DIRECTORY_SEPARATOR . $imagePath;
         $resizer = new ImageEdit();
         $resizer->resize($originalImagePath, $thumbnailPath, $maxWidth, $maxHeight);

341) /var/www/src/Controller/User.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Component\HttpFoundation\Response;
 class User extends AbstractController
 {
-    public function terms(Request $request)
+    protected function terms(Request $request)
     {
         if (!$this->getUser()) {
             return $this->redirectToRoute('hwi_oauth_connect');

342) /var/www/src/Controller/User.php:15    [M] LogicalNot

--- Original
+++ New
@@ @@
 {
     public function terms(Request $request)
     {
-        if (!$this->getUser()) {
+        if ($this->getUser()) {
             return $this->redirectToRoute('hwi_oauth_connect');
         }
         $form = $this->createForm(Terms::class);

343) /var/www/src/Controller/User.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return $this->redirectToRoute('hwi_oauth_connect');
         }
         $form = $this->createForm(Terms::class);
-        $form->add('submit', SubmitType::class);
+        
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $this->getUser()->acceptTerms();

346) /var/www/src/Controller/User.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->add('submit', SubmitType::class);
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
-            $this->getUser()->acceptTerms();
+            
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('home');
         }

347) /var/www/src/Controller/User.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $this->getUser()->acceptTerms();
-            $this->getDoctrine()->getManager()->flush();
+            
             return $this->redirectToRoute('home');
         }
         return $this->render('user/terms.html.twig', ['form' => $form->createView()]);

348) /var/www/src/Controller/User.php:30    [M] ArrayItem

--- Original
+++ New
@@ @@
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('home');
         }
-        return $this->render('user/terms.html.twig', ['form' => $form->createView()]);
+        return $this->render('user/terms.html.twig', ['form' > $form->createView()]);
     }
     public function downloadPersonalData()
     {

349) /var/www/src/Controller/User.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->getDoctrine()->getManager()->flush();
             return $this->redirectToRoute('home');
         }
-        return $this->render('user/terms.html.twig', ['form' => $form->createView()]);
+        return $this->render('user/terms.html.twig', []);
     }
     public function downloadPersonalData()
     {

350) /var/www/src/Controller/User.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->render('user/terms.html.twig', ['form' => $form->createView()]);
     }
-    public function downloadPersonalData()
+    protected function downloadPersonalData()
     {
         $user = $this->getUser();
         $userFromDb = $this->getDoctrine()->getRepository(\App\Entity\User\User::class)->findOneBy(['id' => $user->getid()]);

351) /var/www/src/Controller/User.php:37    [M] ArrayItem

--- Original
+++ New
@@ @@
     public function downloadPersonalData()
     {
         $user = $this->getUser();
-        $userFromDb = $this->getDoctrine()->getRepository(\App\Entity\User\User::class)->findOneBy(['id' => $user->getid()]);
+        $userFromDb = $this->getDoctrine()->getRepository(\App\Entity\User\User::class)->findOneBy(['id' > $user->getid()]);
         // temp file
         $fp = fopen('php://temp', 'r+');
         fputcsv($fp, ['username', 'email', 'facebook id']);

352) /var/www/src/Controller/User.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function downloadPersonalData()
     {
         $user = $this->getUser();
-        $userFromDb = $this->getDoctrine()->getRepository(\App\Entity\User\User::class)->findOneBy(['id' => $user->getid()]);
+        $userFromDb = $this->getDoctrine()->getRepository(\App\Entity\User\User::class)->findOneBy([]);
         // temp file
         $fp = fopen('php://temp', 'r+');
         fputcsv($fp, ['username', 'email', 'facebook id']);

353) /var/www/src/Controller/User.php:41    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $userFromDb = $this->getDoctrine()->getRepository(\App\Entity\User\User::class)->findOneBy(['id' => $user->getid()]);
         // temp file
         $fp = fopen('php://temp', 'r+');
-        fputcsv($fp, ['username', 'email', 'facebook id']);
+        
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
         $csvAsString = fread($fp, 1024 * 1024);

354) /var/www/src/Controller/User.php:43    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $userFromDb = $this->getDoctrine()->getRepository(\App\Entity\User\User::class)->findOneBy(['id' => $user->getid()]);
         // temp file
         $fp = fopen('php://temp', 'r+');
-        fputcsv($fp, ['username', 'email', 'facebook id']);
+        fputcsv($fp, ['email', 'facebook id']);
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
         $csvAsString = fread($fp, 1024 * 1024);

355) /var/www/src/Controller/User.php:49    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         // temp file
         $fp = fopen('php://temp', 'r+');
         fputcsv($fp, ['username', 'email', 'facebook id']);
-        fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
+        
         rewind($fp);
         $csvAsString = fread($fp, 1024 * 1024);
         // ... close the "file"...

356) /var/www/src/Controller/User.php:51    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // temp file
         $fp = fopen('php://temp', 'r+');
         fputcsv($fp, ['username', 'email', 'facebook id']);
-        fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
+        fputcsv($fp, [$userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
         $csvAsString = fread($fp, 1024 * 1024);
         // ... close the "file"...

357) /var/www/src/Controller/User.php:57    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $fp = fopen('php://temp', 'r+');
         fputcsv($fp, ['username', 'email', 'facebook id']);
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
-        rewind($fp);
+        
         $csvAsString = fread($fp, 1024 * 1024);
         // ... close the "file"...
         fclose($fp);

358) /var/www/src/Controller/User.php:58    [M] DecrementInteger

--- Original
+++ New
@@ @@
         fputcsv($fp, ['username', 'email', 'facebook id']);
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
-        $csvAsString = fread($fp, 1024 * 1024);
+        $csvAsString = fread($fp, 1024 * 1023);
         // ... close the "file"...
         fclose($fp);
         return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }

359) /var/www/src/Controller/User.php:58    [M] Multiplication

--- Original
+++ New
@@ @@
         fputcsv($fp, ['username', 'email', 'facebook id']);
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
-        $csvAsString = fread($fp, 1024 * 1024);
+        $csvAsString = fread($fp, 1024 / 1024);
         // ... close the "file"...
         fclose($fp);
         return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }

360) /var/www/src/Controller/User.php:58    [M] IncrementInteger

--- Original
+++ New
@@ @@
         fputcsv($fp, ['username', 'email', 'facebook id']);
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
-        $csvAsString = fread($fp, 1024 * 1024);
+        $csvAsString = fread($fp, 1025 * 1024);
         // ... close the "file"...
         fclose($fp);
         return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }

361) /var/www/src/Controller/User.php:58    [M] IncrementInteger

--- Original
+++ New
@@ @@
         fputcsv($fp, ['username', 'email', 'facebook id']);
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
-        $csvAsString = fread($fp, 1024 * 1024);
+        $csvAsString = fread($fp, 1024 * 1025);
         // ... close the "file"...
         fclose($fp);
         return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }

362) /var/www/src/Controller/User.php:58    [M] DecrementInteger

--- Original
+++ New
@@ @@
         fputcsv($fp, ['username', 'email', 'facebook id']);
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
-        $csvAsString = fread($fp, 1024 * 1024);
+        $csvAsString = fread($fp, 1023 * 1024);
         // ... close the "file"...
         fclose($fp);
         return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }

363) /var/www/src/Controller/User.php:60    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         fputcsv($fp, [$userFromDb->getUsername(), $userFromDb->getEmail(), $userFromDb->getFacebookId()]);
         rewind($fp);
         $csvAsString = fread($fp, 1024 * 1024);
-        // ... close the "file"...
-        fclose($fp);
+        
         return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }
 }

364) /var/www/src/Controller/User.php:62    [M] NewObject

--- Original
+++ New
@@ @@
         $csvAsString = fread($fp, 1024 * 1024);
         // ... close the "file"...
         fclose($fp);
-        return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
+        new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
+        return null;
     }
 }

365) /var/www/src/Controller/User.php:64    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $csvAsString = fread($fp, 1024 * 1024);
         // ... close the "file"...
         fclose($fp);
-        return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
+        return new Response($csvAsString, 199, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }
 }

366) /var/www/src/Controller/User.php:64    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $csvAsString = fread($fp, 1024 * 1024);
         // ... close the "file"...
         fclose($fp);
-        return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
+        return new Response($csvAsString, 201, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }
 }

367) /var/www/src/Controller/User.php:65    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $csvAsString = fread($fp, 1024 * 1024);
         // ... close the "file"...
         fclose($fp);
-        return new Response($csvAsString, 200, ['content-type' => 'application/csv', 'content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
+        return new Response($csvAsString, 200, ['content-disposition' => 'attachment; filename=personal-data.csv', 'pragma' => 'no-cache']);
     }
 }

368) /var/www/src/Entity/File/TrackFile.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->fileContent = $fileContent;
         $this->createdAt = new \DateTime();
     }
-    public function getFileContent() : string
+    protected function getFileContent() : string
     {
         return $this->fileContent;
     }

369) /var/www/src/Entity/File/TrackFile.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->fileContent;
     }
-    public function getId() : ?string
+    protected function getId() : ?string
     {
         return $this->id;
     }

370) /var/www/src/Entity/File/TrackFile.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function setVersion(Version $version) : void
+    protected function setVersion(Version $version) : void
     {
         $this->version = $version;
     }
 }

371) /var/www/src/Entity/Place.php:56    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->sendBy = $sendBy;
         $this->createdAt = new \DateTime();
     }
-    public function getId() : string
+    protected function getId() : string
     {
         return $this->id;
     }

372) /var/www/src/Entity/Place.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function setLat(float $lat)
+    protected function setLat(float $lat)
     {
         $this->lat = $lat;
     }

373) /var/www/src/Entity/Place.php:66    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->lat = $lat;
     }
-    public function setLng(float $lng)
+    protected function setLng(float $lng)
     {
         $this->lng = $lng;
     }

374) /var/www/src/Entity/Place.php:71    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->lng = $lng;
     }
-    public function addImage(Image $image)
+    protected function addImage(Image $image)
     {
         $this->images->add($image);
     }

376) /var/www/src/Entity/Place.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->createdAt;
     }
-    public function getType() : int
+    protected function getType() : int
     {
         return $this->type;
     }

377) /var/www/src/Entity/Place.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->type;
     }
-    public function setType(int $type)
+    protected function setType(int $type)
     {
         $this->type = $type;
     }

378) /var/www/src/Entity/Place.php:94    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return \ArrayAccess|Image[]
      */
-    public function getImages() : iterable
+    protected function getImages() : iterable
     {
         return $this->images;
     }
 }

379) /var/www/src/Entity/Place/Image.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->sendBy = $sendBy;
         $this->place = $place;
         $this->createdAt = new \DateTime();
-        $place->addImage($this);
+        
     }
     public function getId() : ?string
     {

381) /var/www/src/Entity/Place/Image.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function getFilepath() : string
+    protected function getFilepath() : string
     {
         return $this->filepath;
     }
 }
