383) /var/www/src/Entity/Track.php:144    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function getPointNorthEastLat() : ?float
+    protected function getPointNorthEastLat() : ?float
     {
         return $this->pointNorthEastLat;
     }

384) /var/www/src/Entity/Track.php:149    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->pointNorthEastLat;
     }
-    public function getPointNorthEastLng() : ?float
+    protected function getPointNorthEastLng() : ?float
     {
         return $this->pointNorthEastLng;
     }

385) /var/www/src/Entity/Track.php:154    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->pointNorthEastLng;
     }
-    public function getPointSouthWestLat() : ?float
+    protected function getPointSouthWestLat() : ?float
     {
         return $this->pointSouthWestLat;
     }

386) /var/www/src/Entity/Track.php:159    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->pointSouthWestLat;
     }
-    public function getPointSouthWestLng() : ?float
+    protected function getPointSouthWestLng() : ?float
     {
         return $this->pointSouthWestLng;
     }

387) /var/www/src/Entity/Track.php:167    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return OptimizedPoint[]|ArrayCollection
      */
-    public function getOptimizedPoints()
+    protected function getOptimizedPoints()
     {
         return $this->optimizedPoints;
     }

388) /var/www/src/Entity/Track.php:172    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->optimizedPoints;
     }
-    public function addOptimizedPoint(OptimizedPoint $p)
+    protected function addOptimizedPoint(OptimizedPoint $p)
     {
         $p->setTrack($this);
         $this->optimizedPoints->add($p);

389) /var/www/src/Entity/Track.php:174    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function addOptimizedPoint(OptimizedPoint $p)
     {
-        $p->setTrack($this);
+        
         $this->optimizedPoints->add($p);
     }
     public function addOptimizedPoints(iterable $collection)

390) /var/www/src/Entity/Track.php:175    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function addOptimizedPoint(OptimizedPoint $p)
     {
         $p->setTrack($this);
-        $this->optimizedPoints->add($p);
+        
     }
     public function addOptimizedPoints(iterable $collection)
     {

391) /var/www/src/Entity/Track.php:178    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $p->setTrack($this);
         $this->optimizedPoints->add($p);
     }
-    public function addOptimizedPoints(iterable $collection)
+    protected function addOptimizedPoints(iterable $collection)
     {
         foreach ($collection as $point) {
             $this->addOptimizedPoint($point);

392) /var/www/src/Entity/Track.php:180    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function addOptimizedPoints(iterable $collection)
     {
-        foreach ($collection as $point) {
+        foreach (array() as $point) {
             $this->addOptimizedPoint($point);
         }
     }

393) /var/www/src/Entity/Track.php:181    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function addOptimizedPoints(iterable $collection)
     {
         foreach ($collection as $point) {
-            $this->addOptimizedPoint($point);
+            
         }
     }
     public function getType() : int

395) /var/www/src/Entity/Track.php:190    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->type;
     }
-    public function setType(int $type) : void
+    protected function setType(int $type) : void
     {
         $this->type = $type;
     }

396) /var/www/src/Entity/Track.php:195    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->type = $type;
     }
-    public function getSlug() : ?string
+    protected function getSlug() : ?string
     {
         return $this->slug;
     }

397) /var/www/src/Entity/Track.php:200    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->slug;
     }
-    public function setSlug(?string $slug) : void
+    protected function setSlug(?string $slug) : void
     {
         $this->slug = $slug;
     }

398) /var/www/src/Entity/Track.php:205    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->slug = $slug;
     }
-    public function prepareForRecalculation()
+    protected function prepareForRecalculation()
     {
         $this->pointNorthEastLat = -999;
         $this->pointNorthEastLng = -999;

399) /var/www/src/Entity/Track.php:207    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function prepareForRecalculation()
     {
-        $this->pointNorthEastLat = -999;
+        $this->pointNorthEastLat = -998;
         $this->pointNorthEastLng = -999;
         $this->pointSouthWestLat = 999;
         $this->pointSouthWestLng = 999;

400) /var/www/src/Entity/Track.php:207    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function prepareForRecalculation()
     {
-        $this->pointNorthEastLat = -999;
+        $this->pointNorthEastLat = -1000;
         $this->pointNorthEastLng = -999;
         $this->pointSouthWestLat = 999;
         $this->pointSouthWestLng = 999;

401) /var/www/src/Entity/Track.php:208    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function prepareForRecalculation()
     {
         $this->pointNorthEastLat = -999;
-        $this->pointNorthEastLng = -999;
+        $this->pointNorthEastLng = -1000;
         $this->pointSouthWestLat = 999;
         $this->pointSouthWestLng = 999;
         $this->getOptimizedPoints()->clear();

402) /var/www/src/Entity/Track.php:208    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function prepareForRecalculation()
     {
         $this->pointNorthEastLat = -999;
-        $this->pointNorthEastLng = -999;
+        $this->pointNorthEastLng = -998;
         $this->pointSouthWestLat = 999;
         $this->pointSouthWestLng = 999;
         $this->getOptimizedPoints()->clear();

403) /var/www/src/Entity/Track.php:209    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $this->pointNorthEastLat = -999;
         $this->pointNorthEastLng = -999;
-        $this->pointSouthWestLat = 999;
+        $this->pointSouthWestLat = 998;
         $this->pointSouthWestLng = 999;
         $this->getOptimizedPoints()->clear();
     }

404) /var/www/src/Entity/Track.php:209    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $this->pointNorthEastLat = -999;
         $this->pointNorthEastLng = -999;
-        $this->pointSouthWestLat = 999;
+        $this->pointSouthWestLat = 1000;
         $this->pointSouthWestLng = 999;
         $this->getOptimizedPoints()->clear();
     }

405) /var/www/src/Entity/Track.php:210    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->pointNorthEastLat = -999;
         $this->pointNorthEastLng = -999;
         $this->pointSouthWestLat = 999;
-        $this->pointSouthWestLng = 999;
+        $this->pointSouthWestLng = 1000;
         $this->getOptimizedPoints()->clear();
     }
     public function addVersion(Version $version)

406) /var/www/src/Entity/Track.php:210    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->pointNorthEastLat = -999;
         $this->pointNorthEastLng = -999;
         $this->pointSouthWestLat = 999;
-        $this->pointSouthWestLng = 999;
+        $this->pointSouthWestLng = 998;
         $this->getOptimizedPoints()->clear();
     }
     public function addVersion(Version $version)

407) /var/www/src/Entity/Track.php:212    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->pointNorthEastLng = -999;
         $this->pointSouthWestLat = 999;
         $this->pointSouthWestLng = 999;
-        $this->getOptimizedPoints()->clear();
+        
     }
     public function addVersion(Version $version)
     {

408) /var/www/src/Entity/Track.php:234    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->versions;
     }
-    public function recalculateEdgesCache()
+    protected function recalculateEdgesCache()
     {
         $this->pointNorthEastLat = -999;
         $this->pointNorthEastLng = -999;

417) /var/www/src/Entity/Track.php:241    [M] Foreach_

--- Original
+++ New
@@ @@
         $this->pointNorthEastLng = -999;
         $this->pointSouthWestLat = 999;
         $this->pointSouthWestLng = 999;
-        foreach ($this->versions->first()->getPoints() as $p) {
+        foreach (array() as $p) {
             if ($p->getLat() > $this->pointNorthEastLat) {
                 $this->pointNorthEastLat = $p->getLat();
             }

418) /var/www/src/Entity/Track.php:242    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         $this->pointSouthWestLat = 999;
         $this->pointSouthWestLng = 999;
         foreach ($this->versions->first()->getPoints() as $p) {
-            if ($p->getLat() > $this->pointNorthEastLat) {
+            if ($p->getLat() <= $this->pointNorthEastLat) {
                 $this->pointNorthEastLat = $p->getLat();
             }
             if ($p->getLng() > $this->pointNorthEastLng) {

419) /var/www/src/Entity/Track.php:242    [M] GreaterThan

--- Original
+++ New
@@ @@
         $this->pointSouthWestLat = 999;
         $this->pointSouthWestLng = 999;
         foreach ($this->versions->first()->getPoints() as $p) {
-            if ($p->getLat() > $this->pointNorthEastLat) {
+            if ($p->getLat() >= $this->pointNorthEastLat) {
                 $this->pointNorthEastLat = $p->getLat();
             }
             if ($p->getLng() > $this->pointNorthEastLng) {

420) /var/www/src/Entity/Track.php:246    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
             if ($p->getLat() > $this->pointNorthEastLat) {
                 $this->pointNorthEastLat = $p->getLat();
             }
-            if ($p->getLng() > $this->pointNorthEastLng) {
+            if ($p->getLng() <= $this->pointNorthEastLng) {
                 $this->pointNorthEastLng = $p->getLng();
             }
             if ($p->getLat() < $this->pointSouthWestLat) {

421) /var/www/src/Entity/Track.php:246    [M] GreaterThan

--- Original
+++ New
@@ @@
             if ($p->getLat() > $this->pointNorthEastLat) {
                 $this->pointNorthEastLat = $p->getLat();
             }
-            if ($p->getLng() > $this->pointNorthEastLng) {
+            if ($p->getLng() >= $this->pointNorthEastLng) {
                 $this->pointNorthEastLng = $p->getLng();
             }
             if ($p->getLat() < $this->pointSouthWestLat) {

422) /var/www/src/Entity/Track.php:250    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             if ($p->getLng() > $this->pointNorthEastLng) {
                 $this->pointNorthEastLng = $p->getLng();
             }
-            if ($p->getLat() < $this->pointSouthWestLat) {
+            if ($p->getLat() >= $this->pointSouthWestLat) {
                 $this->pointSouthWestLat = $p->getLat();
             }
             if ($p->getLng() < $this->pointSouthWestLng) {

423) /var/www/src/Entity/Track.php:250    [M] LessThan

--- Original
+++ New
@@ @@
             if ($p->getLng() > $this->pointNorthEastLng) {
                 $this->pointNorthEastLng = $p->getLng();
             }
-            if ($p->getLat() < $this->pointSouthWestLat) {
+            if ($p->getLat() <= $this->pointSouthWestLat) {
                 $this->pointSouthWestLat = $p->getLat();
             }
             if ($p->getLng() < $this->pointSouthWestLng) {

424) /var/www/src/Entity/Track.php:254    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             if ($p->getLat() < $this->pointSouthWestLat) {
                 $this->pointSouthWestLat = $p->getLat();
             }
-            if ($p->getLng() < $this->pointSouthWestLng) {
+            if ($p->getLng() >= $this->pointSouthWestLng) {
                 $this->pointSouthWestLng = $p->getLng();
             }
         }

425) /var/www/src/Entity/Track.php:254    [M] LessThan

--- Original
+++ New
@@ @@
             if ($p->getLat() < $this->pointSouthWestLat) {
                 $this->pointSouthWestLat = $p->getLat();
             }
-            if ($p->getLng() < $this->pointSouthWestLng) {
+            if ($p->getLng() <= $this->pointSouthWestLng) {
                 $this->pointSouthWestLng = $p->getLng();
             }
         }

426) /var/www/src/Entity/Track.php:273    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->uphills->add($track);
     }
-    public function removeUphill(Track $track)
+    protected function removeUphill(Track $track)
     {
         $this->uphills->removeElement($track);
     }

427) /var/www/src/Entity/Track.php:275    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function removeUphill(Track $track)
     {
-        $this->uphills->removeElement($track);
+        
     }
     public function addDownhill(Track $track)
     {

428) /var/www/src/Entity/Track.php:283    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->downhills->add($track);
     }
-    public function removeDownhill(Track $track)
+    protected function removeDownhill(Track $track)
     {
         $this->downhills->removeElement($track);
     }

429) /var/www/src/Entity/Track.php:285    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function removeDownhill(Track $track)
     {
-        $this->downhills->removeElement($track);
+        
     }
     /**
      * @return Track[]

430) /var/www/src/Entity/Track.php:346    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $versions;
     }
-    public function getSlugOrId() : string
+    protected function getSlugOrId() : string
     {
         if ($this->getSlug()) {
             return $this->getSlug();

431) /var/www/src/Entity/Track.php:355    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->getId();
     }
-    public function getVisibility() : int
+    protected function getVisibility() : int
     {
         return $this->visibility;
     }

432) /var/www/src/Entity/Track.php:360    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->visibility;
     }
-    public function setVisibility(int $visibility) : void
+    protected function setVisibility(int $visibility) : void
     {
         $this->visibility = $visibility;
     }

433) /var/www/src/Entity/Track.php:368    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return Youtube[]|iterable
      */
-    public function getVideosYoutube() : iterable
+    protected function getVideosYoutube() : iterable
     {
         return $this->videosYoutube;
     }

434) /var/www/src/Entity/Track.php:373    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->videosYoutube;
     }
-    public function setVideosYoutube(iterable $videos)
+    protected function setVideosYoutube(iterable $videos)
     {
         $this->videosYoutube->clear();
         foreach ($videos as $video) {

435) /var/www/src/Entity/Track.php:375    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function setVideosYoutube(iterable $videos)
     {
-        $this->videosYoutube->clear();
+        
         foreach ($videos as $video) {
             $this->addVideoYoutube($video);
         }

436) /var/www/src/Entity/Track.php:377    [M] Foreach_

--- Original
+++ New
@@ @@
     public function setVideosYoutube(iterable $videos)
     {
         $this->videosYoutube->clear();
-        foreach ($videos as $video) {
+        foreach (array() as $video) {
             $this->addVideoYoutube($video);
         }
     }

437) /var/www/src/Entity/Track.php:378    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->videosYoutube->clear();
         foreach ($videos as $video) {
-            $this->addVideoYoutube($video);
+            
         }
     }
     public function addVideoYoutube(Youtube $video)

438) /var/www/src/Entity/Track.php:382    [M] PublicVisibility

--- Original
+++ New
@@ @@
             $this->addVideoYoutube($video);
         }
     }
-    public function addVideoYoutube(Youtube $video)
+    protected function addVideoYoutube(Youtube $video)
     {
         $video->setTrack($this);
         $this->videosYoutube->add($video);

439) /var/www/src/Entity/Track.php:384    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function addVideoYoutube(Youtube $video)
     {
-        $video->setTrack($this);
+        
         $this->videosYoutube->add($video);
     }
     public function getCreatedAt() : DateTime

440) /var/www/src/Entity/Track.php:385    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function addVideoYoutube(Youtube $video)
     {
         $video->setTrack($this);
-        $this->videosYoutube->add($video);
+        
     }
     public function getCreatedAt() : DateTime
     {

441) /var/www/src/Entity/Track.php:396    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return Image[]|ArrayCollection
      */
-    public function getImages()
+    protected function getImages()
     {
         return $this->images;
     }

443) /var/www/src/Entity/Track/Image.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->filepath;
     }
-    public function getTrack() : Track
+    protected function getTrack() : Track
     {
         return $this->track;
     }
 }

444) /var/www/src/Entity/Track/OptimizedPoint.php:60    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param mixed $track
      */
-    public function setTrack($track) : void
+    protected function setTrack($track) : void
     {
         $this->track = $track;
     }

445) /var/www/src/Entity/Track/OptimizedPoint.php:68    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return mixed
      */
-    public function getLat()
+    protected function getLat()
     {
         return $this->lat;
     }

446) /var/www/src/Entity/Track/OptimizedPoint.php:76    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return mixed
      */
-    public function getLng()
+    protected function getLng()
     {
         return $this->lng;
     }

447) /var/www/src/Entity/Track/OptimizedPoint.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->lng;
     }
-    public function getVersionIndex() : int
+    protected function getVersionIndex() : int
     {
         return $this->versionIndex;
     }

448) /var/www/src/Entity/Track/OptimizedPoint.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->versionIndex;
     }
-    public function setVersionIndex(int $versionIndex) : void
+    protected function setVersionIndex(int $versionIndex) : void
     {
         $this->versionIndex = $versionIndex;
     }
 }

451) /var/www/src/Entity/Track/Version.php:94    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->track = $track;
     }
-    public function getTrack() : ?Track
+    protected function getTrack() : ?Track
     {
         return $this->track;
     }

452) /var/www/src/Entity/Track/Version.php:113    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $p->setVersion($this);
         $this->points->add($p);
     }
-    public function addWayPoint(WayPoint $wp)
+    protected function addWayPoint(WayPoint $wp)
     {
         $wp->setVersion($this);
         $this->wayPoints->add($wp);

453) /var/www/src/Entity/Track/Version.php:115    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function addWayPoint(WayPoint $wp)
     {
-        $wp->setVersion($this);
+        
         $this->wayPoints->add($wp);
     }
     /**

454) /var/www/src/Entity/Track/Version.php:116    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function addWayPoint(WayPoint $wp)
     {
         $wp->setVersion($this);
-        $this->wayPoints->add($wp);
+        
     }
     /**
      * @return WayPoint[]|ArrayCollection

455) /var/www/src/Entity/Track/Version.php:127    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->wayPoints;
     }
-    public function getFile() : ?TrackFile
+    protected function getFile() : ?TrackFile
     {
         return $this->file;
     }

456) /var/www/src/Entity/Track/Version.php:132    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->file;
     }
-    public function setFile(TrackFile $file) : void
+    protected function setFile(TrackFile $file) : void
     {
         $this->file = $file;
     }

457) /var/www/src/Entity/Track/Version.php:160    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->negativeElevation = $negativeElevation;
     }
-    public function getRatings()
+    protected function getRatings()
     {
         return $this->ratings;
     }

458) /var/www/src/Entity/Track/Version.php:170    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return int
      */
-    public function getVotes() : int
+    protected function getVotes() : int
     {
         return $this->ratings->count();
     }

459) /var/www/src/Entity/Track/Version.php:179    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * Get version difficulty
      * @return string
      */
-    public function getDifficulty() : ?string
+    protected function getDifficulty() : ?string
     {
         return $this->difficulty;
     }

460) /var/www/src/Entity/Track/Version.php:189    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @param $difficulty
      */
-    public function setDifficulty(string $difficulty = null) : void
+    protected function setDifficulty(string $difficulty = null) : void
     {
         $this->difficulty = $difficulty;
     }
 }

461) /var/www/src/Entity/Track/VersionRating.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return string|null
      */
-    public function getId() : ?string
+    protected function getId() : ?string
     {
         return $this->id;
     }

462) /var/www/src/Entity/Track/VersionRating.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return Version|null
      */
-    public function getVersion()
+    protected function getVersion()
     {
         return $this->version;
     }

463) /var/www/src/Entity/Track/VersionRating.php:71    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param Version $version
      */
-    public function setVersion(Version $version) : void
+    protected function setVersion(Version $version) : void
     {
         $this->version = $version;
     }

464) /var/www/src/Entity/Track/VersionRating.php:79    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return User
      */
-    public function getUser()
+    protected function getUser()
     {
         return $this->user;
     }

465) /var/www/src/Entity/Track/VersionRating.php:87    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param User $user
      */
-    public function setUser(User $user) : void
+    protected function setUser(User $user) : void
     {
         $this->user = $user;
     }

466) /var/www/src/Entity/Track/VersionRating.php:95    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return int
      */
-    public function getRating() : int
+    protected function getRating() : int
     {
         return $this->rating;
     }

467) /var/www/src/Entity/Track/VersionRating.php:103    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param int $rating
      */
-    public function setRating(int $rating)
+    protected function setRating(int $rating)
     {
         $this->rating = $rating;
     }
 }

469) /var/www/src/Entity/Track/WayPoint.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function getVersion() : ?Version
+    protected function getVersion() : ?Version
     {
         return $this->version;
     }

470) /var/www/src/Entity/Track/WayPoint.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->version;
     }
-    public function setVersion(Version $version)
+    protected function setVersion(Version $version)
     {
         $this->version = $version;
     }

471) /var/www/src/Entity/Track/WayPoint.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->version = $version;
     }
-    public function getName() : ?string
+    protected function getName() : ?string
     {
         return $this->name;
     }

472) /var/www/src/Entity/Track/WayPoint.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->name;
     }
-    public function setName(string $name = null)
+    protected function setName(string $name = null)
     {
         $this->name = $name;
     }
 }

473) /var/www/src/Entity/User/User.php:50    [M] PublicVisibility

--- Original
+++ New
@@ @@
         parent::__construct();
         $this->ratings = new ArrayCollection();
     }
-    public function getFacebookId() : ?string
+    protected function getFacebookId() : ?string
     {
         return $this->facebookId;
     }

474) /var/www/src/Entity/User/User.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param string|null $facebookId
      */
-    public function setFacebookId($facebookId) : void
+    protected function setFacebookId($facebookId) : void
     {
         $this->facebookId = $facebookId;
     }

475) /var/www/src/Entity/User/User.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->facebookId = $facebookId;
     }
-    public function isAcceptedTerms()
+    protected function isAcceptedTerms()
     {
         if ($this->termsAccepted === null) {
             return false;

476) /var/www/src/Entity/User/User.php:65    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isAcceptedTerms()
     {
-        if ($this->termsAccepted === null) {
+        if ($this->termsAccepted !== null) {
             return false;
         }
         return true;

477) /var/www/src/Entity/User/User.php:66    [M] FalseValue

--- Original
+++ New
@@ @@
     public function isAcceptedTerms()
     {
         if ($this->termsAccepted === null) {
-            return false;
+            return true;
         }
         return true;
     }

479) /var/www/src/Entity/User/User.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return true;
     }
-    public function acceptTerms()
+    protected function acceptTerms()
     {
         $this->termsAccepted = new \DateTime();
     }

480) /var/www/src/Entity/User/User.php:80    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return ArrayCollection|VersionRating[]
      */
-    public function getRatings()
+    protected function getRatings()
     {
         return $this->ratings;
     }
 }

481) /var/www/src/Entity/Video/Youtube.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->link = $link;
     }
-    public function getLink() : string
+    protected function getLink() : string
     {
         return $this->link;
     }

482) /var/www/src/Entity/Video/Youtube.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->link;
     }
-    public function setTrack(Track $track)
+    protected function setTrack(Track $track)
     {
         $this->track = $track;
     }
 }

483) /var/www/src/EntityTraits/NameTrait.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->nameEn;
     }
-    public function getNameEn() : ?string
+    protected function getNameEn() : ?string
     {
         return $this->nameEn;
     }

484) /var/www/src/EntityTraits/NameTrait.php:39    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->nameEn;
     }
-    public function getNameBg() : ?string
+    protected function getNameBg() : ?string
     {
         return $this->nameBg;
     }

485) /var/www/src/EntityTraits/SendByTrait.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @ORM\ManyToOne(targetEntity="App\Entity\User\User")
      */
     private $sendBy;
-    public function getSendBy() : User
+    protected function getSendBy() : User
     {
         return $this->sendBy;
     }
 }

486) /var/www/src/Event/Listener/User/Terms.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->tokenStorage = $tokenStorage;
     }
-    public function onKernelRequest(GetResponseEvent $event)
+    protected function onKernelRequest(GetResponseEvent $event)
     {
         if (!$event->isMasterRequest()) {
             return;

487) /var/www/src/Event/Listener/User/Terms.php:20    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public function onKernelRequest(GetResponseEvent $event)
     {
-        if (!$event->isMasterRequest()) {
+        if ($event->isMasterRequest()) {
             return;
         }
         $token = $this->tokenStorage->getToken();

488) /var/www/src/Event/Listener/User/Terms.php:26    [M] LogicalNot

--- Original
+++ New
@@ @@
             return;
         }
         $token = $this->tokenStorage->getToken();
-        if (!$token) {
+        if ($token) {
             return;
         }
         $user = $this->tokenStorage->getToken()->getUser();
