489) /var/www/src/Event/Listener/User/Terms.php:31    [M] LogicalNot

--- Original
+++ New
@@ @@
             return;
         }
         $user = $this->tokenStorage->getToken()->getUser();
-        if (!$user instanceof User) {
+        if ($user instanceof User) {
             return;
         }
         if ($user->isAcceptedTerms()) {

490) /var/www/src/Event/Listener/User/Terms.php:39    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             // terms are accepted, continue with the page loading
             return;
         }
-        $allowedUrls = ['/user/terms', '/privacy-policy', '/terms-of-service'];
+        $allowedUrls = ['/privacy-policy', '/terms-of-service'];
         $urlAllowed = false;
         $pathInfo = $event->getRequest()->getPathInfo();
         foreach ($allowedUrls as $url) {

491) /var/www/src/Event/Listener/User/Terms.php:45    [M] FalseValue

--- Original
+++ New
@@ @@
             return;
         }
         $allowedUrls = ['/user/terms', '/privacy-policy', '/terms-of-service'];
-        $urlAllowed = false;
+        $urlAllowed = true;
         $pathInfo = $event->getRequest()->getPathInfo();
         foreach ($allowedUrls as $url) {
             if (strpos($pathInfo, $url) === 3) {

492) /var/www/src/Event/Listener/User/Terms.php:47    [M] Foreach_

--- Original
+++ New
@@ @@
         $allowedUrls = ['/user/terms', '/privacy-policy', '/terms-of-service'];
         $urlAllowed = false;
         $pathInfo = $event->getRequest()->getPathInfo();
-        foreach ($allowedUrls as $url) {
+        foreach (array() as $url) {
             if (strpos($pathInfo, $url) === 3) {
                 $urlAllowed = true;
                 break;

493) /var/www/src/Event/Listener/User/Terms.php:48    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $urlAllowed = false;
         $pathInfo = $event->getRequest()->getPathInfo();
         foreach ($allowedUrls as $url) {
-            if (strpos($pathInfo, $url) === 3) {
+            if (strpos($pathInfo, $url) === 4) {
                 $urlAllowed = true;
                 break;
             }

494) /var/www/src/Event/Listener/User/Terms.php:48    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $urlAllowed = false;
         $pathInfo = $event->getRequest()->getPathInfo();
         foreach ($allowedUrls as $url) {
-            if (strpos($pathInfo, $url) === 3) {
+            if (strpos($pathInfo, $url) === 2) {
                 $urlAllowed = true;
                 break;
             }

495) /var/www/src/Event/Listener/User/Terms.php:48    [M] Identical

--- Original
+++ New
@@ @@
         $urlAllowed = false;
         $pathInfo = $event->getRequest()->getPathInfo();
         foreach ($allowedUrls as $url) {
-            if (strpos($pathInfo, $url) === 3) {
+            if (strpos($pathInfo, $url) !== 3) {
                 $urlAllowed = true;
                 break;
             }

496) /var/www/src/Event/Listener/User/Terms.php:49    [M] TrueValue

--- Original
+++ New
@@ @@
         $pathInfo = $event->getRequest()->getPathInfo();
         foreach ($allowedUrls as $url) {
             if (strpos($pathInfo, $url) === 3) {
-                $urlAllowed = true;
+                $urlAllowed = false;
                 break;
             }
         }

497) /var/www/src/Event/Listener/User/Terms.php:50    [M] Break_

--- Original
+++ New
@@ @@
         foreach ($allowedUrls as $url) {
             if (strpos($pathInfo, $url) === 3) {
                 $urlAllowed = true;
-                break;
+                continue;
             }
         }
         if ($urlAllowed === false) {

498) /var/www/src/Event/Listener/User/Terms.php:54    [M] FalseValue

--- Original
+++ New
@@ @@
                 break;
             }
         }
-        if ($urlAllowed === false) {
+        if ($urlAllowed === true) {
             $response = new \Symfony\Component\HttpFoundation\RedirectResponse('/en/user/terms', 302);
             $event->setResponse($response);
             $event->stopPropagation();

499) /var/www/src/Event/Listener/User/Terms.php:54    [M] Identical

--- Original
+++ New
@@ @@
                 break;
             }
         }
-        if ($urlAllowed === false) {
+        if ($urlAllowed !== false) {
             $response = new \Symfony\Component\HttpFoundation\RedirectResponse('/en/user/terms', 302);
             $event->setResponse($response);
             $event->stopPropagation();

500) /var/www/src/Event/Listener/User/Terms.php:55    [M] DecrementInteger

--- Original
+++ New
@@ @@
             }
         }
         if ($urlAllowed === false) {
-            $response = new \Symfony\Component\HttpFoundation\RedirectResponse('/en/user/terms', 302);
+            $response = new \Symfony\Component\HttpFoundation\RedirectResponse('/en/user/terms', 301);
             $event->setResponse($response);
             $event->stopPropagation();
         }
     }

501) /var/www/src/Event/Listener/User/Terms.php:55    [M] IncrementInteger

--- Original
+++ New
@@ @@
             }
         }
         if ($urlAllowed === false) {
-            $response = new \Symfony\Component\HttpFoundation\RedirectResponse('/en/user/terms', 302);
+            $response = new \Symfony\Component\HttpFoundation\RedirectResponse('/en/user/terms', 303);
             $event->setResponse($response);
             $event->stopPropagation();
         }
     }

502) /var/www/src/Event/Listener/User/Terms.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         if ($urlAllowed === false) {
             $response = new \Symfony\Component\HttpFoundation\RedirectResponse('/en/user/terms', 302);
-            $event->setResponse($response);
+            
             $event->stopPropagation();
         }
     }
 }

503) /var/www/src/Event/Listener/User/Terms.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($urlAllowed === false) {
             $response = new \Symfony\Component\HttpFoundation\RedirectResponse('/en/user/terms', 302);
             $event->setResponse($response);
-            $event->stopPropagation();
+            
         }
     }
 }

504) /var/www/src/Form/Type/Place.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
+        
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];

505) /var/www/src/Form/Type/Place.php:19    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
+        $builder->add('nameEn', TextType::class, ['label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];

506) /var/www/src/Form/Type/Place.php:20    [M] FalseValue

--- Original
+++ New
@@ @@
 {
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
+        $builder->add('nameEn', TextType::class, ['required' => true, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];

507) /var/www/src/Form/Type/Place.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
-        $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
+        
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);

508) /var/www/src/Form/Type/Place.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
-        $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
+        $builder->add('nameBg', TextType::class, ['label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);

509) /var/www/src/Form/Type/Place.php:29    [M] FalseValue

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
-        $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
+        $builder->add('nameBg', TextType::class, ['required' => true, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);

510) /var/www/src/Form/Type/Place.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
-        $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
+        
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }

511) /var/www/src/Form/Type/Place.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
-        $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
+        $builder->add('type', ChoiceType::class, []);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }

512) /var/www/src/Form/Type/Place.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
-        $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
+        $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }

513) /var/www/src/Form/Type/Place.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
-        $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
+        $coordinatesConstraints = [];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

514) /var/www/src/Form/Type/Place.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
-        $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
+        $coordinatesConstraints = [new Range(['max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

515) /var/www/src/Form/Type/Place.php:47    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
-        $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
+        $coordinatesConstraints = [new Range(['min' => -181, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

516) /var/www/src/Form/Type/Place.php:47    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
-        $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
+        $coordinatesConstraints = [new Range(['min' => -179, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

517) /var/www/src/Form/Type/Place.php:48    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
-        $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
+        $coordinatesConstraints = [new Range(['min' => -180, 'max' => 181])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

518) /var/www/src/Form/Type/Place.php:48    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
-        $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
+        $coordinatesConstraints = [new Range(['min' => -180, 'max' => 179])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

519) /var/www/src/Form/Type/Place.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
-        $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
+        
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

520) /var/www/src/Form/Type/Place.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
-        $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
+        $builder->add('lat', NumberType::class, ['label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

521) /var/www/src/Form/Type/Place.php:56    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
-        $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
+        $builder->add('lat', NumberType::class, ['scale' => 9, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

522) /var/www/src/Form/Type/Place.php:56    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
-        $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
+        $builder->add('lat', NumberType::class, ['scale' => 7, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
         $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

523) /var/www/src/Form/Type/Place.php:62    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
-        $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
+        
     }
 }

524) /var/www/src/Form/Type/Place.php:65    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
-        $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
+        $builder->add('lng', NumberType::class, ['label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

525) /var/www/src/Form/Type/Place.php:66    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
-        $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
+        $builder->add('lng', NumberType::class, ['scale' => 7, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

526) /var/www/src/Form/Type/Place.php:66    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $builder->add('type', ChoiceType::class, ['choices' => ['form.place.type.generic' => \App\Entity\Place::TYPE_GENERIC, 'form.place.type.drinking_fountain' => \App\Entity\Place::TYPE_DRINKING_FOUNTAIN]]);
         $coordinatesConstraints = [new Range(['min' => -180, 'max' => 180])];
         $builder->add('lat', NumberType::class, ['scale' => 8, 'label' => 'Latitude', 'constraints' => $coordinatesConstraints]);
-        $builder->add('lng', NumberType::class, ['scale' => 8, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
+        $builder->add('lng', NumberType::class, ['scale' => 9, 'label' => 'Longitude', 'constraints' => $coordinatesConstraints]);
     }
 }

527) /var/www/src/Form/Type/Track.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (isset($options['data'])) {
             $track = $options['data'];
         }
-        $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
+        
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);

528) /var/www/src/Form/Type/Track.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if (isset($options['data'])) {
             $track = $options['data'];
         }
-        $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
+        $builder->add('nameEn', TextType::class, ['label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);

529) /var/www/src/Form/Type/Track.php:28    [M] FalseValue

--- Original
+++ New
@@ @@
         if (isset($options['data'])) {
             $track = $options['data'];
         }
-        $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
+        $builder->add('nameEn', TextType::class, ['required' => true, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);

533) /var/www/src/Form/Type/Track.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
-        $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
+        
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
