534) /var/www/src/Form/Type/Track.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
-        $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
+        $builder->add('type', ChoiceType::class, []);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);

535) /var/www/src/Form/Type/Track.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
-        $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
+        $builder->add('type', ChoiceType::class, ['choices' => ['hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);

536) /var/www/src/Form/Type/Track.php:53    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
-        $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
+        
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }

537) /var/www/src/Form/Type/Track.php:56    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
-        $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
+        $builder->add('visibility', ChoiceType::class, []);
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }

538) /var/www/src/Form/Type/Track.php:57    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('nameEn', TextType::class, ['required' => false, 'label' => 'Name in English']);
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
-        $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
+        $builder->add('visibility', ChoiceType::class, ['choices' => ['unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }

539) /var/www/src/Form/Type/Track.php:64    [M] LogicalOr

--- Original
+++ New
@@ @@
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
-        if ($track == null || $track->getId() == null) {
+        if ($track == null && $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);

540) /var/www/src/Form/Type/Track.php:64    [M] Equal

--- Original
+++ New
@@ @@
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
-        if ($track == null || $track->getId() == null) {
+        if ($track != null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);

541) /var/www/src/Form/Type/Track.php:64    [M] AssignmentEqual

--- Original
+++ New
@@ @@
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
-        if ($track == null || $track->getId() == null) {
+        if (($track = null) || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);

542) /var/www/src/Form/Type/Track.php:64    [M] Equal

--- Original
+++ New
@@ @@
         $builder->add('nameBg', TextType::class, ['required' => false, 'label' => 'Name in Bulgarian']);
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
-        if ($track == null || $track->getId() == null) {
+        if ($track == null || $track->getId() != null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);

543) /var/www/src/Form/Type/Track.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
         if ($track == null || $track->getId() == null) {
-            $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
+            
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
         $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);

544) /var/www/src/Form/Type/Track.php:68    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('type', ChoiceType::class, ['choices' => ['cycling' => \App\Entity\Track::TYPE_CYCLING, 'hiking' => \App\Entity\Track::TYPE_HIKING]]);
         $builder->add('visibility', ChoiceType::class, ['choices' => ['public' => \App\Entity\Track::VISIBILITY_PUBLIC, 'unlisted' => \App\Entity\Track::VISIBILITY_UNLISTED]]);
         if ($track == null || $track->getId() == null) {
-            $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
+            $builder->add('file', FileType::class, []);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
         $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);

545) /var/www/src/Form/Type/Track.php:74    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
-        $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
+        
         $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
     }

546) /var/www/src/Form/Type/Track.php:77    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
-        $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
+        $builder->add('videosYoutube', CollectionType::class, ['allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
         $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
     }

547) /var/www/src/Form/Type/Track.php:78    [M] TrueValue

--- Original
+++ New
@@ @@
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
-        $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
+        $builder->add('videosYoutube', CollectionType::class, ['allow_add' => false, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
         $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
     }

548) /var/www/src/Form/Type/Track.php:79    [M] TrueValue

--- Original
+++ New
@@ @@
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
-        $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
+        $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => false, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
         $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
     }

549) /var/www/src/Form/Type/Track.php:80    [M] TrueValue

--- Original
+++ New
@@ @@
         if ($track == null || $track->getId() == null) {
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
-        $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
+        $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => false, 'entry_type' => YoutubeType::class]);
         $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
     }

550) /var/www/src/Form/Type/Track.php:85    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
-        $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
+        
     }
     public function configureOptions(OptionsResolver $resolver)

551) /var/www/src/Form/Type/Track.php:88    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
-        $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
+        $builder->add('slug', TextType::class, ['label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
     }
     public function configureOptions(OptionsResolver $resolver)

552) /var/www/src/Form/Type/Track.php:89    [M] FalseValue

--- Original
+++ New
@@ @@
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
-        $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
+        $builder->add('slug', TextType::class, ['required' => true, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
     }
     public function configureOptions(OptionsResolver $resolver)

553) /var/www/src/Form/Type/Track.php:91    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $builder->add('file', FileType::class, ['label' => 'Track file. Supported formats: .gpx']);
         }
         $builder->add('videosYoutube', CollectionType::class, ['allow_add' => true, 'allow_delete' => true, 'by_reference' => true, 'entry_type' => YoutubeType::class]);
-        $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['pattern' => '/^[a-zA-Z0-9_\\-]+$/', 'message' => 'Should contains only letters, numbers, dash and underscore'])]);
+        $builder->add('slug', TextType::class, ['required' => false, 'label' => 'Short link', 'constraints' => new Regex(['message' => 'Should contains only letters, numbers, dash and underscore'])]);
     }
     public function configureOptions(OptionsResolver $resolver)

557) /var/www/src/Form/Type/Track.php:116    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function configureOptions(OptionsResolver $resolver)
     {
-        $resolver->setDefaults(['mapped' => false]);
+        $resolver->setDefaults([]);
     }
 }

558) /var/www/src/Form/Type/Track.php:116    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function configureOptions(OptionsResolver $resolver)
     {
-        $resolver->setDefaults(['mapped' => false]);
+        
     }
 }

559) /var/www/src/Form/Type/Track.php:117    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     public function configureOptions(OptionsResolver $resolver)
     {
-        $resolver->setDefaults(['mapped' => false]);
+        $resolver->setDefaults(['mapped' => true]);
     }
 }

560) /var/www/src/Form/Type/Track/Video/YoutubeType.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('link', TextType::class, ['required' => false, 'attr' => ['placeholder' => 'https://www.youtube.com/watch?v=EqYgAX6D43Q']]);
+        
     }
 }

561) /var/www/src/Form/Type/Track/Video/YoutubeType.php:19    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('link', TextType::class, ['required' => false, 'attr' => ['placeholder' => 'https://www.youtube.com/watch?v=EqYgAX6D43Q']]);
+        $builder->add('link', TextType::class, ['attr' => ['placeholder' => 'https://www.youtube.com/watch?v=EqYgAX6D43Q']]);
     }
 }

562) /var/www/src/Form/Type/Track/Video/YoutubeType.php:20    [M] FalseValue

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('link', TextType::class, ['required' => false, 'attr' => ['placeholder' => 'https://www.youtube.com/watch?v=EqYgAX6D43Q']]);
+        $builder->add('link', TextType::class, ['required' => true, 'attr' => ['placeholder' => 'https://www.youtube.com/watch?v=EqYgAX6D43Q']]);
     }
 }

563) /var/www/src/Form/Type/Track/Video/YoutubeType.php:21    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('link', TextType::class, ['required' => false, 'attr' => ['placeholder' => 'https://www.youtube.com/watch?v=EqYgAX6D43Q']]);
+        $builder->add('link', TextType::class, ['required' => false, 'attr' => []]);
     }
 }

564) /var/www/src/Form/Type/TrackVersion.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('file', FileType::class);
+        
     }
 }

568) /var/www/src/Form/Type/User/Terms.php:18    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
+        
         $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
     }
 }

569) /var/www/src/Form/Type/User/Terms.php:21    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
+        $builder->add('agreeTerms', CheckboxType::class, ['label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
         $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
     }
 }

570) /var/www/src/Form/Type/User/Terms.php:22    [M] TrueValue

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
+        $builder->add('agreeTerms', CheckboxType::class, ['required' => false, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
         $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
     }
 }

571) /var/www/src/Form/Type/User/Terms.php:24    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
+        $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new IsTrue()]]);
         $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
     }
 }

572) /var/www/src/Form/Type/User/Terms.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
         $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
-        $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
+        
     }
 }

573) /var/www/src/Form/Type/User/Terms.php:34    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
         $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
-        $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
+        $builder->add('agreePrivacy', CheckboxType::class, ['label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
     }
 }

574) /var/www/src/Form/Type/User/Terms.php:35    [M] TrueValue

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
         $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
-        $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
+        $builder->add('agreePrivacy', CheckboxType::class, ['required' => false, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
     }
 }

575) /var/www/src/Form/Type/User/Terms.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
         $builder->add('agreeTerms', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Terms of the Service', 'constraints' => [new Required(), new IsTrue()]]);
-        $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new Required(), new IsTrue()]]);
+        $builder->add('agreePrivacy', CheckboxType::class, ['required' => true, 'label' => 'I agree with the Privacy Policy', 'constraints' => [new IsTrue()]]);
     }
 }

576) /var/www/src/Image/ImageEdit.php:9    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Component\Filesystem\Filesystem;
 class ImageEdit
 {
-    public function resize(string $input, string $output, int $maxW, int $maxH)
+    protected function resize(string $input, string $output, int $maxW, int $maxH)
     {
         $image = new \Imagick($input);
         $image->setImageOrientation($image->getImageOrientation());

577) /var/www/src/Image/ImageEdit.php:12    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function resize(string $input, string $output, int $maxW, int $maxH)
     {
         $image = new \Imagick($input);
-        $image->setImageOrientation($image->getImageOrientation());
+        
         $resizedW = min($image->getImageWidth(), $maxW);
         $resizedH = min($image->getImageHeight(), $maxH);
         $image->adaptiveResizeImage($resizedW, $resizedH, true);

578) /var/www/src/Image/ImageEdit.php:17    [M] TrueValue

--- Original
+++ New
@@ @@
         $image->setImageOrientation($image->getImageOrientation());
         $resizedW = min($image->getImageWidth(), $maxW);
         $resizedH = min($image->getImageHeight(), $maxH);
-        $image->adaptiveResizeImage($resizedW, $resizedH, true);
+        $image->adaptiveResizeImage($resizedW, $resizedH, false);
         $rotateAngle = $this->getRotateAngle($input);
         if ($rotateAngle !== 0) {
             $image->rotateImage('#FFFFFF', $rotateAngle);

579) /var/www/src/Image/ImageEdit.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $image->setImageOrientation($image->getImageOrientation());
         $resizedW = min($image->getImageWidth(), $maxW);
         $resizedH = min($image->getImageHeight(), $maxH);
-        $image->adaptiveResizeImage($resizedW, $resizedH, true);
+        
         $rotateAngle = $this->getRotateAngle($input);
         if ($rotateAngle !== 0) {
             $image->rotateImage('#FFFFFF', $rotateAngle);

580) /var/www/src/Image/ImageEdit.php:20    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $resizedH = min($image->getImageHeight(), $maxH);
         $image->adaptiveResizeImage($resizedW, $resizedH, true);
         $rotateAngle = $this->getRotateAngle($input);
-        if ($rotateAngle !== 0) {
+        if ($rotateAngle !== -1) {
             $image->rotateImage('#FFFFFF', $rotateAngle);
         }
         $profiles = $image->getImageProfiles("icc", true);

581) /var/www/src/Image/ImageEdit.php:20    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $resizedH = min($image->getImageHeight(), $maxH);
         $image->adaptiveResizeImage($resizedW, $resizedH, true);
         $rotateAngle = $this->getRotateAngle($input);
-        if ($rotateAngle !== 0) {
+        if ($rotateAngle !== 1) {
             $image->rotateImage('#FFFFFF', $rotateAngle);
         }
         $profiles = $image->getImageProfiles("icc", true);

582) /var/www/src/Image/ImageEdit.php:20    [M] NotIdentical

--- Original
+++ New
@@ @@
         $resizedH = min($image->getImageHeight(), $maxH);
         $image->adaptiveResizeImage($resizedW, $resizedH, true);
         $rotateAngle = $this->getRotateAngle($input);
-        if ($rotateAngle !== 0) {
+        if ($rotateAngle === 0) {
             $image->rotateImage('#FFFFFF', $rotateAngle);
         }
         $profiles = $image->getImageProfiles("icc", true);
