583) /var/www/src/Image/ImageEdit.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $image->adaptiveResizeImage($resizedW, $resizedH, true);
         $rotateAngle = $this->getRotateAngle($input);
         if ($rotateAngle !== 0) {
-            $image->rotateImage('#FFFFFF', $rotateAngle);
+            
         }
         $profiles = $image->getImageProfiles("icc", true);
         // clear personal data stored in meta information

584) /var/www/src/Image/ImageEdit.php:24    [M] TrueValue

--- Original
+++ New
@@ @@
         if ($rotateAngle !== 0) {
             $image->rotateImage('#FFFFFF', $rotateAngle);
         }
-        $profiles = $image->getImageProfiles("icc", true);
+        $profiles = $image->getImageProfiles("icc", false);
         // clear personal data stored in meta information
         $image->stripImage();
         // restore icc color profile

585) /var/www/src/Image/ImageEdit.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $image->rotateImage('#FFFFFF', $rotateAngle);
         }
         $profiles = $image->getImageProfiles("icc", true);
-        // clear personal data stored in meta information
-        $image->stripImage();
+        
         // restore icc color profile
         if (isset($profiles['icc'])) {
             $image->profileImage("icc", $profiles['icc']);

586) /var/www/src/Image/ImageEdit.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $image->stripImage();
         // restore icc color profile
         if (isset($profiles['icc'])) {
-            $image->profileImage("icc", $profiles['icc']);
+            
         }
         $fs = new Filesystem();
         $fs->dumpFile($output, $image);

587) /var/www/src/Image/ImageEdit.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $image->profileImage("icc", $profiles['icc']);
         }
         $fs = new Filesystem();
-        $fs->dumpFile($output, $image);
+        
     }
     public function getRotateAngle($imagePath) : int
     {

588) /var/www/src/Image/ImageEdit.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $fs = new Filesystem();
         $fs->dumpFile($output, $image);
     }
-    public function getRotateAngle($imagePath) : int
+    protected function getRotateAngle($imagePath) : int
     {
         $exifData = exif_read_data($imagePath);
         if (isset($exifData['Orientation'])) {

589) /var/www/src/Image/ImageEdit.php:44    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $exifData = exif_read_data($imagePath);
         if (isset($exifData['Orientation'])) {
             switch ($exifData['Orientation']) {
-                case 6:
+                case 5:
                     return 90;
                 case 8:
                     return 270;

590) /var/www/src/Image/ImageEdit.php:44    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $exifData = exif_read_data($imagePath);
         if (isset($exifData['Orientation'])) {
             switch ($exifData['Orientation']) {
-                case 6:
+                case 7:
                     return 90;
                 case 8:
                     return 270;

591) /var/www/src/Image/ImageEdit.php:45    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (isset($exifData['Orientation'])) {
             switch ($exifData['Orientation']) {
                 case 6:
-                    return 90;
+                    return 89;
                 case 8:
                     return 270;
             }

592) /var/www/src/Image/ImageEdit.php:45    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (isset($exifData['Orientation'])) {
             switch ($exifData['Orientation']) {
                 case 6:
-                    return 90;
+                    return 91;
                 case 8:
                     return 270;
             }

593) /var/www/src/Image/ImageEdit.php:45    [M] IntegerNegation

--- Original
+++ New
@@ @@
         if (isset($exifData['Orientation'])) {
             switch ($exifData['Orientation']) {
                 case 6:
-                    return 90;
+                    return -90;
                 case 8:
                     return 270;
             }

594) /var/www/src/Image/ImageEdit.php:46    [M] IncrementInteger

--- Original
+++ New
@@ @@
             switch ($exifData['Orientation']) {
                 case 6:
                     return 90;
-                case 8:
+                case 9:
                     return 270;
             }
         }

595) /var/www/src/Image/ImageEdit.php:46    [M] DecrementInteger

--- Original
+++ New
@@ @@
             switch ($exifData['Orientation']) {
                 case 6:
                     return 90;
-                case 8:
+                case 7:
                     return 270;
             }
         }

596) /var/www/src/Image/ImageEdit.php:47    [M] IntegerNegation

--- Original
+++ New
@@ @@
                 case 6:
                     return 90;
                 case 8:
-                    return 270;
+                    return -270;
             }
         }
         return 0;
     }

597) /var/www/src/Image/ImageEdit.php:47    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 case 6:
                     return 90;
                 case 8:
-                    return 270;
+                    return 271;
             }
         }
         return 0;
     }

598) /var/www/src/Image/ImageEdit.php:47    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 case 6:
                     return 90;
                 case 8:
-                    return 270;
+                    return 269;
             }
         }
         return 0;
     }

614) /var/www/src/Kernel.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function configureRoutes(RouteCollectionBuilder $routes) : void
     {
         $confDir = $this->getProjectDir() . '/config';
-        $routes->import($confDir . '/{routes}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, '/', 'glob');
+        
         $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');
         $routes->import($confDir . '/{routes}' . self::CONFIG_EXTS, '/', 'glob');
     }
 }

615) /var/www/src/Kernel.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $confDir = $this->getProjectDir() . '/config';
         $routes->import($confDir . '/{routes}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, '/', 'glob');
-        $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');
+        
         $routes->import($confDir . '/{routes}' . self::CONFIG_EXTS, '/', 'glob');
     }
 }

617) /var/www/src/Repository/PlaceRepository.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Filter points by coordinates
      */
-    public function andWhereInCoordinates(QueryBuilder $qb, array $skipPoints, float $neLat, float $swLat, float $neLon, float $swLon) : self
+    protected function andWhereInCoordinates(QueryBuilder $qb, array $skipPoints, float $neLat, float $swLat, float $neLon, float $swLon) : self
     {
         $alias = $qb->getRootAliases()[0];
         $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.lat', $neLat), $qb->expr()->gte($alias . '.lat', $swLat), $qb->expr()->lte($alias . '.lng', $neLon), $qb->expr()->gte($alias . '.lng', $swLon)));

618) /var/www/src/Repository/PlaceRepository.php:15    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     public function andWhereInCoordinates(QueryBuilder $qb, array $skipPoints, float $neLat, float $swLat, float $neLon, float $swLon) : self
     {
-        $alias = $qb->getRootAliases()[0];
+        $alias = $qb->getRootAliases()[-1];
         $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.lat', $neLat), $qb->expr()->gte($alias . '.lat', $swLat), $qb->expr()->lte($alias . '.lng', $neLon), $qb->expr()->gte($alias . '.lng', $swLon)));
         if (!empty($skipPoints)) {
             $qb->andWhere($qb->expr()->notIn($alias . '.id', $skipPoints));

619) /var/www/src/Repository/PlaceRepository.php:15    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
     public function andWhereInCoordinates(QueryBuilder $qb, array $skipPoints, float $neLat, float $swLat, float $neLon, float $swLon) : self
     {
-        $alias = $qb->getRootAliases()[0];
+        $alias = $qb->getRootAliases()[1];
         $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.lat', $neLat), $qb->expr()->gte($alias . '.lat', $swLat), $qb->expr()->lte($alias . '.lng', $neLon), $qb->expr()->gte($alias . '.lng', $swLon)));
         if (!empty($skipPoints)) {
             $qb->andWhere($qb->expr()->notIn($alias . '.id', $skipPoints));

620) /var/www/src/Repository/PlaceRepository.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function andWhereInCoordinates(QueryBuilder $qb, array $skipPoints, float $neLat, float $swLat, float $neLon, float $swLon) : self
     {
         $alias = $qb->getRootAliases()[0];
-        $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.lat', $neLat), $qb->expr()->gte($alias . '.lat', $swLat), $qb->expr()->lte($alias . '.lng', $neLon), $qb->expr()->gte($alias . '.lng', $swLon)));
+        
         if (!empty($skipPoints)) {
             $qb->andWhere($qb->expr()->notIn($alias . '.id', $skipPoints));
         }

621) /var/www/src/Repository/PlaceRepository.php:26    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $alias = $qb->getRootAliases()[0];
         $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.lat', $neLat), $qb->expr()->gte($alias . '.lat', $swLat), $qb->expr()->lte($alias . '.lng', $neLon), $qb->expr()->gte($alias . '.lng', $swLon)));
-        if (!empty($skipPoints)) {
+        if (empty($skipPoints)) {
             $qb->andWhere($qb->expr()->notIn($alias . '.id', $skipPoints));
         }
         return $this;
     }

622) /var/www/src/Repository/PlaceRepository.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $alias = $qb->getRootAliases()[0];
         $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.lat', $neLat), $qb->expr()->gte($alias . '.lat', $swLat), $qb->expr()->lte($alias . '.lng', $neLon), $qb->expr()->gte($alias . '.lng', $swLon)));
         if (!empty($skipPoints)) {
-            $qb->andWhere($qb->expr()->notIn($alias . '.id', $skipPoints));
+            
         }
         return $this;
     }
 }

623) /var/www/src/Repository/Track/ImageRepository.php:9    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Doctrine\ORM\EntityRepository;
 class ImageRepository extends EntityRepository
 {
-    public function getLatestImages(int $limit = 10)
+    protected function getLatestImages(int $limit = 10)
     {
         $qb = $this->createQueryBuilder('i');
         $qb->setMaxResults($limit);

624) /var/www/src/Repository/Track/ImageRepository.php:9    [M] IncrementInteger

--- Original
+++ New
@@ @@
 use Doctrine\ORM\EntityRepository;
 class ImageRepository extends EntityRepository
 {
-    public function getLatestImages(int $limit = 10)
+    public function getLatestImages(int $limit = 11)
     {
         $qb = $this->createQueryBuilder('i');
         $qb->setMaxResults($limit);

625) /var/www/src/Repository/Track/ImageRepository.php:9    [M] DecrementInteger

--- Original
+++ New
@@ @@
 use Doctrine\ORM\EntityRepository;
 class ImageRepository extends EntityRepository
 {
-    public function getLatestImages(int $limit = 10)
+    public function getLatestImages(int $limit = 9)
     {
         $qb = $this->createQueryBuilder('i');
         $qb->setMaxResults($limit);

626) /var/www/src/Repository/Track/ImageRepository.php:12    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function getLatestImages(int $limit = 10)
     {
         $qb = $this->createQueryBuilder('i');
-        $qb->setMaxResults($limit);
+        
         $qb->addOrderBy('i.createdAt', 'DESC');
         return $qb->getQuery()->getResult();
     }
 }

627) /var/www/src/Repository/Track/ImageRepository.php:13    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $qb = $this->createQueryBuilder('i');
         $qb->setMaxResults($limit);
-        $qb->addOrderBy('i.createdAt', 'DESC');
+        
         return $qb->getQuery()->getResult();
     }
 }

628) /var/www/src/Repository/TrackRepository.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Apply filter to return only public tracks
      */
-    public function andWhereTrackIsPublic(QueryBuilder $qb) : self
+    protected function andWhereTrackIsPublic(QueryBuilder $qb) : self
     {
         $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.visibility', Track::VISIBILITY_PUBLIC));
         return $this;

629) /var/www/src/Repository/TrackRepository.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function andWhereTrackIsPublic(QueryBuilder $qb) : self
     {
-        $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.visibility', Track::VISIBILITY_PUBLIC));
+        
         return $this;
     }
     /**

630) /var/www/src/Repository/TrackRepository.php:17    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
     public function andWhereTrackIsPublic(QueryBuilder $qb) : self
     {
-        $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.visibility', Track::VISIBILITY_PUBLIC));
+        $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[1] . '.visibility', Track::VISIBILITY_PUBLIC));
         return $this;
     }
     /**

631) /var/www/src/Repository/TrackRepository.php:17    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     public function andWhereTrackIsPublic(QueryBuilder $qb) : self
     {
-        $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.visibility', Track::VISIBILITY_PUBLIC));
+        $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[-1] . '.visibility', Track::VISIBILITY_PUBLIC));
         return $this;
     }
     /**

632) /var/www/src/Repository/TrackRepository.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Filter tracks by coordinates
      */
-    public function andWhereInCoordinates(QueryBuilder $qb, array $skipTracks, float $neLat, float $swLat, float $neLon, float $swLon) : self
+    protected function andWhereInCoordinates(QueryBuilder $qb, array $skipTracks, float $neLat, float $swLat, float $neLon, float $swLon) : self
     {
         $alias = $qb->getRootAliases()[0];
         $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.pointNorthEastLat', $neLat), $qb->expr()->gte($alias . '.pointSouthWestLat', $swLat), $qb->expr()->lte($alias . '.pointNorthEastLng', $neLon), $qb->expr()->gte($alias . '.pointSouthWestLng', $swLon)));

635) /var/www/src/Repository/TrackRepository.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function andWhereInCoordinates(QueryBuilder $qb, array $skipTracks, float $neLat, float $swLat, float $neLon, float $swLon) : self
     {
         $alias = $qb->getRootAliases()[0];
-        $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.pointNorthEastLat', $neLat), $qb->expr()->gte($alias . '.pointSouthWestLat', $swLat), $qb->expr()->lte($alias . '.pointNorthEastLng', $neLon), $qb->expr()->gte($alias . '.pointSouthWestLng', $swLon)));
+        
         if (!empty($skipTracks)) {
             $qb->andWhere($qb->expr()->notIn($alias . '.id', $skipTracks));
         }

636) /var/www/src/Repository/TrackRepository.php:39    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $alias = $qb->getRootAliases()[0];
         $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.pointNorthEastLat', $neLat), $qb->expr()->gte($alias . '.pointSouthWestLat', $swLat), $qb->expr()->lte($alias . '.pointNorthEastLng', $neLon), $qb->expr()->gte($alias . '.pointSouthWestLng', $swLon)));
-        if (!empty($skipTracks)) {
+        if (empty($skipTracks)) {
             $qb->andWhere($qb->expr()->notIn($alias . '.id', $skipTracks));
         }
         return $this;

637) /var/www/src/Repository/TrackRepository.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $alias = $qb->getRootAliases()[0];
         $qb->andWhere($qb->expr()->andX($qb->expr()->lte($alias . '.pointNorthEastLat', $neLat), $qb->expr()->gte($alias . '.pointSouthWestLat', $swLat), $qb->expr()->lte($alias . '.pointNorthEastLng', $neLon), $qb->expr()->gte($alias . '.pointSouthWestLng', $swLon)));
         if (!empty($skipTracks)) {
-            $qb->andWhere($qb->expr()->notIn($alias . '.id', $skipTracks));
+            
         }
         return $this;
     }

638) /var/www/src/Repository/TrackRepository.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Used in the index page
      */
-    public function findLatestTrackTypes() : array
+    protected function findLatestTrackTypes() : array
     {
         $data = [];
         foreach (Track::VALID_TYPES as $type) {

639) /var/www/src/Repository/TrackRepository.php:55    [M] Foreach_

--- Original
+++ New
@@ @@
     public function findLatestTrackTypes() : array
     {
         $data = [];
-        foreach (Track::VALID_TYPES as $type) {
+        foreach (array() as $type) {
             $qb = $this->createQueryBuilder('t');
             $this->andWhereTrackIsPublic($qb);
             $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.type', $type));

640) /var/www/src/Repository/TrackRepository.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $data = [];
         foreach (Track::VALID_TYPES as $type) {
             $qb = $this->createQueryBuilder('t');
-            $this->andWhereTrackIsPublic($qb);
+            
             $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.type', $type));
             $data[$type] = $qb->orderBy('t.createdAt', 'desc')->setMaxResults(10)->getQuery()->getResult();
         }

641) /var/www/src/Repository/TrackRepository.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach (Track::VALID_TYPES as $type) {
             $qb = $this->createQueryBuilder('t');
             $this->andWhereTrackIsPublic($qb);
-            $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.type', $type));
+            
             $data[$type] = $qb->orderBy('t.createdAt', 'desc')->setMaxResults(10)->getQuery()->getResult();
         }
         return $data;

642) /var/www/src/Repository/TrackRepository.php:61    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         foreach (Track::VALID_TYPES as $type) {
             $qb = $this->createQueryBuilder('t');
             $this->andWhereTrackIsPublic($qb);
-            $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.type', $type));
+            $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[1] . '.type', $type));
             $data[$type] = $qb->orderBy('t.createdAt', 'desc')->setMaxResults(10)->getQuery()->getResult();
         }
         return $data;

643) /var/www/src/Repository/TrackRepository.php:61    [M] DecrementInteger

--- Original
+++ New
@@ @@
         foreach (Track::VALID_TYPES as $type) {
             $qb = $this->createQueryBuilder('t');
             $this->andWhereTrackIsPublic($qb);
-            $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.type', $type));
+            $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[-1] . '.type', $type));
             $data[$type] = $qb->orderBy('t.createdAt', 'desc')->setMaxResults(10)->getQuery()->getResult();
         }
         return $data;

644) /var/www/src/Repository/TrackRepository.php:66    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $qb = $this->createQueryBuilder('t');
             $this->andWhereTrackIsPublic($qb);
             $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.type', $type));
-            $data[$type] = $qb->orderBy('t.createdAt', 'desc')->setMaxResults(10)->getQuery()->getResult();
+            $data[$type] = $qb->orderBy('t.createdAt', 'desc')->setMaxResults(9)->getQuery()->getResult();
         }
         return $data;
     }

645) /var/www/src/Repository/TrackRepository.php:66    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $qb = $this->createQueryBuilder('t');
             $this->andWhereTrackIsPublic($qb);
             $qb->andWhere($qb->expr()->eq($qb->getRootAliases()[0] . '.type', $type));
-            $data[$type] = $qb->orderBy('t.createdAt', 'desc')->setMaxResults(10)->getQuery()->getResult();
+            $data[$type] = $qb->orderBy('t.createdAt', 'desc')->setMaxResults(11)->getQuery()->getResult();
         }
         return $data;
     }

647) /var/www/src/Repository/TrackRepository.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $data;
     }
-    public function findByIdOrSlug(string $name) : ?Track
+    protected function findByIdOrSlug(string $name) : ?Track
     {
         $byId = $this->findOneBy(['id' => $name]);
         if ($byId) {

648) /var/www/src/Repository/TrackRepository.php:76    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function findByIdOrSlug(string $name) : ?Track
     {
-        $byId = $this->findOneBy(['id' => $name]);
+        $byId = $this->findOneBy([]);
         if ($byId) {
             return $byId;
         }

649) /var/www/src/Repository/TrackRepository.php:82    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return $byId;
         }
         $slugRepo = $this->getEntityManager()->getRepository(Track\Slug::class);
-        $bySlug = $slugRepo->findOneBy(['slug' => $name]);
+        $bySlug = $slugRepo->findOneBy([]);
         if ($bySlug) {
             return $bySlug->getTrack();
         }

690) /var/www/src/Track/Exporter.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class Exporter
 {
     public const FORMAT_GPX = 'gpx';
-    public function export(iterable $versions, string $format) : string
+    protected function export(iterable $versions, string $format) : string
     {
         switch ($format) {
             case self::FORMAT_GPX:

691) /var/www/src/Track/Exporter.php:18    [M] Throw_

--- Original
+++ New
@@ @@
                 $result = $this->exportGpx($versions);
                 break;
             default:
-                throw new \RuntimeException('Unknown format');
+                new \RuntimeException('Unknown format');
         }
         return $result;
     }

692) /var/www/src/Track/Exporter.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param iterable|Version[] $versionCollection
      */
-    public function exportGpx(iterable $versionCollection) : string
+    protected function exportGpx(iterable $versionCollection) : string
     {
         $xml = new \SimpleXMLElement('<gpx/>');
         $xml->addAttribute('version', '1.1');

693) /var/www/src/Track/Exporter.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function exportGpx(iterable $versionCollection) : string
     {
         $xml = new \SimpleXMLElement('<gpx/>');
-        $xml->addAttribute('version', '1.1');
+        
         $xml->addAttribute('creator', 'track-hub.com: http://track-hub.com/');
         foreach ($versionCollection as $version) {
             $trkXml = $xml->addChild('trk');

694) /var/www/src/Track/Exporter.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $xml = new \SimpleXMLElement('<gpx/>');
         $xml->addAttribute('version', '1.1');
-        $xml->addAttribute('creator', 'track-hub.com: http://track-hub.com/');
+        
         foreach ($versionCollection as $version) {
             $trkXml = $xml->addChild('trk');
             $trkXml->addChild('name', $version->getTrack()->getNameEn());

695) /var/www/src/Track/Exporter.php:33    [M] Foreach_

--- Original
+++ New
@@ @@
         $xml = new \SimpleXMLElement('<gpx/>');
         $xml->addAttribute('version', '1.1');
         $xml->addAttribute('creator', 'track-hub.com: http://track-hub.com/');
-        foreach ($versionCollection as $version) {
+        foreach (array() as $version) {
             $trkXml = $xml->addChild('trk');
             $trkXml->addChild('name', $version->getTrack()->getNameEn());
             $trkSegXSml = $trkXml->addChild('trkseg');

696) /var/www/src/Track/Exporter.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $xml->addAttribute('creator', 'track-hub.com: http://track-hub.com/');
         foreach ($versionCollection as $version) {
             $trkXml = $xml->addChild('trk');
-            $trkXml->addChild('name', $version->getTrack()->getNameEn());
+            
             $trkSegXSml = $trkXml->addChild('trkseg');
             foreach ($version->getPoints() as $point) {
                 $trkSegPointXml = $trkSegXSml->addChild('trkpt');

697) /var/www/src/Track/Exporter.php:39    [M] Foreach_

--- Original
+++ New
@@ @@
             $trkXml = $xml->addChild('trk');
             $trkXml->addChild('name', $version->getTrack()->getNameEn());
             $trkSegXSml = $trkXml->addChild('trkseg');
-            foreach ($version->getPoints() as $point) {
+            foreach (array() as $point) {
                 $trkSegPointXml = $trkSegXSml->addChild('trkpt');
                 $trkSegPointXml->addAttribute('lat', $point->getLat());
                 $trkSegPointXml->addAttribute('lon', $point->getLng());

698) /var/www/src/Track/Exporter.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $trkSegXSml = $trkXml->addChild('trkseg');
             foreach ($version->getPoints() as $point) {
                 $trkSegPointXml = $trkSegXSml->addChild('trkpt');
-                $trkSegPointXml->addAttribute('lat', $point->getLat());
+                
                 $trkSegPointXml->addAttribute('lon', $point->getLng());
                 if ($point->getElevation()) {
                     $trkSegPointXml->addChild('ele', $point->getElevation());

699) /var/www/src/Track/Exporter.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             foreach ($version->getPoints() as $point) {
                 $trkSegPointXml = $trkSegXSml->addChild('trkpt');
                 $trkSegPointXml->addAttribute('lat', $point->getLat());
-                $trkSegPointXml->addAttribute('lon', $point->getLng());
+                
                 if ($point->getElevation()) {
                     $trkSegPointXml->addChild('ele', $point->getElevation());
                 }

700) /var/www/src/Track/Exporter.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $trkSegPointXml->addAttribute('lat', $point->getLat());
                 $trkSegPointXml->addAttribute('lon', $point->getLng());
                 if ($point->getElevation()) {
-                    $trkSegPointXml->addChild('ele', $point->getElevation());
+                    
                 }
             }
             foreach ($version->getWayPoints() as $wayPoint) {

701) /var/www/src/Track/Exporter.php:48    [M] Foreach_

--- Original
+++ New
@@ @@
                     $trkSegPointXml->addChild('ele', $point->getElevation());
                 }
             }
-            foreach ($version->getWayPoints() as $wayPoint) {
+            foreach (array() as $wayPoint) {
                 $wayPointXml = $xml->addChild('wpt');
                 $wayPointXml->addAttribute('lat', $wayPoint->getLat());
                 $wayPointXml->addAttribute('lon', $wayPoint->getLng());

702) /var/www/src/Track/Exporter.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             foreach ($version->getWayPoints() as $wayPoint) {
                 $wayPointXml = $xml->addChild('wpt');
-                $wayPointXml->addAttribute('lat', $wayPoint->getLat());
+                
                 $wayPointXml->addAttribute('lon', $wayPoint->getLng());
                 $wayPointXml->addChild('name', $wayPointXml->getName());
             }

703) /var/www/src/Track/Exporter.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             foreach ($version->getWayPoints() as $wayPoint) {
                 $wayPointXml = $xml->addChild('wpt');
                 $wayPointXml->addAttribute('lat', $wayPoint->getLat());
-                $wayPointXml->addAttribute('lon', $wayPoint->getLng());
+                
                 $wayPointXml->addChild('name', $wayPointXml->getName());
             }
         }

704) /var/www/src/Track/Exporter.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $wayPointXml = $xml->addChild('wpt');
                 $wayPointXml->addAttribute('lat', $wayPoint->getLat());
                 $wayPointXml->addAttribute('lon', $wayPoint->getLng());
-                $wayPointXml->addChild('name', $wayPointXml->getName());
+                
             }
         }
         $stringResult = $xml->asXML();

705) /var/www/src/Track/Exporter.php:57    [M] FalseValue

--- Original
+++ New
@@ @@
             }
         }
         $stringResult = $xml->asXML();
-        if ($stringResult === false) {
+        if ($stringResult === true) {
             throw new \RuntimeException('XML generation failed');
         }
         return $stringResult;
     }

706) /var/www/src/Track/Exporter.php:57    [M] Identical

--- Original
+++ New
@@ @@
             }
         }
         $stringResult = $xml->asXML();
-        if ($stringResult === false) {
+        if ($stringResult !== false) {
             throw new \RuntimeException('XML generation failed');
         }
         return $stringResult;
     }
