707) /var/www/src/Track/Exporter.php:58    [M] Throw_

--- Original
+++ New
@@ @@
         }
         $stringResult = $xml->asXML();
         if ($stringResult === false) {
-            throw new \RuntimeException('XML generation failed');
+            new \RuntimeException('XML generation failed');
         }
         return $stringResult;
     }
 }

708) /var/www/src/Track/Processor.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @var TwoPointsChecker\PointCheckerInterface[]
      */
     private $twoPointsCheckers = [];
-    public function addTwoPointsChecker(TwoPointsChecker\PointCheckerInterface $checker)
+    protected function addTwoPointsChecker(TwoPointsChecker\PointCheckerInterface $checker)
     {
         $this->twoPointsCheckers[] = $checker;
     }

709) /var/www/src/Track/Processor.php:25    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function isPointReal(Point $pointA, Point $pointB) : bool
     {
         foreach ($this->twoPointsCheckers as $singlePointChecker) {
-            if (!$singlePointChecker->isReal($pointA, $pointB)) {
+            if ($singlePointChecker->isReal($pointA, $pointB)) {
                 return false;
             }
         }

710) /var/www/src/Track/Processor.php:26    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         foreach ($this->twoPointsCheckers as $singlePointChecker) {
             if (!$singlePointChecker->isReal($pointA, $pointB)) {
-                return false;
+                return true;
             }
         }
         return true;

711) /var/www/src/Track/Processor.php:39    [M] Throw_

--- Original
+++ New
@@ @@
         $version->getPoints()->clear();
         $xml = simplexml_load_string($source);
         if ($xml === false) {
-            throw new \RuntimeException("Xml load failed");
+            new \RuntimeException("Xml load failed");
         }
         if ($xml->getName() != "gpx") {
             throw new \RuntimeException("Xml invalid format");

713) /var/www/src/Track/Processor.php:156    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param Version $version
      * @return OptimizedPoint[]
      */
-    public function generateOptimizedPoints(Version $version)
+    protected function generateOptimizedPoints(Version $version)
     {
         $optimizedPointLat = 0;
         $optimizedPointLon = 0;

714) /var/www/src/Track/Processor.php:158    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
     public function generateOptimizedPoints(Version $version)
     {
-        $optimizedPointLat = 0;
+        $optimizedPointLat = 1;
         $optimizedPointLon = 0;
         $order = 0;
         $optimizedPointCollection = [];

715) /var/www/src/Track/Processor.php:158    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     public function generateOptimizedPoints(Version $version)
     {
-        $optimizedPointLat = 0;
+        $optimizedPointLat = -1;
         $optimizedPointLon = 0;
         $order = 0;
         $optimizedPointCollection = [];

716) /var/www/src/Track/Processor.php:159    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function generateOptimizedPoints(Version $version)
     {
         $optimizedPointLat = 0;
-        $optimizedPointLon = 0;
+        $optimizedPointLon = 1;
         $order = 0;
         $optimizedPointCollection = [];
         foreach ($version->getPoints() as $point) {

717) /var/www/src/Track/Processor.php:159    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function generateOptimizedPoints(Version $version)
     {
         $optimizedPointLat = 0;
-        $optimizedPointLon = 0;
+        $optimizedPointLon = -1;
         $order = 0;
         $optimizedPointCollection = [];
         foreach ($version->getPoints() as $point) {

718) /var/www/src/Track/Processor.php:161    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $optimizedPointLat = 0;
         $optimizedPointLon = 0;
-        $order = 0;
+        $order = -1;
         $optimizedPointCollection = [];
         foreach ($version->getPoints() as $point) {
             $latDiff = $optimizedPointLat - $point->getLat();

719) /var/www/src/Track/Processor.php:161    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
         $optimizedPointLat = 0;
         $optimizedPointLon = 0;
-        $order = 0;
+        $order = 1;
         $optimizedPointCollection = [];
         foreach ($version->getPoints() as $point) {
             $latDiff = $optimizedPointLat - $point->getLat();

720) /var/www/src/Track/Processor.php:165    [M] Foreach_

--- Original
+++ New
@@ @@
         $optimizedPointLon = 0;
         $order = 0;
         $optimizedPointCollection = [];
-        foreach ($version->getPoints() as $point) {
+        foreach (array() as $point) {
             $latDiff = $optimizedPointLat - $point->getLat();
             $lonDiff = $optimizedPointLon - $point->getLng();
             $diff = abs($latDiff) + abs($lonDiff);

721) /var/www/src/Track/Processor.php:166    [M] Minus

--- Original
+++ New
@@ @@
         $order = 0;
         $optimizedPointCollection = [];
         foreach ($version->getPoints() as $point) {
-            $latDiff = $optimizedPointLat - $point->getLat();
+            $latDiff = $optimizedPointLat + $point->getLat();
             $lonDiff = $optimizedPointLon - $point->getLng();
             $diff = abs($latDiff) + abs($lonDiff);
             if ($diff > 0.002) {

722) /var/www/src/Track/Processor.php:167    [M] Minus

--- Original
+++ New
@@ @@
         $optimizedPointCollection = [];
         foreach ($version->getPoints() as $point) {
             $latDiff = $optimizedPointLat - $point->getLat();
-            $lonDiff = $optimizedPointLon - $point->getLng();
+            $lonDiff = $optimizedPointLon + $point->getLng();
             $diff = abs($latDiff) + abs($lonDiff);
             if ($diff > 0.002) {
                 $optimizedPointLat = $point->getLat();

723) /var/www/src/Track/Processor.php:168    [M] Plus

--- Original
+++ New
@@ @@
         foreach ($version->getPoints() as $point) {
             $latDiff = $optimizedPointLat - $point->getLat();
             $lonDiff = $optimizedPointLon - $point->getLng();
-            $diff = abs($latDiff) + abs($lonDiff);
+            $diff = abs($latDiff) - abs($lonDiff);
             if ($diff > 0.002) {
                 $optimizedPointLat = $point->getLat();
                 $optimizedPointLon = $point->getLng();

724) /var/www/src/Track/Processor.php:169    [M] GreaterThan

--- Original
+++ New
@@ @@
             $latDiff = $optimizedPointLat - $point->getLat();
             $lonDiff = $optimizedPointLon - $point->getLng();
             $diff = abs($latDiff) + abs($lonDiff);
-            if ($diff > 0.002) {
+            if ($diff >= 0.002) {
                 $optimizedPointLat = $point->getLat();
                 $optimizedPointLon = $point->getLng();
                 $optimizedPoint = new OptimizedPoint($order, $point->getLat(), $point->getLng());

725) /var/www/src/Track/Processor.php:169    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
             $latDiff = $optimizedPointLat - $point->getLat();
             $lonDiff = $optimizedPointLon - $point->getLng();
             $diff = abs($latDiff) + abs($lonDiff);
-            if ($diff > 0.002) {
+            if ($diff <= 0.002) {
                 $optimizedPointLat = $point->getLat();
                 $optimizedPointLon = $point->getLng();
                 $optimizedPoint = new OptimizedPoint($order, $point->getLat(), $point->getLng());

726) /var/www/src/Track/Processor.php:181    [M] Increment

--- Original
+++ New
@@ @@
                 $optimizedPoint = new OptimizedPoint($order, $point->getLat(), $point->getLng());
                 $optimizedPointCollection[] = $optimizedPoint;
             }
-            $order++;
+            $order--;
         }
         return $optimizedPointCollection;
     }

727) /var/www/src/Track/Processor.php:187    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $optimizedPointCollection;
     }
-    public function postProcess(Track $track)
+    protected function postProcess(Track $track)
     {
         $track->recalculateEdgesCache();
     }

728) /var/www/src/Track/Processor.php:189    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function postProcess(Track $track)
     {
-        $track->recalculateEdgesCache();
+        
     }
     public function generateElevationLables(iterable $pointCollection, int $pointsCount)
     {

729) /var/www/src/Track/Processor.php:192    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $track->recalculateEdgesCache();
     }
-    public function generateElevationLables(iterable $pointCollection, int $pointsCount)
+    protected function generateElevationLables(iterable $pointCollection, int $pointsCount)
     {
         $longestDistance = 0;
         $labels = [];

730) /var/www/src/Track/Processor.php:194    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function generateElevationLables(iterable $pointCollection, int $pointsCount)
     {
-        $longestDistance = 0;
+        $longestDistance = -1;
         $labels = [];
         foreach ($pointCollection as $points) {
             $lastPoint = end($points);

731) /var/www/src/Track/Processor.php:194    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     }
     public function generateElevationLables(iterable $pointCollection, int $pointsCount)
     {
-        $longestDistance = 0;
+        $longestDistance = 1;
         $labels = [];
         foreach ($pointCollection as $points) {
             $lastPoint = end($points);

732) /var/www/src/Track/Processor.php:197    [M] Foreach_

--- Original
+++ New
@@ @@
     {
         $longestDistance = 0;
         $labels = [];
-        foreach ($pointCollection as $points) {
+        foreach (array() as $points) {
             $lastPoint = end($points);
             if ($lastPoint->getDistance() > $longestDistance) {
                 $longestDistance = $lastPoint->getDistance();

733) /var/www/src/Track/Processor.php:199    [M] GreaterThan

--- Original
+++ New
@@ @@
         $labels = [];
         foreach ($pointCollection as $points) {
             $lastPoint = end($points);
-            if ($lastPoint->getDistance() > $longestDistance) {
+            if ($lastPoint->getDistance() >= $longestDistance) {
                 $longestDistance = $lastPoint->getDistance();
             }
         }

734) /var/www/src/Track/Processor.php:199    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         $labels = [];
         foreach ($pointCollection as $points) {
             $lastPoint = end($points);
-            if ($lastPoint->getDistance() > $longestDistance) {
+            if ($lastPoint->getDistance() <= $longestDistance) {
                 $longestDistance = $lastPoint->getDistance();
             }
         }

735) /var/www/src/Track/Processor.php:204    [M] Division

--- Original
+++ New
@@ @@
                 $longestDistance = $lastPoint->getDistance();
             }
         }
-        $labelDistance = $longestDistance / $pointsCount;
+        $labelDistance = $longestDistance * $pointsCount;
         for ($q = 0; $q < $pointsCount; $q++) {
             $labels[] = $labelDistance * $q;
         }

736) /var/www/src/Track/Processor.php:205    [M] For_

--- Original
+++ New
@@ @@
             }
         }
         $labelDistance = $longestDistance / $pointsCount;
-        for ($q = 0; $q < $pointsCount; $q++) {
+        for ($q = 0; false; $q++) {
             $labels[] = $labelDistance * $q;
         }
         return $labels;

737) /var/www/src/Track/Processor.php:205    [M] DecrementInteger

--- Original
+++ New
@@ @@
             }
         }
         $labelDistance = $longestDistance / $pointsCount;
-        for ($q = 0; $q < $pointsCount; $q++) {
+        for ($q = -1; $q < $pointsCount; $q++) {
             $labels[] = $labelDistance * $q;
         }
         return $labels;

738) /var/www/src/Track/Processor.php:205    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             }
         }
         $labelDistance = $longestDistance / $pointsCount;
-        for ($q = 0; $q < $pointsCount; $q++) {
+        for ($q = 1; $q < $pointsCount; $q++) {
             $labels[] = $labelDistance * $q;
         }
         return $labels;

739) /var/www/src/Track/Processor.php:205    [M] LessThan

--- Original
+++ New
@@ @@
             }
         }
         $labelDistance = $longestDistance / $pointsCount;
-        for ($q = 0; $q < $pointsCount; $q++) {
+        for ($q = 0; $q <= $pointsCount; $q++) {
             $labels[] = $labelDistance * $q;
         }
         return $labels;

740) /var/www/src/Track/Processor.php:205    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             }
         }
         $labelDistance = $longestDistance / $pointsCount;
-        for ($q = 0; $q < $pointsCount; $q++) {
+        for ($q = 0; $q >= $pointsCount; $q++) {
             $labels[] = $labelDistance * $q;
         }
         return $labels;

741) /var/www/src/Track/Processor.php:205    [M] Increment

--- Original
+++ New
@@ @@
             }
         }
         $labelDistance = $longestDistance / $pointsCount;
-        for ($q = 0; $q < $pointsCount; $q++) {
+        for ($q = 0; $q < $pointsCount; $q--) {
             $labels[] = $labelDistance * $q;
         }
         return $labels;

742) /var/www/src/Track/Processor.php:206    [M] Multiplication

--- Original
+++ New
@@ @@
         }
         $labelDistance = $longestDistance / $pointsCount;
         for ($q = 0; $q < $pointsCount; $q++) {
-            $labels[] = $labelDistance * $q;
+            $labels[] = $labelDistance / $q;
         }
         return $labels;
     }

743) /var/www/src/Track/Processor.php:218    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return array
      */
-    public function generateElevationData(iterable $pointCollection, iterable $labels) : array
+    protected function generateElevationData(iterable $pointCollection, iterable $labels) : array
     {
         $return = [];
         foreach ($pointCollection as $item) {

744) /var/www/src/Track/Processor.php:222    [M] Foreach_

--- Original
+++ New
@@ @@
     public function generateElevationData(iterable $pointCollection, iterable $labels) : array
     {
         $return = [];
-        foreach ($pointCollection as $item) {
+        foreach (array() as $item) {
             reset($item);
             $return[] = [];
         }

745) /var/www/src/Track/Processor.php:223    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     {
         $return = [];
         foreach ($pointCollection as $item) {
-            reset($item);
+            
             $return[] = [];
         }
         $collectionsCount = count($pointCollection);

746) /var/www/src/Track/Processor.php:229    [M] Foreach_

--- Original
+++ New
@@ @@
             $return[] = [];
         }
         $collectionsCount = count($pointCollection);
-        foreach ($labels as $labelIndex => $labelDistance) {
+        foreach (array() as $labelIndex => $labelDistance) {
             $lastKnownElevation = null;
             for ($q = 0; $q < $collectionsCount; $q++) {
                 $currentPoint = current($pointCollection[$q]);

747) /var/www/src/Track/Processor.php:231    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $collectionsCount = count($pointCollection);
         foreach ($labels as $labelIndex => $labelDistance) {
             $lastKnownElevation = null;
-            for ($q = 0; $q < $collectionsCount; $q++) {
+            for ($q = 1; $q < $collectionsCount; $q++) {
                 $currentPoint = current($pointCollection[$q]);
                 if ($currentPoint === false) {
                     continue;

748) /var/www/src/Track/Processor.php:231    [M] For_

--- Original
+++ New
@@ @@
         $collectionsCount = count($pointCollection);
         foreach ($labels as $labelIndex => $labelDistance) {
             $lastKnownElevation = null;
-            for ($q = 0; $q < $collectionsCount; $q++) {
+            for ($q = 0; false; $q++) {
                 $currentPoint = current($pointCollection[$q]);
                 if ($currentPoint === false) {
                     continue;

749) /var/www/src/Track/Processor.php:231    [M] LessThan

--- Original
+++ New
@@ @@
         $collectionsCount = count($pointCollection);
         foreach ($labels as $labelIndex => $labelDistance) {
             $lastKnownElevation = null;
-            for ($q = 0; $q < $collectionsCount; $q++) {
+            for ($q = 0; $q <= $collectionsCount; $q++) {
                 $currentPoint = current($pointCollection[$q]);
                 if ($currentPoint === false) {
                     continue;

750) /var/www/src/Track/Processor.php:231    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $collectionsCount = count($pointCollection);
         foreach ($labels as $labelIndex => $labelDistance) {
             $lastKnownElevation = null;
-            for ($q = 0; $q < $collectionsCount; $q++) {
+            for ($q = -1; $q < $collectionsCount; $q++) {
                 $currentPoint = current($pointCollection[$q]);
                 if ($currentPoint === false) {
                     continue;

751) /var/www/src/Track/Processor.php:231    [M] Increment

--- Original
+++ New
@@ @@
         $collectionsCount = count($pointCollection);
         foreach ($labels as $labelIndex => $labelDistance) {
             $lastKnownElevation = null;
-            for ($q = 0; $q < $collectionsCount; $q++) {
+            for ($q = 0; $q < $collectionsCount; $q--) {
                 $currentPoint = current($pointCollection[$q]);
                 if ($currentPoint === false) {
                     continue;

752) /var/www/src/Track/Processor.php:231    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
         $collectionsCount = count($pointCollection);
         foreach ($labels as $labelIndex => $labelDistance) {
             $lastKnownElevation = null;
-            for ($q = 0; $q < $collectionsCount; $q++) {
+            for ($q = 0; $q >= $collectionsCount; $q++) {
                 $currentPoint = current($pointCollection[$q]);
                 if ($currentPoint === false) {
                     continue;

753) /var/www/src/Track/Processor.php:234    [M] FalseValue

--- Original
+++ New
@@ @@
             $lastKnownElevation = null;
             for ($q = 0; $q < $collectionsCount; $q++) {
                 $currentPoint = current($pointCollection[$q]);
-                if ($currentPoint === false) {
+                if ($currentPoint === true) {
                     continue;
                 }
                 if ($currentPoint->getElevation()) {

754) /var/www/src/Track/Processor.php:234    [M] Identical

--- Original
+++ New
@@ @@
             $lastKnownElevation = null;
             for ($q = 0; $q < $collectionsCount; $q++) {
                 $currentPoint = current($pointCollection[$q]);
-                if ($currentPoint === false) {
+                if ($currentPoint !== false) {
                     continue;
                 }
                 if ($currentPoint->getElevation()) {

755) /var/www/src/Track/Processor.php:235    [M] Continue_

--- Original
+++ New
@@ @@
             for ($q = 0; $q < $collectionsCount; $q++) {
                 $currentPoint = current($pointCollection[$q]);
                 if ($currentPoint === false) {
-                    continue;
+                    break;
                 }
                 if ($currentPoint->getElevation()) {
                     $lastKnownElevation = $currentPoint->getElevation();

756) /var/www/src/Track/Processor.php:243    [M] LogicalAnd

--- Original
+++ New
@@ @@
                     $lastKnownElevation = $currentPoint->getElevation();
                 }
                 // case: skip point
-                while ($currentPoint && $currentPoint->getDistance() < $labelDistance) {
+                while ($currentPoint || $currentPoint->getDistance() < $labelDistance) {
                     $currentPoint = next($pointCollection[$q]);
                     if ($currentPoint === false) {
                         break;

757) /var/www/src/Track/Processor.php:243    [M] LessThan

--- Original
+++ New
@@ @@
                     $lastKnownElevation = $currentPoint->getElevation();
                 }
                 // case: skip point
-                while ($currentPoint && $currentPoint->getDistance() < $labelDistance) {
+                while ($currentPoint && $currentPoint->getDistance() <= $labelDistance) {
                     $currentPoint = next($pointCollection[$q]);
                     if ($currentPoint === false) {
                         break;

758) /var/www/src/Track/Processor.php:243    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
                     $lastKnownElevation = $currentPoint->getElevation();
                 }
                 // case: skip point
-                while ($currentPoint && $currentPoint->getDistance() < $labelDistance) {
+                while ($currentPoint && $currentPoint->getDistance() >= $labelDistance) {
                     $currentPoint = next($pointCollection[$q]);
                     if ($currentPoint === false) {
                         break;

759) /var/www/src/Track/Processor.php:245    [M] Identical

--- Original
+++ New
@@ @@
                 // case: skip point
                 while ($currentPoint && $currentPoint->getDistance() < $labelDistance) {
                     $currentPoint = next($pointCollection[$q]);
-                    if ($currentPoint === false) {
+                    if ($currentPoint !== false) {
                         break;
                     }
                     if ($currentPoint->getElevation()) {

760) /var/www/src/Track/Processor.php:245    [M] FalseValue

--- Original
+++ New
@@ @@
                 // case: skip point
                 while ($currentPoint && $currentPoint->getDistance() < $labelDistance) {
                     $currentPoint = next($pointCollection[$q]);
-                    if ($currentPoint === false) {
+                    if ($currentPoint === true) {
                         break;
                     }
                     if ($currentPoint->getElevation()) {

761) /var/www/src/Track/Processor.php:246    [M] Break_

--- Original
+++ New
@@ @@
                 while ($currentPoint && $currentPoint->getDistance() < $labelDistance) {
                     $currentPoint = next($pointCollection[$q]);
                     if ($currentPoint === false) {
-                        break;
+                        continue;
                     }
                     if ($currentPoint->getElevation()) {
                         $lastKnownElevation = $currentPoint->getElevation();

762) /var/www/src/Track/Processor.php:254    [M] Identical

--- Original
+++ New
@@ @@
                         $lastKnownElevation = $currentPoint->getElevation();
                     }
                 }
-                if ($currentPoint === false) {
+                if ($currentPoint !== false) {
                     continue;
                 }
                 // case: skip label

763) /var/www/src/Track/Processor.php:254    [M] FalseValue

--- Original
+++ New
@@ @@
                         $lastKnownElevation = $currentPoint->getElevation();
                     }
                 }
-                if ($currentPoint === false) {
+                if ($currentPoint === true) {
                     continue;
                 }
                 // case: skip label

765) /var/www/src/Track/Processor.php:259    [M] IncrementInteger

--- Original
+++ New
@@ @@
                     continue;
                 }
                 // case: skip label
-                if (isset($labels[$labelIndex + 1])) {
+                if (isset($labels[$labelIndex + 2])) {
                     $nextLabelDistance = $labels[$labelIndex + 1];
                     if ($nextLabelDistance < $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;

766) /var/www/src/Track/Processor.php:259    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     continue;
                 }
                 // case: skip label
-                if (isset($labels[$labelIndex + 1])) {
+                if (isset($labels[$labelIndex + 0])) {
                     $nextLabelDistance = $labels[$labelIndex + 1];
                     if ($nextLabelDistance < $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;

767) /var/www/src/Track/Processor.php:259    [M] Plus

--- Original
+++ New
@@ @@
                     continue;
                 }
                 // case: skip label
-                if (isset($labels[$labelIndex + 1])) {
+                if (isset($labels[$labelIndex - 1])) {
                     $nextLabelDistance = $labels[$labelIndex + 1];
                     if ($nextLabelDistance < $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;

768) /var/www/src/Track/Processor.php:260    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 }
                 // case: skip label
                 if (isset($labels[$labelIndex + 1])) {
-                    $nextLabelDistance = $labels[$labelIndex + 1];
+                    $nextLabelDistance = $labels[$labelIndex + 2];
                     if ($nextLabelDistance < $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;
                         continue;

769) /var/www/src/Track/Processor.php:260    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 }
                 // case: skip label
                 if (isset($labels[$labelIndex + 1])) {
-                    $nextLabelDistance = $labels[$labelIndex + 1];
+                    $nextLabelDistance = $labels[$labelIndex + 0];
                     if ($nextLabelDistance < $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;
                         continue;

770) /var/www/src/Track/Processor.php:260    [M] Plus

--- Original
+++ New
@@ @@
                 }
                 // case: skip label
                 if (isset($labels[$labelIndex + 1])) {
-                    $nextLabelDistance = $labels[$labelIndex + 1];
+                    $nextLabelDistance = $labels[$labelIndex - 1];
                     if ($nextLabelDistance < $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;
                         continue;

771) /var/www/src/Track/Processor.php:261    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
                 // case: skip label
                 if (isset($labels[$labelIndex + 1])) {
                     $nextLabelDistance = $labels[$labelIndex + 1];
-                    if ($nextLabelDistance < $currentPoint->getDistance()) {
+                    if ($nextLabelDistance >= $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;
                         continue;
                     }

772) /var/www/src/Track/Processor.php:261    [M] LessThan

--- Original
+++ New
@@ @@
                 // case: skip label
                 if (isset($labels[$labelIndex + 1])) {
                     $nextLabelDistance = $labels[$labelIndex + 1];
-                    if ($nextLabelDistance < $currentPoint->getDistance()) {
+                    if ($nextLabelDistance <= $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;
                         continue;
                     }

773) /var/www/src/Track/Processor.php:263    [M] Continue_

--- Original
+++ New
@@ @@
                     $nextLabelDistance = $labels[$labelIndex + 1];
                     if ($nextLabelDistance < $currentPoint->getDistance()) {
                         $return[$q][] = $lastKnownElevation;
-                        continue;
+                        break;
                     }
                 }
                 $return[$q][] = $this->getPointElevation($currentPoint, $pointCollection[$q], $lastKnownElevation);

774) /var/www/src/Track/Processor.php:269    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                     }
                 }
                 $return[$q][] = $this->getPointElevation($currentPoint, $pointCollection[$q], $lastKnownElevation);
-                next($pointCollection[$q]);
+                
             }
         }
         return $return;

776) /var/www/src/Track/Processor.php:280    [M] DecrementInteger

--- Original
+++ New
@@ @@
      * Return point elevation.
      * If there is no elevation data then use siblings to generate the elevation
      */
-    public function getPointElevation(Point $point, iterable $pointCollection, $defaultElevation = 0) : ?float
+    public function getPointElevation(Point $point, iterable $pointCollection, $defaultElevation = -1) : ?float
     {
         if ($point->getElevation()) {
             return $point->getElevation();

777) /var/www/src/Track/Processor.php:280    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * Return point elevation.
      * If there is no elevation data then use siblings to generate the elevation
      */
-    public function getPointElevation(Point $point, iterable $pointCollection, $defaultElevation = 0) : ?float
+    protected function getPointElevation(Point $point, iterable $pointCollection, $defaultElevation = 0) : ?float
     {
         if ($point->getElevation()) {
             return $point->getElevation();
