778) /var/www/src/Track/Processor.php:280    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      * Return point elevation.
      * If there is no elevation data then use siblings to generate the elevation
      */
-    public function getPointElevation(Point $point, iterable $pointCollection, $defaultElevation = 0) : ?float
+    public function getPointElevation(Point $point, iterable $pointCollection, $defaultElevation = 1) : ?float
     {
         if ($point->getElevation()) {
             return $point->getElevation();

779) /var/www/src/Track/Processor.php:286    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         if ($point->getElevation()) {
             return $point->getElevation();
         }
-        reset($pointCollection);
+        
         while ($point !== current($pointCollection)) {
             next($pointCollection);
         }

780) /var/www/src/Track/Processor.php:287    [M] NotIdentical

--- Original
+++ New
@@ @@
             return $point->getElevation();
         }
         reset($pointCollection);
-        while ($point !== current($pointCollection)) {
+        while ($point === current($pointCollection)) {
             next($pointCollection);
         }
         next($pointCollection);

781) /var/www/src/Track/Processor.php:288    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         }
         reset($pointCollection);
         while ($point !== current($pointCollection)) {
-            next($pointCollection);
+            
         }
         next($pointCollection);
         while ($previousPoint = prev($pointCollection)) {

782) /var/www/src/Track/Processor.php:290    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         while ($point !== current($pointCollection)) {
             next($pointCollection);
         }
-        next($pointCollection);
+        
         while ($previousPoint = prev($pointCollection)) {
             if ($previousPoint->getElevation()) {
                 return $previousPoint->getElevation();

783) /var/www/src/Twig/PlaceImageExtension.php:20    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getFunctions()
     {
-        return [new TwigFunction('app_place_image', [$this, 'resize'])];
+        return [];
     }
     public function resize(Image $image, int $width, $height) : string
     {

784) /var/www/src/Twig/PlaceImageExtension.php:21    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getFunctions()
     {
-        return [new TwigFunction('app_place_image', [$this, 'resize'])];
+        return [new TwigFunction('app_place_image', ['resize'])];
     }
     public function resize(Image $image, int $width, $height) : string
     {

785) /var/www/src/Twig/PlaceImageExtension.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return [new TwigFunction('app_place_image', [$this, 'resize'])];
     }
-    public function resize(Image $image, int $width, $height) : string
+    protected function resize(Image $image, int $width, $height) : string
     {
         $resizedPath = $this->imagesDirectory;
         $resizedPath .= '/' . $width . '/' . $height;

786) /var/www/src/Twig/PlaceImageExtension.php:28    [M] Assignment

--- Original
+++ New
@@ @@
     public function resize(Image $image, int $width, $height) : string
     {
         $resizedPath = $this->imagesDirectory;
-        $resizedPath .= '/' . $width . '/' . $height;
+        $resizedPath = '/' . $width . '/' . $height;
         $resizedPath .= '/' . $image->getFilepath();
         return $resizedPath;
     }
 }

787) /var/www/src/Twig/PlaceImageExtension.php:29    [M] Assignment

--- Original
+++ New
@@ @@
     {
         $resizedPath = $this->imagesDirectory;
         $resizedPath .= '/' . $width . '/' . $height;
-        $resizedPath .= '/' . $image->getFilepath();
+        $resizedPath = '/' . $image->getFilepath();
         return $resizedPath;
     }
 }

788) /var/www/src/Twig/PlaceTypeFilter.php:13    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function getFilters()
     {
-        return [new TwigFilter('app_place_type', [$this, 'getType'])];
+        return [];
     }
     /**
      * Get string corresponding to a place type

789) /var/www/src/Twig/PlaceTypeFilter.php:14    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function getFilters()
     {
-        return [new TwigFilter('app_place_type', [$this, 'getType'])];
+        return [new TwigFilter('app_place_type', ['getType'])];
     }
     /**
      * Get string corresponding to a place type

790) /var/www/src/Twig/PlaceTypeFilter.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param int $type
      * @return string|null
      */
-    public function getType(int $type) : ?string
+    protected function getType(int $type) : ?string
     {
         switch ($type) {
             case Place::TYPE_GENERIC:

791) /var/www/src/Twig/TrackImageExtension.php:20    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getFunctions()
     {
-        return [new TwigFunction('app_track_image', [$this, 'resize'])];
+        return [];
     }
     public function resize(Image $image, int $width, $height) : string
     {

792) /var/www/src/Twig/TrackImageExtension.php:21    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getFunctions()
     {
-        return [new TwigFunction('app_track_image', [$this, 'resize'])];
+        return [new TwigFunction('app_track_image', ['resize'])];
     }
     public function resize(Image $image, int $width, $height) : string
     {

794) /var/www/src/Type/DifficultyType.php:44    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public function convertToDatabaseValue($value, AbstractPlatform $platform)
     {
-        if (!in_array($value, self::ENUM_VALUES)) {
+        if (in_array($value, self::ENUM_VALUES)) {
             throw new \InvalidArgumentException("Invalid difficulty: " . $value);
         }
         return $value;
     }

795) /var/www/src/Type/DifficultyType.php:45    [M] Throw_

--- Original
+++ New
@@ @@
     public function convertToDatabaseValue($value, AbstractPlatform $platform)
     {
         if (!in_array($value, self::ENUM_VALUES)) {
-            throw new \InvalidArgumentException("Invalid difficulty: " . $value);
+            new \InvalidArgumentException("Invalid difficulty: " . $value);
         }
         return $value;
     }
 }

796) /var/www/src/Upload/ImageUploader.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return array[entity, response]
      */
-    public function addImage(string $id, Request $request, callable $entityCreator) : array
+    protected function addImage(string $id, Request $request, callable $entityCreator) : array
     {
         $parentEntity = $this->entityRepository->findOneBy(['id' => $id]);
         if (!$parentEntity instanceof CreatedAtInterface) {

797) /var/www/src/Upload/ImageUploader.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function addImage(string $id, Request $request, callable $entityCreator) : array
     {
-        $parentEntity = $this->entityRepository->findOneBy(['id' => $id]);
+        $parentEntity = $this->entityRepository->findOneBy([]);
         if (!$parentEntity instanceof CreatedAtInterface) {
             throw new \Exception('Entity must implement SendAtInterface');
         }

798) /var/www/src/Upload/ImageUploader.php:48    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function addImage(string $id, Request $request, callable $entityCreator) : array
     {
         $parentEntity = $this->entityRepository->findOneBy(['id' => $id]);
-        if (!$parentEntity instanceof CreatedAtInterface) {
+        if ($parentEntity instanceof CreatedAtInterface) {
             throw new \Exception('Entity must implement SendAtInterface');
         }
         $file = $request->files->get('file');

799) /var/www/src/Upload/ImageUploader.php:49    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $parentEntity = $this->entityRepository->findOneBy(['id' => $id]);
         if (!$parentEntity instanceof CreatedAtInterface) {
-            throw new \Exception('Entity must implement SendAtInterface');
+            new \Exception('Entity must implement SendAtInterface');
         }
         $file = $request->files->get('file');
         /* @var $file UploadedFile */

800) /var/www/src/Upload/ImageUploader.php:54    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
         $file = $request->files->get('file');
         /* @var $file UploadedFile */
-        if (!$file->isValid()) {
+        if ($file->isValid()) {
             return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $extension = $file->getClientOriginalExtension();

801) /var/www/src/Upload/ImageUploader.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $file = $request->files->get('file');
         /* @var $file UploadedFile */
         if (!$file->isValid()) {
-            return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);

802) /var/www/src/Upload/ImageUploader.php:58    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $file = $request->files->get('file');
         /* @var $file UploadedFile */
         if (!$file->isValid()) {
-            return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [null, new Response(json_encode(['error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);

803) /var/www/src/Upload/ImageUploader.php:59    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $file = $request->files->get('file');
         /* @var $file UploadedFile */
         if (!$file->isValid()) {
-            return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [null, new Response(json_encode(['status' => 2, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);

804) /var/www/src/Upload/ImageUploader.php:59    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $file = $request->files->get('file');
         /* @var $file UploadedFile */
         if (!$file->isValid()) {
-            return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [null, new Response(json_encode(['status' => 0, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);

805) /var/www/src/Upload/ImageUploader.php:60    [M] ArrayItem

--- Original
+++ New
@@ @@
         $file = $request->files->get('file');
         /* @var $file UploadedFile */
         if (!$file->isValid()) {
-            return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [null, new Response(json_encode(['status' => 1, 'error' > $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);

806) /var/www/src/Upload/ImageUploader.php:63    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $file = $request->files->get('file');
         /* @var $file UploadedFile */
         if (!$file->isValid()) {
-            return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, [])];
         }
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);

807) /var/www/src/Upload/ImageUploader.php:69    [M] MBString

--- Original
+++ New
@@ @@
             return [null, new Response(json_encode(['status' => 1, 'error' => $this->translator->trans('Upload failed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $extension = $file->getClientOriginalExtension();
-        $extension = mb_strtolower($extension);
+        $extension = strtolower($extension);
         if (!in_array($extension, ['jpeg', 'jpg', 'png', 'gif'])) {
             return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }

808) /var/www/src/Upload/ImageUploader.php:71    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);
-        if (!in_array($extension, ['jpeg', 'jpg', 'png', 'gif'])) {
+        if (!in_array($extension, ['jpg', 'png', 'gif'])) {
             return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $uploadDirectory = $this->imagesDirectory . DIRECTORY_SEPARATOR;

809) /var/www/src/Upload/ImageUploader.php:71    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);
-        if (!in_array($extension, ['jpeg', 'jpg', 'png', 'gif'])) {
+        if (in_array($extension, ['jpeg', 'jpg', 'png', 'gif'])) {
             return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $uploadDirectory = $this->imagesDirectory . DIRECTORY_SEPARATOR;

810) /var/www/src/Upload/ImageUploader.php:72    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);
         if (!in_array($extension, ['jpeg', 'jpg', 'png', 'gif'])) {
-            return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $uploadDirectory = $this->imagesDirectory . DIRECTORY_SEPARATOR;
         $sqlFilepath = $parentEntity->getCreatedAt()->format('Y') . DIRECTORY_SEPARATOR . $parentEntity->getId();

811) /var/www/src/Upload/ImageUploader.php:75    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);
         if (!in_array($extension, ['jpeg', 'jpg', 'png', 'gif'])) {
-            return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [null, new Response(json_encode(['error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $uploadDirectory = $this->imagesDirectory . DIRECTORY_SEPARATOR;
         $sqlFilepath = $parentEntity->getCreatedAt()->format('Y') . DIRECTORY_SEPARATOR . $parentEntity->getId();

812) /var/www/src/Upload/ImageUploader.php:77    [M] ArrayItem

--- Original
+++ New
@@ @@
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);
         if (!in_array($extension, ['jpeg', 'jpg', 'png', 'gif'])) {
-            return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' > $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
         }
         $uploadDirectory = $this->imagesDirectory . DIRECTORY_SEPARATOR;
         $sqlFilepath = $parentEntity->getCreatedAt()->format('Y') . DIRECTORY_SEPARATOR . $parentEntity->getId();

813) /var/www/src/Upload/ImageUploader.php:80    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $extension = $file->getClientOriginalExtension();
         $extension = mb_strtolower($extension);
         if (!in_array($extension, ['jpeg', 'jpg', 'png', 'gif'])) {
-            return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, ['Content-Type' => 'text/json'])];
+            return [null, new Response(json_encode(['status' => ApiResponseInterface::STATUS_ERROR, 'error' => $this->translator->trans('Image format is not allowed')]), Response::HTTP_BAD_REQUEST, [])];
         }
         $uploadDirectory = $this->imagesDirectory . DIRECTORY_SEPARATOR;
         $sqlFilepath = $parentEntity->getCreatedAt()->format('Y') . DIRECTORY_SEPARATOR . $parentEntity->getId();

814) /var/www/src/Upload/ImageUploader.php:87    [M] Assignment

--- Original
+++ New
@@ @@
         }
         $uploadDirectory = $this->imagesDirectory . DIRECTORY_SEPARATOR;
         $sqlFilepath = $parentEntity->getCreatedAt()->format('Y') . DIRECTORY_SEPARATOR . $parentEntity->getId();
-        $uploadDirectory .= $sqlFilepath;
+        $uploadDirectory = $sqlFilepath;
         $uploadFilename = uniqid() . '.' . $extension;
         $sqlFilepath .= DIRECTORY_SEPARATOR . $uploadFilename;
         $file->move($uploadDirectory, $uploadFilename);

815) /var/www/src/Upload/ImageUploader.php:90    [M] Assignment

--- Original
+++ New
@@ @@
         $sqlFilepath = $parentEntity->getCreatedAt()->format('Y') . DIRECTORY_SEPARATOR . $parentEntity->getId();
         $uploadDirectory .= $sqlFilepath;
         $uploadFilename = uniqid() . '.' . $extension;
-        $sqlFilepath .= DIRECTORY_SEPARATOR . $uploadFilename;
+        $sqlFilepath = DIRECTORY_SEPARATOR . $uploadFilename;
         $file->move($uploadDirectory, $uploadFilename);
         $image = $entityCreator($sqlFilepath, $parentEntity);
         return [$image, new Response(json_encode(['status' => ApiResponseInterface::STATUS_OK]), Response::HTTP_OK, ['Content-Type' => 'text/json'])];
     }

816) /var/www/src/Upload/ImageUploader.php:92    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $uploadDirectory .= $sqlFilepath;
         $uploadFilename = uniqid() . '.' . $extension;
         $sqlFilepath .= DIRECTORY_SEPARATOR . $uploadFilename;
-        $file->move($uploadDirectory, $uploadFilename);
+        
         $image = $entityCreator($sqlFilepath, $parentEntity);
         return [$image, new Response(json_encode(['status' => ApiResponseInterface::STATUS_OK]), Response::HTTP_OK, ['Content-Type' => 'text/json'])];
     }
 }

817) /var/www/src/Upload/ImageUploader.php:99    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $sqlFilepath .= DIRECTORY_SEPARATOR . $uploadFilename;
         $file->move($uploadDirectory, $uploadFilename);
         $image = $entityCreator($sqlFilepath, $parentEntity);
-        return [$image, new Response(json_encode(['status' => ApiResponseInterface::STATUS_OK]), Response::HTTP_OK, ['Content-Type' => 'text/json'])];
+        return [new Response(json_encode(['status' => ApiResponseInterface::STATUS_OK]), Response::HTTP_OK, ['Content-Type' => 'text/json'])];
     }
 }

818) /var/www/src/Upload/ImageUploader.php:102    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $sqlFilepath .= DIRECTORY_SEPARATOR . $uploadFilename;
         $file->move($uploadDirectory, $uploadFilename);
         $image = $entityCreator($sqlFilepath, $parentEntity);
-        return [$image, new Response(json_encode(['status' => ApiResponseInterface::STATUS_OK]), Response::HTTP_OK, ['Content-Type' => 'text/json'])];
+        return [$image, new Response(json_encode([]), Response::HTTP_OK, ['Content-Type' => 'text/json'])];
     }
 }

819) /var/www/src/Upload/ImageUploader.php:104    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $sqlFilepath .= DIRECTORY_SEPARATOR . $uploadFilename;
         $file->move($uploadDirectory, $uploadFilename);
         $image = $entityCreator($sqlFilepath, $parentEntity);
-        return [$image, new Response(json_encode(['status' => ApiResponseInterface::STATUS_OK]), Response::HTTP_OK, ['Content-Type' => 'text/json'])];
+        return [$image, new Response(json_encode(['status' => ApiResponseInterface::STATUS_OK]), Response::HTTP_OK, [])];
     }
 }
